Dialogue_id	Turn_id	Utterance
MUL0268.json	0	I need a train to stansted airport that leaves after 21:30. I am also going to be looking for local places to eat.
MUL0268.json	1	There are several departures to Stansted Airport with one every hour beginning at 22:08. Would you like for me to look up a local restaurant for you?
MUL0268.json	2	I will take a seat on the 22:08 departure as long as it departs from Cambridge on Friday. Yes, please find a restaurant.
MUL0268.json	3	How many tickets shall I book for you on the 22:08 train on Friday from Cambridge to Stansted Airport?
MUL0268.json	4	5 people for the train please.
MUL0268.json	5	Great I have booked your tickets for 5 people leaving at 21:40 and arriving at 22:08. Is there anything else I can help you with?
MUL0268.json	6	Yes I am also looking for a restaurant in the centre of town in the expensive price range.
MUL0268.json	7	The fitzbillies restaurant is in the town center and it meets what you are looking for. Would you like for me to make you a reservation?
MUL0268.json	8	Perfect, can you book it for 5 people on the same day at 16:30?
MUL0268.json	9	Sorry, but they're all full at that time. Would you like to try a different time or perhaps another day?
MUL0268.json	10	Can we try for 15:30? I also need the reference number for the train booking.
MUL0268.json	11	Your reference number for the train is KVNAC7LA . I was able to book Fitzbillies for you at 15:30. Your reference number for the restaurant is UN2K2CD8 . Is there anything else?
MUL0268.json	12	That's all, thank you.
MUL0268.json	13	Are you certain you don't need further assistance?
MUL0268.json	14	Yes, I'm sure. Thanks.
MUL0268.json	15	Have a great trip!
SSNG0112.json	0	I am looking for a place to eat in town centre.
SSNG0112.json	1	There are 69 different places to choose from. What type of food would you like?
SSNG0112.json	2	It doesn't matter as long as it is cheap.
SSNG0112.json	3	I have 15 restaurants that match your description? Is there a specific cuisine you would like?
SSNG0112.json	4	I don't care about the cuisine. Would you book a table for 4 people at 16:00 on Wednesday?
SSNG0112.json	5	I made a reservation for you at J Restaurant at 86 Regent Street. Reference Number UWVRJC3M . Can I help you further today?
SSNG0112.json	6	That will be all. Thank you very much for your help.
SSNG0112.json	7	Your welcome. Have a good day.
MUL0882.json	0	Hi, I'm interested in finding something to do on the north end of town. Are there any boats there that I might be able to visit?
MUL0882.json	1	Yes, the riverboat georgina operates out of that area. Would you like me to provide any additional information?
MUL0882.json	2	Yes please. I would like to get the address and postcode for the riverboat.
MUL0882.json	3	Certainly, their address is cambridge passenger cruisers, jubilee house and their postcode is cb43ax.
MUL0882.json	4	Ok, I need a restaurant in the north side that serves chinese as well.
MUL0882.json	5	There are 3 options for Chinese food on the North side. Would you prefer one that is moderately priced or an expensive one?
MUL0882.json	6	Whichever one would be able to be booked for 4 people at 13:00 on thursday.
MUL0882.json	7	Hakka has been booked, reference number is P1MMD3MO
MUL0882.json	8	Thank you. I'll need a taxi to get me to the restaurant.
MUL0882.json	9	Can you tell me where you would like the taxi to pick you up and at what time?
MUL0882.json	10	I'd like to be picked up from the Georgina, and please make sure I'm there before my booking at Hakka.
MUL0882.json	11	Okay, I've booked a white Ford for you. The contact number is 07504485210. What else can I help you with?
MUL0882.json	12	That's all I need! Thank you!
MUL0882.json	13	Happy to help! Enjoy your trip!
MUL0882.json	14	Thank you very much.
MUL0882.json	15	You're quite welcome. Enjoy!
PMUL1640.json	0	I'd be really happy if you could help me locate a place to stay in Cambridge tonight.
PMUL1640.json	1	Absolutely, are you looking for anything specific?
PMUL1640.json	2	I want an expensive guesthouse with free wifi
PMUL1640.json	3	Which part of town are you looking to stay in?
PMUL1640.json	4	I dont have any preference when it comes to where it is. As long as it is 4 stars
PMUL1640.json	5	I'm sorry, there aren't any guesthouses that fit your requirements.
PMUL1640.json	6	Then how about one in the cheap price range?
PMUL1640.json	7	Cheap we can do! I recommend the Autumn House in the east. Would you like to book a room there?
PMUL1640.json	8	Yes, I would. I need 3 nights, 7 people, starting Wednedady. I need the reference number. I also need a train to Cambridge after 14:45.
PMUL1640.json	9	I was able to book the hotel, reference number is T8ZCCFKU .
PMUL1640.json	10	Great! Now could you help me book a train from Stevenage going to Cambridge on Wednesday?
PMUL1640.json	11	TR9675 leaves Stevenage at 15:54 and arrives in Cambridge at 16:43. Will this work for you?
PMUL1640.json	12	Yes, no need to book, I just need the travel time.
PMUL1640.json	13	The total travel time is 49 minutes for that route.
PMUL1640.json	14	Thanks, that's everything. This is going to be a great trip!
PMUL1640.json	15	You're welcome, and I hope you have a good time.
MUL2398.json	0	I need a place to dine at in the south that serves chinese.
MUL2398.json	1	How about the lucky star?
MUL2398.json	2	Is it in the expensive price range?
MUL2398.json	3	No, Lucky Star is cheap. If you would like an expensive Chinese restaurant, might I suggest the Peking restaurant.
MUL2398.json	4	Yes, that sounds much better. Could you give me their information please?
MUL2398.json	5	The Peking is located at 010 Homerton Street City Centre. The post code is cb28nx. The phone number is 01223354755. Would you like me to book you a table?
MUL2398.json	6	No, that won't be necessary at this time. But, I am looking for places to go in the same area s the restaurant.
MUL2398.json	7	The south end of the city has 8 options to choose from, including parks, theatre, a nightclub, a museum, entertainment, and a cinema. Which would you like to know more about?
MUL2398.json	8	I don't care. Could you pick out something good for me? I just need the postcode and address, too.
MUL2398.json	9	Byard Art is a museum on the south side located at 14 king's parade, cb21sj. Can I help you with anything else?
MUL2398.json	10	Thank you I also need to get a taxi between the two places please.
MUL2398.json	11	I'd be happy to book a taxi for you! Which site are you departing from, and what time would you like to leave and/or arrive?
MUL2398.json	12	i ant to leave the attraction by 19:00.get contact number and car type for me please
MUL2398.json	13	You are all set, the vehicle is a grey skoda, they are reachable at 07920071341, may I help with anything else?
MUL2398.json	14	That should be all. Thank you for your help! Goodbye!
MUL2398.json	15	You're very welcome! Just let us know if you need anything.
SSNG0072.json	0	Hey, I'm trying to find a restaurant called Taj Tandoori. What do you know about that?
SSNG0072.json	1	I show the Taj Tandoori located in the south. They serve Indian style cuisine and are in the expensive price range. May I book a table for you?
SSNG0072.json	2	Yes please. I would like a reservation for 4 people at 15:00 on tuesday.
SSNG0072.json	3	I'm sorry but there wasn't a table available at that time. Would you like to try another restaurant?
SSNG0072.json	4	Yes, please. If you could find one similar to Taj Tandoori, that would be perfect.
SSNG0072.json	5	I'm sorry Taj Tandoori is the only Indian Cuisine available in the south, would you like to try a different cuisine?
SSNG0072.json	6	Sure, but let's try to keep it in the same area and price range please.
SSNG0072.json	7	I booked a table for you at peking restaurant. Reference number is XPE4EOGJ . Anything else today?
SSNG0072.json	8	Okay that is all I need at the moment.
SSNG0072.json	9	Okay. Enjoy your dining experience.
PMUL4550.json	0	Please find a restaurant called Galleria.
PMUL4550.json	1	galleria serves european food in the centre. It is of moderate price. Would you like a phone number or the address?
PMUL4550.json	2	I think it would be great to try European food. Do you think they would accept a reservation for a party of 7?
PMUL4550.json	3	Yes! Would you like to book a table?
PMUL4550.json	4	Yes, for 7 people at 16:45 on Monday. I need a reference number. I need a taxi to commute also a place to visit as well as car type
PMUL4550.json	5	Your table at Galleria is reserved, and your reference number is XM58B7FS . Now, let's see about your other needs - what type of place would you like to visit?
PMUL4550.json	6	I'm also looking for a college to visit in the west.
PMUL4550.json	7	There are 5 colleges in the west. The entrance fees are free or 2.50 pounds. Do you have a preference?
PMUL4550.json	8	pick one that is free and give me the address and phone number
PMUL4550.json	9	magdalene college is on magdalene street, and their number is 01223332138. What else can I help with?
PMUL4550.json	10	I also need a taxi that will get me from the college to the restaurant by 16:45.
PMUL4550.json	11	Booking completed! Booked car type : black honda Contact number : 07095717275
PMUL4550.json	12	Thank you. That's all I need for now.
PMUL4550.json	13	Okay, you are welcome and enjoy your time in Cambridge!
MUL0141.json	0	While in Cambridge I would really like to know where to find a place to eat called meghna.
MUL0141.json	1	Meghna is in the west, address 205 Victoria Road Chesterton, postcode cb43lf.
MUL0141.json	2	Excellent. Can you book that for me please?
MUL0141.json	3	What day and time would you like to make a reservation on and for how many people?
MUL0141.json	4	Scratch that, I'll book it myself. Now I just need to find a place to stay, a hotel with a 4 star rating.
MUL0141.json	5	I have many 4-star hotels. Is there a certain area of town you're looking in, or perhaps a particular price range.
MUL0141.json	6	Yes I would prefer that it's in the west. And I need free parking. That is a hotel style correct?
MUL0141.json	7	I have two hotels that fit your request. One is cheap and the other is expensive. What is your price range?
MUL0141.json	8	I would like a 4 star rating, but price doesn't really matter. What are the prices?
MUL0141.json	9	One is expensive and one is cheap in the 4 star rating.
MUL0141.json	10	I would like the phone number and the address of the expensive one.
MUL0141.json	11	The Huntingdon Marriott Hotel is located at Kingfisher Way, Hinchinbrook Business Park, Huntingdon, with a phone number of 01480446000. Would you like to book it?
MUL0141.json	12	No thank you, Would you book a taxi for me? I want to be picked up at Meghna and leave by 10:15. I would like the Contact Number and Car Type.
MUL0141.json	13	Where is your desired destination?
MUL0141.json	14	The Huntingdon Marriott Hotel where I will be staying.
MUL0141.json	15	I have booked you a red toyota taxi. The contact number is 07193902205
MUL0141.json	16	I also need the phone number for the restaurant that you booked for me, the Meghna.
MUL0141.json	17	The phone number to Meghna is 01223727410. Is there anything else I can help you with?
MUL0141.json	18	No, thank you very much for all of your help today.
MUL0141.json	19	No problem! Have a nice day!
PMUL4071.json	0	I am planning a trip in Cambridge
PMUL4071.json	1	Good choice. What can i help you with?
PMUL4071.json	2	bridge guest house is what Im looking for for 7 people and 3 nights
PMUL4071.json	3	I would like to help you book your hotel. What day would you like to reserve it for?
PMUL4071.json	4	I'd like for it to start on Wednesday.
PMUL4071.json	5	Your reference number is: JN5H0ILV . Can I help with anything else?
PMUL4071.json	6	I'm also looking for a train that gets in to cambridge that day. I won't be able to leave until after 13:15 though.
PMUL4071.json	7	I have many trains available. What is your departure site and time you would like to arrive?
PMUL4071.json	8	I'm looking to come from broxbourne.
PMUL4071.json	9	There are 11 trains that fit your needs. The earliest arrives at 14:32. Would you like for me to book it for you?
PMUL4071.json	10	Pick the best one and please give price and Train ID.
PMUL4071.json	11	How many tickets do you need?
PMUL4071.json	12	I would just like the know the price per ticket please. And the train ID.
PMUL4071.json	13	The train ID is TR3470 and the cost is 17.90 pounds.
PMUL4071.json	14	Thanks so much. That was everything I needed at this time.
PMUL4071.json	15	enjoy your stay in cambridge!
PMUL1125.json	0	I need a train leaving on Friday.
PMUL1125.json	1	Where are you departing from and what is your destination?
PMUL1125.json	2	The train should depart from cambridge and should go to ely.
PMUL1125.json	3	Is there a particular time you'd like to leave?
PMUL1125.json	4	I would like to leave on Friday and should arrive by 08:15.
PMUL1125.json	5	Booking was successful, the total fee is 4.4 GBP payable at the station . Reference number is : 57E550PF .
SNG0269.json	0	I need to find a train that arrives at 12:30 on Wednesday.
SNG0269.json	1	Certainly. Could you tell me where you're departing from and traveling to?
SNG0269.json	2	I am departing from Birmingham new street and going to Cambridge.
SNG0269.json	3	I have seven trains available then, could you tell me what time you would like to leave ?
SNG0269.json	4	Yes I need to arrive in Cambridge by 12:30 please.
SNG0269.json	5	The TR3543 puts you into Cambridge at 12:23. Will that train work for you?
SNG0269.json	6	Yes, that will work. Can you book that train for 8 people? I will also need a reference number.
SNG0269.json	7	Certainly. I have you booked and your reference number is 47MBURBC .
SNG0269.json	8	Great! Thanks, that's all I need.
SNG0269.json	9	Thank you! Have a great day!
SNG0269.json	10	Thank you for all of your help!
SNG0269.json	11	Have a great day!
PMUL1716.json	0	I need to come to Cambridge on Sunday and I'd like to take a train. Do you have anything leaving out of Birmingham New Street on that day?
PMUL1716.json	1	The trip is close to 3 hours. Do you have a preferred departure time?
PMUL1716.json	2	I would like to arrive in Cambridge by 9:15 please.
PMUL1716.json	3	There is one train that arrives by 08:23. Do you want me to book it?
PMUL1716.json	4	Can I get the train ID and also the price for this trip?
PMUL1716.json	5	The train id for that is TR8730 and the price is 60.08 pounds per ticket. Can I help you more today?
PMUL1716.json	6	I am also looking for information on a hotel called autumn house.
PMUL1716.json	7	What would you like to know about it?
PMUL1716.json	8	I want to book it for 5 people for 2 nights starting on the same day as my train trip.
PMUL1716.json	9	booking successful. Ref number is X0JLKVVF . Anything else today?
PMUL1716.json	10	Thank you. That was all I needed today.
PMUL1716.json	11	Have a great trip.
PMUL1716.json	12	Thanks a lot for all your help!
PMUL1716.json	13	Thank you for contacting us and have a nice day.
PMUL3259.json	0	I need a place to stay with free wifi.
PMUL3259.json	1	Ok, I have several hotels. Any particular location?
PMUL3259.json	2	Location doesn't really matter as long as there's free parking available.
PMUL3259.json	3	I have several available. What is your price range?
PMUL3259.json	4	Between $100-$300 per night.
PMUL3259.json	5	How about the Gonville Hotel located in the centre area of town?
PMUL3259.json	6	What is their postcode?
PMUL3259.json	7	Their postcode is cb11Iy, address gonville place, phone 0122336661 they have wifi and free parking too. Would you like me to book this for you?
MUL0167.json	0	I'm looking for a guesthouse in the north area.
MUL0167.json	1	There are 11 available. Would you like to further search by price range and number of stars?
MUL0167.json	2	That would need helpful yes, however I need the hotel to also offer free parking!
MUL0167.json	3	I have found 9 guesthouses fitting this criteria. Do you have a preference on price or stars?
MUL0167.json	4	Yes, please tell me the star ratings.
MUL0167.json	5	The majority of guesthouses available in the North have four stars, with the exception of one guesthouse with 3 stars and one guesthouse with 0 stars.
MUL0167.json	6	I would like a place in the North part of town, and its phone number. I also need a restaurant in the same area that is expensive.
MUL0167.json	7	Let's get your table booked first please. How about Chinese? The Hakka has great cuisine.
MUL0167.json	8	I am actually looking to eat lebanese food.
MUL0167.json	9	I'm sorry there are no results for lebanese food in the north that are expensive. Would you like to try another area, or a different cuisine?
MUL0167.json	10	How about Chinese then?
MUL0167.json	11	There are 2 expensive chinese restaurants in the north. The Hakka is located at Milton Road Chesterton. Would you like me to make a reservation for you?
MUL0167.json	12	Yes please, can I get a phone number, address, and reference number?
MUL0167.json	13	Hakka is located at Milton Road Chesterton, cb41jy. The phone number is 01223568988. Can I help with anything else today?
PMUL1641.json	0	Yeah, I'm hoping to find a cheap place to stay. Can you help with that?
PMUL1641.json	1	Of course! What part of town would you like to stay in?
PMUL1641.json	2	I don't have an area preference but it should have a star of 4 and have free parking.
PMUL1641.json	3	Sure. How about the Allenbell? It is in the east and fits all of your needs.
PMUL1641.json	4	Okay that sounds great.
PMUL1641.json	5	Would you like me to make a booking for you?
PMUL1641.json	6	what's the postcode?
PMUL1641.json	7	The postcode is cb13js. Would you like a reservation?
PMUL1641.json	8	What sort of hotel is it? Guest house or hotel?
PMUL1641.json	9	its a guesthouse
PMUL1641.json	10	Yes please go ahead and book it. I'm also looking for a train.
PMUL1641.json	11	How many people and how many nights should I make the booking for?
PMUL1641.json	12	I just need the postcode and hotel type.
PMUL1641.json	13	sure it is a guesthouse and the postcode is cb13js, anything else today?
PMUL1641.json	14	That is all, thank you so much
PMUL1641.json	15	You earlier mentioned you need train information. Starting from what city and ending at what city?
PMUL1641.json	16	cambridge, travel time, arrival time, and price please
PMUL1641.json	17	I'm sorry, I don't understand your response. Could you please verify from where you are leaving and where you are going?
PMUL1641.json	18	I need help finding a train from leicester to cambridge, departing on sunday after 11:45. No reservation, just need to know travel time, arrival time, and price please.
PMUL1641.json	19	TR9999 leaves at 12:09, travel tine is 105 minutes, cost is 30.24 pounds per person. Any other questions,
PMUL1641.json	20	No, thank you. You have been very patient and helpful. Have a nice day. Bye.
PMUL1641.json	21	Thank you so much for calling. It has been my pleasure. Have a great trip and a wonderful day. Goodbye.
MUL0577.json	0	Hi, I am looking for attractions in the centre of town. Do you have any recommendations?
MUL0577.json	1	There are a lot of attractions to see in the centre, from architecture, colleges, and museums. What kind of attractions are you looking for?
MUL0577.json	2	I'll visit anything. I don't much care the type.
MUL0577.json	3	How about Old Schools? It's an architecture attraction that's free.
MUL0577.json	4	Ok. What is the address and phone number for old schools?
MUL0577.json	5	Old Schools is on Trinity Lane, and their phone number is 01223332320. Can I help with anything else today?
MUL0577.json	6	I also need a train to leave after 10:45 from kings lynn
MUL0577.json	7	There are a quite a few trains that leave from kings lynn. Did you want to leave on a certain day? Or arrive by a certain time?
MUL0577.json	8	The train should leave on monday and should go to cambridge. I don't care about the arrival time.
MUL0577.json	9	The TR0684 which leaves at 11:11 would work well for you. Want me to book that?
MUL0577.json	10	I would like to book that for 8 people please. Can i get the reference number?
MUL0577.json	11	All booked! The reference number is M50TGTUW .
MUL0577.json	12	Thank you for the help! Have a nice day.
MUL0577.json	13	You have a great day too! Don't forget, when you're in a bind, call the Cambridge TownInfo centre!
PMUL0315.json	0	Can you tell me about any cheap priced italian restaurants in cambridge?
PMUL0315.json	1	i got a variety. which is your prefered location?
PMUL0315.json	2	I'd like a place in the centre.
PMUL0315.json	3	I have Pizza Hut City Centre, Ask, and Zizzi Cambridge. Which would you prefer?
PMUL0315.json	4	Zizzi please, can you book me for 6 people on saturday at 16:15?
PMUL0315.json	5	Yes that booking was successful and your reference number is 10TULA8Z .
PMUL0315.json	6	Thanks! I also need to find a cheap hotel.
PMUL0315.json	7	I found The Cambridge Belfry. It is cheap but well valued.
PMUL0315.json	8	Does it have free wifi?
PMUL0315.json	9	Yes, it has free wifi. Would you like me to book it?
PMUL0315.json	10	Yes and I need the reference number. Also I need a taxi to arrive at the restaurant on time. I would like the number and car type please.
PMUL0315.json	11	Let's finish booking the cambridge belfry first. How many people are going to stay?
PMUL0315.json	12	There will be 6 people staying for two nights.
PMUL0315.json	13	What day would you be arriving?
PMUL0315.json	14	We need to check in on Saturday.
PMUL0315.json	15	The booking was successful for 2 nights at The Cambridge Belfry with check-in on Saturday. Reference number NCCFYY9W . Would you like to book that taxi now?
PMUL0315.json	16	Yes, please. I want to book if to get me to the restaurant on time.
PMUL0315.json	17	You are all set the car type is a yellow honda and the contact number is 079969243265. Do you need anything else today?
PMUL0315.json	18	I don't need anything else. Thank you, bye!
PMUL0315.json	19	Have a great trip. Goodbye.
SNG0014.json	0	Hi, could you help me find a taxi out of cocum?
SNG0014.json	1	Could you tell me when you would like to leave by and when you would like to arrive?
SNG0014.json	2	I need to be picked up by 15:00. Could you provide me the car type and contact number, please?
SNG0014.json	3	What is your final destination?
SNG0014.json	4	Oh, I'm sorry. I would like to travel to Gallery at Twelve a High Street. I actually need to be there by 15:00.
SNG0014.json	5	OK, I can make that change.
SNG0014.json	6	When will the car arrive?
SNG0014.json	7	Unfortunately, it does not give me a specific arrival time. But if you like, you can call them to get that information. Their phone number is 07916703661.
SNG0014.json	8	Thanks, I will call them. Can you tell me what type of car I will have?
SNG0014.json	9	Your car type is a white tesla.
SNG0014.json	10	Great Thank you. That is all I need to know.
SNG0014.json	11	Great. Thank you for calling.
SSNG0192.json	0	Id like to eat at an expensive Indian place, know any?
SSNG0192.json	1	There are many to choose from,can I get what area you would like the restaurant to be at to narrow it down?
SSNG0192.json	2	How about in the city centre?
SSNG0192.json	3	There are 6 Indian restaurants that fit this. Would you like me to book one for you?
SSNG0192.json	4	Yes, which of them have the best reviews?
SSNG0192.json	5	I am sorry I cannot see the reviews. I can give you their phone numbers and you may call them if you like.
SSNG0192.json	6	Can you see which ones have availability Sunday at 19:15 for 2 people?
SSNG0192.json	7	Booking was successful. The table will be reserved for 15 minutes. Reference number is : K3EBX9QT . The booking is at the Golden Curry. Need anything else?
SSNG0192.json	8	Nope, that would be it. Thanks for all the help, have a nice day!
SSNG0192.json	9	Thank you for using Cambridge TownInfo centre.
MUL0356.json	0	Hello, I am looking for information on a restaurant name Rice House.
MUL0356.json	1	I have pulled up rice house from our database. What would you like to know?
MUL0356.json	2	I'd like to reserve a table for 7 on Thursday, at 11:15. Are you able to book that for me please?
MUL0356.json	3	I am unable to book for that day or time slot. Is there another day or time that would work for you?
MUL0356.json	4	What about 10:15?
MUL0356.json	5	I was able to book a table for 7 at Rice house at 10:15 on Thursday. Your table will be reserved for 15 minutes. Your confirmation number is DAKQ9ZBN .
MUL0356.json	6	Great, thanks! I'll also need a train leaving after 11:45 on Friday.
MUL0356.json	7	I have many trains leaving Cambridge after 11:45 on Friday. Where would you like to go?
MUL0356.json	8	I would like to go to Kings lynn.
MUL0356.json	9	TR2621 leaves at 12:11 going to Kings Lynn. Would you like me to book that for you?
MUL0356.json	10	Yes please book it for 7 people and give me the reference number
MUL0356.json	11	You are booked. Your reference number is BL1TV17C . Anything else?
MUL0356.json	12	No, I am all set. Thanks!
MUL0356.json	13	Thank you, please enjoy your visit!
MUL1035.json	0	I am looking for a train that departs on Friday.
MUL1035.json	1	Are you looking for a train or a taxi? Where would you like to depart from?
MUL1035.json	2	Actually, I'd rather find information about a park, somewhere on the south end of town if possible.
MUL1035.json	3	Sure. There is a cinema at cambridge leisure way. Would you like to have more information about that?
MUL1035.json	4	No thank you. I was actually looking for a park and not a cinema. Is there a park on the south side of town?
MUL1035.json	5	There are two parks in the south area of town. Sheep's Green and Lammas Land Park Fen Causeway and Wandlebury Country Park. Would you like to know more about either?
MUL1035.json	6	Yes, could you give me the postcode for Wandlebury Country Park?
MUL1035.json	7	The postcode for Wandlebury Country Park is cb223ae. Do you need any more information?
MUL1035.json	8	Yes. I'd also like to book a hotel for 4 people.
MUL1035.json	9	There are 4 hotels in the south area. Would you like more information about them?
MUL1035.json	10	Is there a hotel called Hobsons House?
MUL1035.json	11	Yes, Hobsons House is a guesthouse in the west side of town, moderately priced. Would you like to book a room there?
MUL1035.json	12	Yes, I want to book it starting Wednesday for 4 nights. It should be for 4 people.
MUL1035.json	13	Sure, I booked it. The reference number is ZZAG4CC0 . Can I help you with anything else?
MUL1035.json	14	I would also like a taxi and need to leave the hotel by 24:00.
MUL1035.json	15	I booked a Grey BMW for you. Contact number is 07674785163. Can I be of further assistance?
MUL1035.json	16	No, that's all I need. Thanks.
MUL1035.json	17	Great! Have a wonderful day! Goodbye!
PMUL1060.json	0	A friend told me about an attraction called the scott polar museum.
PMUL1060.json	1	Yes, there is. It's located in the centre area and has free admission. Would you like more information about it?
PMUL1060.json	2	I need the attraction type and address.
PMUL1060.json	3	The Scott Polar Museum is a museum located on Lensfield Road. Would you also like their phone number?
PMUL1060.json	4	No but I do need a train that will depart from peterborough and should go to cambridge.
PMUL1060.json	5	When would you like to depart or arrive?
PMUL1060.json	6	I'd like to depart after 15:00 on thursday no preference on arrival.
PMUL1060.json	7	TR8509 will leave Peterborough at 15:19 and arrive in Cambridge at 16:09. Would you like to book tickets on this train?
PMUL1060.json	8	maybe, what's the duration of the train ride?
PMUL1060.json	9	The duration of the train ride is 50 minutes.
PMUL1060.json	10	And how much is a ticket?
PMUL1060.json	11	The ticket price is 16.50 pounds. Would you like me to book that for you?
PMUL1060.json	12	No, I think I'll hold off on that. That's it for today. Thanks for your help. Have a great day.
PMUL1060.json	13	Are you sure that there is absolutely nothing else that you need?
PMUL1060.json	14	No than kyou.
PMUL1060.json	15	Ok! Have a great day!
SSNG0091.json	0	Can you please help me find a cheap italian restaurant?
SSNG0091.json	1	I show five that fit your criteria. May I ask the location you are in? This would help refine our search.
SSNG0091.json	2	It doesn't matter what area. Can you book a table for 2 people at 11:00 on Wednesday.
SSNG0091.json	3	Would you like more details on any of the available restaurants before booking a table?
SSNG0091.json	4	If there is one that you know of that you recommend, that would be fine. I don't know any, so some guidance would be great.
SSNG0091.json	5	How about la margherita?
SSNG0091.json	6	Okay as long as it's in the same price range.
SSNG0091.json	7	La Margherita was unavailable. I was able to book you at Zizzi Cambridge which is in the same price range. Your reference number is QRJ5MP30 . Is this acceptable?
SSNG0091.json	8	Great Yes it is and thank you.
SSNG0091.json	9	Will you be needing anything else today?
SSNG0091.json	10	No, that's all. Thanks again for your help.
SSNG0091.json	11	Thank you for using our service.
PMUL4371.json	0	I am looking for a restaurant called shanghai family restaurant.
PMUL4371.json	1	Yes I have it here. They are in the centre of town, moderately priced. When would like to reserve a table for?
PMUL4371.json	2	7 People at 19:15 and can we do that on monday?
PMUL4371.json	3	Your reservation at shanghai family restaurant this monday at 19:15 for 7 people was successful. Your Reference number is : QH390F14 .
PMUL4371.json	4	Thank you for booking that for me.
PMUL4371.json	5	My pleasure! anything else I can help you with?
PMUL4371.json	6	I am also looking for a train leaving on Tuesday from Cambridge.
PMUL4371.json	7	Where are you headed, and at what time of day?
PMUL4371.json	8	I would like to get to Ely by 17:45, please.
PMUL4371.json	9	Train TR4447 is available. It leaves at 15:50 and arrives by 16:07. Would you like me to book you a ticket?
PMUL4371.json	10	Yes please, I'll need it for 7 people
PMUL4371.json	11	confirmation # is ttc5x0up, anything else today?
PMUL4371.json	12	Thats everything thanks for the help
PMUL4371.json	13	Terrific. I hope you enjoy your trip. Goodbye.
SNG01915.json	0	I need a taxi to go to cambridge punter.
SNG01915.json	1	I can help you with that, where are you departing from?
SNG01915.json	2	I'm leaving from addenbrookes hospital.
SNG01915.json	3	What time would you like to leave addenbrookes hospital?
SNG01915.json	4	I want to leave the hospital after 08:15, please.
SNG01915.json	5	Your taxi is booked. Look for a blue Toyota.
SNG01915.json	6	What is the contact number for the blue Toyota?
SNG01915.json	7	The contact number is 07738411271. Is there anything else we can help you with?
SNG01915.json	8	No that was all, thank you!
SNG01915.json	9	You are welcome. Have a nice day.
PMUL2355.json	0	I am traveling to Cambridge and excited about seeing local tourist attractions, can you help?
PMUL2355.json	1	Do you have an attraction type preference?
PMUL2355.json	2	Yes, I would like to see a museum. Can you tell me the postcode and entrance fee for it?
PMUL2355.json	3	I have 23 places. What area would you prefer to be in?
PMUL2355.json	4	I have no particular area preference. Can you list a few for me to select from?
PMUL2355.json	5	There is Cafe Jello Gallery in the west, Cambridge Artworks in the east and Broughton House Gallery in the centre. Does any of those sound appealing?
PMUL2355.json	6	Yes could I have their postcode and entrance fee?
PMUL2355.json	7	Cafe jello gallery postcode is cb30af and the entrance is free, is there anything else I can do for you?
PMUL2355.json	8	I am also looking for the restaurant Yu Garden.
PMUL2355.json	9	Here is the address 529 Newmarket Road Fen Ditton.
PMUL2355.json	10	Can you give me more information about Yu Garden.
PMUL2355.json	11	Of course! It is a chinese cuisine restaurant located in the east. Anything else you would like to know?
PMUL2355.json	12	Just the price range and postal code please.
PMUL2355.json	13	Their price range is expensive and the postcode is cb58pa. Are you sure that is all you needed?
PMUL2355.json	14	that is it. thank you for helping me
PMUL2355.json	15	You're welcome! Enjoy your visit!
MUL2522.json	0	Hello, I am planing to visit Cambridge and I am looking for a swimmingpool.
MUL2522.json	1	Okay, there are four places in town. Do you prefer a particular area?
MUL2522.json	2	It doesn't matter. I will need the address, phone number, and area of town.
MUL2522.json	3	Ok, I recommend parkside pools in the centre of town, they are located on gonville place and are reachable at 01223446100.
MUL2522.json	4	That's great thanks. Also I need a hotel in the south.
MUL2522.json	5	I have 4 different options for you. 3 guesthouses and 1 hotel. The hotel is expensive, whereas the others are moderate or cheap. Do you have a preferred price range?
MUL2522.json	6	Not really, just get me one with 3 stars please
MUL2522.json	7	There are 2, The Bridge a moderately priced and the Lensfeild inthe expensive price range. Both are in the South and offer free parking and internet.
MUL2522.json	8	The Bridge is fine, please.
MUL2522.json	9	Would you like to book the Bridge Guest House?
MUL2522.json	10	Yes please, could you make a booking for me?
MUL2522.json	11	What day and time would you like to go?
MUL2522.json	12	I'm sorry, but I don't need a booking anymore. Could you tell me if they have free parking?
MUL2522.json	13	yes they do have free parking
MUL2522.json	14	Okay, thanks. Do they also have free internet?
MUL2522.json	15	They sure do!
MUL2522.json	16	Great! Thank you for your help. Goodbye!
MUL2522.json	17	You're welcome. Glad I could help. Have a nice day.
SNG0062.json	0	I need a taxi to take me to Thanh Binh and I should arrive before 22:15.
SNG0062.json	1	Could you tell me where you would like to leave from?
SNG0062.json	2	I am leaving from the Shiraz restaurant. Can I get the car type and contact number please?
SNG0062.json	3	Sure! It is a black Toyota and the contact number is 07604345180
SNG0062.json	4	Thanks, that all I need today.
SNG0062.json	5	Thank you! If you need anymore help, feel free to contact us at any time. Have a great day!
PMUL4494.json	0	Find me a place called maharajah tandoori restaurant, please
PMUL4494.json	1	Yes, maharajah tandoori restaurant serves Indain food and is located in the west. They are the expensive price range. Would you like to book a table there?
PMUL4494.json	2	Yes, please book a table for 3 at 12:15 on Monday.
PMUL4494.json	3	Booking was successful. The table will be reserved for 15 minutes. Reference number is : QOES657A .
PMUL4494.json	4	Great thank you
PMUL4494.json	5	No thank you that will be all
SSNG0054.json	0	I am looking for a Cuban food place, in the east.
SSNG0054.json	1	I am sorry but there aren't any restaurants matching your criteria. Can I help you with something else?
SSNG0054.json	2	Can you check again? The only thing I'm interested in is a moderately priced Cuban restaurant in the east.
SSNG0054.json	3	I apologize I am still not showing any restaurants that meet your criteria. Is there another type of cuisine you would prefer?
SSNG0054.json	4	Do you have a moderately priced Indian restaurant in the east?
SSNG0054.json	5	Yes I have 2. Curry Prince and Rajmahal.
SSNG0054.json	6	I will try the Curry Prince. Can you book a table for 4 people on Monday at 17:30?
SSNG0054.json	7	I apologize booking was unsuccessful. Would you like me to try Rajmahal
SSNG0054.json	8	Yes, try that.
SSNG0054.json	9	I have you at Rajmahal, Reference number is : T44KC552 . Anything else you need?
SSNG0054.json	10	No, thank you. You have been very helpful. Have a great day.
SSNG0054.json	11	Here is the address and the phone number: 7 Barnwell Road Fen Ditton, 01223244955.
SSNG0054.json	12	Thanks again for helping to find me a place to eat. I have the reference number T44KC552.
SSNG0054.json	13	Enjoy your meal at the rajmahal. Have a great day.
PMUL4926.json	0	I am looking for a restaurant. The restaurant should serve modern american food and should be in the centre
PMUL4926.json	1	I'm sorry, we don't have any restaurants like that in the centre.
PMUL4926.json	2	Do you have a similar restaurant that is close to centre?
PMUL4926.json	3	I have the Gourmet Burger Kitchen, serving North American cuisine in the center of town.
PMUL4926.json	4	Yes, I would like that.
PMUL4926.json	5	Would you like me to book that for you? What day and time? How many people?
PMUL4926.json	6	I'm sorry I misread that you said north american. If there's no modern american, then can you try italian instead?
PMUL4926.json	7	Certainly. And you have 9 choices in Italian cuisine. Do you have a price range in mind?
PMUL4926.json	8	Expensive italian will do.
PMUL4926.json	9	I recommend the Caffe Uno. They are located at 32 Bridge Street, Centre. Would you like me to book it for you?
PMUL4926.json	10	No thanks, I just need the phone number please.
PMUL4926.json	11	The phone number is 01223448620. Is there anything else I can do for you today?
PMUL4926.json	12	Yes, I'm also looking for a place to stay. I'd like it to be in the north and same price range as the restaurant.
PMUL4926.json	13	Unfortunately, I don't show anything in the north that is expensive. Can I try another area or price range for you?
PMUL4926.json	14	Is there anything in the moderate price range?
PMUL4926.json	15	Yes, there are several places that meet that criteria. Do you have star preference or any other criteria?
PMUL4926.json	16	Yes I would prefer a 4 star and would like for it to have free parking.
PMUL4926.json	17	I have several options in the north meeting those requirements. Would you prefer a guesthouse or a hotel?
PMUL4926.json	18	I have no preference. What do you recommend?
PMUL4926.json	19	acorn guest house is my favourite.
PMUL4926.json	20	What area is that in again?
PMUL4926.json	21	It is located in the north. They are moderately priced. They are 4 star rated and offer free internet and parking. Do you need me to book a room?
PMUL4926.json	22	get me their phone number and hotel type
PMUL4926.json	23	They are a guesthouse and the phone number is 01223353888.
PMUL4926.json	24	Thank you very much for your time. Have a nice day!
PMUL4926.json	25	You too, enjoy your stay.
SNG0154.json	0	I think I may have hurt myself. Where is the nearest hospital?
SNG0154.json	1	It is on Hills Rd, Cambridge. Do you need any help?
SNG0154.json	2	Ok, can you please give me the phone number and postcode?
SNG0154.json	3	The number is 01223245151 and the post code is CB20QQ. Do you need an officer?
PMUL3945.json	0	I am planning a trip in Cambridge
PMUL3945.json	1	Excellent! What would you like to know?
PMUL3945.json	2	I need a train that will leave monday ggo to Cambridge at 12:00
PMUL3945.json	3	Where will you be departing from?
PMUL3945.json	4	I will be leaving London Liverpool Street.
PMUL3945.json	5	The closest thing I have to your departure time is the TR6226 which leaves at 13:39.
PMUL3945.json	6	Okay. I also need to find a guesthouse to stay in the expensive price range.
PMUL3945.json	7	I have 9 guesthouses that fall in the inexpensive category. What part of town do you prefer?
PMUL3945.json	8	I prefer an expensive hotel in the north please
PMUL3945.json	9	I don't have any in that area, another perhaps?
PMUL3945.json	10	How about one in the moderate price range then.
PMUL3945.json	11	There are 9 places available. Do you have a preference in rating?
PMUL3945.json	12	I prefer a four star hotel, please. And can you tell me whether one has free parking?
PMUL3945.json	13	How does acorn guesthouse sound? It is in the north and moderately priced.
PMUL3945.json	14	That sounds nice, thank you. May have their number and postcode, please?
PMUL3945.json	15	The phone number is 01223353888. The post code is cb41da. Would you like me to book a reservation for you?
PMUL3945.json	16	No thanks. Do they have free parking?
PMUL3945.json	17	yes they have free parking
PMUL3945.json	18	Thank you for your assistance. I will do the booking, myself.
PMUL3945.json	19	Sounds good. Is there anything else I can help you with?
PMUL3945.json	20	that is fine for today. thank you
PMUL3945.json	21	Please call again if we can further assist you. Have a great day. Goodbye.
SNG0276.json	0	I'm looking for a train going to Cambridge that leaves at 11:30.
SNG0276.json	1	There are 924 trains leaving by 11:30. What is your departure city?
SNG0276.json	2	Birmingham new street
SNG0276.json	3	I'm sorry but the earliest train departing from Birmingham New Street is 11:40. Can I investigate another departure location or time for you?
SNG0276.json	4	no thank you
SNG0276.json	5	Okay, have a great day!
PMUL0063.json	0	I'm looking for a hotel called avalon.
PMUL0063.json	1	Ok I have found the hotel. Would you like to book a room?
PMUL0063.json	2	Great, yes please. There will be 7 of us arriving on Wednesday. We'd like to stay for 4 nights.
PMUL0063.json	3	You reservation was booked. The reference number is KB5QHVIU . Do you need help with anything else?
WOZ20012.json	0	I would like a moderately priced steakhouse restaurant.
WOZ20012.json	1	There are no moderately priced steakhouse restaurants. Would you like to change your query?
WOZ20012.json	2	How about moderately priced British food?
WOZ20012.json	3	There are four options in centre and one option in west. Do you have a preference on the area?
WOZ20012.json	4	Can you give me the phone numbers please
WOZ20012.json	5	Do you want the phone numbers to Restaurant One Seven?
WOZ20012.json	6	Okay, so may I have the number please?
WOZ20012.json	7	Restaurant One Seven's phone number is 01223 337766.
WOZ20012.json	8	Thank you, goodbye
WOZ20012.json	9	Have a nice day
SNG0915.json	0	Could you help me find Cityroomz, please?
SNG0915.json	1	I sure can. CityRoomz is located in the centre of town. They offer free wifi. They are at Sleeperz Hotel, Station Road. Their phone number is 01223304050.
SNG0915.json	2	Can you book a room for me there? We'll be arriving on Saturday and need to stay 4 nights. There will be 7 of us staying.
SNG0915.json	3	I was able to book Cityroomz for you on Saturday for 4 night, 7 people. Your reference number is 5B7M73DK . Is there anything else I can help with?
SNG0915.json	4	Nope, that'll be all, thanks. Bye!
SNG0915.json	5	Thank you for contacting Cambridge TownInfo centre. Have a great day!
SNG0887.json	0	I'm looking for a place to stay. Are there any guesthouses that are moderately priced?
SNG0887.json	1	Oh, yes. I have about 15 different options for you. Is there an area of town you prefer to stay in?
SNG0887.json	2	No, I really don't care what area, but I would like it to have a 4 star rating.
SNG0887.json	3	I have several 4-star guesthouses. Might I suggest the Warkworth house. It's located in the east and offers both free wifi and parking.
SNG0887.json	4	That sounds perfect so long as it has free parking.
SNG0887.json	5	It certainly does. Would you like to make a reservation?
SNG0887.json	6	Yes. I'll need it for 4 people starting on Saturday. We'll be there for 5 nights.
SNG0887.json	7	I'm sorry, the Warkworth is unavailable for your dates. Perhaps you are flexible with your dates?
SNG0887.json	8	Well, is it available for at least 4 nights?
SNG0887.json	9	I'm sorry, four nights isn't possible either.
SNG0887.json	10	Actually, I misspoke. I need the room for 5 people, for 5 nights, starting Saturday. If that doesn't work, 4 nights is fine.
SNG0887.json	11	Your reservation for 5 people has been made for a 4 day stay at Warkworth House, arriving Saturday. Your reference number is 6DF5Q5QJ . Is there anything else I can do?
SNG0887.json	12	No, that's it. Thank you very much.
SNG0887.json	13	No problem at all. Have a great day.
SNG0146.json	0	I was robbed and I need some help.
SNG0146.json	1	The number for the Parkside Police Station is 01223358966. They're located at Parkside, Cambridge CB11JG. Can I help you with anything else?
SNG0146.json	2	Okay, thanks. I'll call them. That's all I need for now.
SNG0146.json	3	I hope everything works out for you. Good bye.
MUL2473.json	0	You may help me by finding a Muslim restaurant for me to eat at please.
MUL2473.json	1	I'm sorry, but I'm not showing any Muslim restaurant listings. Is there another type of food you would like to try?
MUL2473.json	2	can you book the backstreet bistro for me ?
MUL2473.json	3	sure when would you like to eat?
MUL2473.json	4	I'd like to book a table for two around 19:45 on wednesday.
MUL2473.json	5	I was able to book a table for two at the restaurant. Your confirmation number is DI0KD8LZ . The table will be reserved for 15 minutes.
MUL2473.json	6	Thanks. Next can I get some info on theatre's in the centre?
MUL2473.json	7	I have four places there, what would you like to know?
MUL2473.json	8	Can you recommend one for me please?
MUL2473.json	9	ADC is a good place, what would you like to know?
MUL2473.json	10	Could you give me their address?
MUL2473.json	11	The address is park street. Is there anything else I could help you with?
MUL2473.json	12	I would also like to know about any attractions that is in the centre of town that is a theatre type.
MUL2473.json	13	There is also Cambridge Arts Theatre, Mumford Theatre, and The Cambridge Corn Exchange.
MUL2473.json	14	Could I get the address for the Cambridge Arts Theatre?
MUL2473.json	15	The cambridge arts theatre is located at 6 saint edward's passage. postcode cb23pj
SNG0849.json	0	Can you navigate me to a 5 star hotel with free wifi please?
SNG0849.json	1	I was unable to find any hotels matching those requirements.
SNG0849.json	2	Do you have a place with free wifi in the cheap range with a star of 4?
SNG0849.json	3	I've found 21 hotels that meet those criteria. The Allenbell is one. Should I book it?
SNG0849.json	4	What type of hotels are they?
SNG0849.json	5	The Allenbell is a guesthouse. Do you have any other specifications I can narrow your search by?
SNG0849.json	6	looking for something with 5 stars and free wifi
SNG0849.json	7	Sorry, but we've already established that there are no 5-star hotels available. I can provide you with some 4-star options.
SNG0849.json	8	Sorry, how silly of me. I want to stay at a hotel, not a guesthouse. A cheap 4 star with free wifi, please.
SNG0849.json	9	Okay, we've got the the cambridge belfry. Shall I book you a room?
SNG0849.json	10	I don't need it booked just yet. I just needed the info, thanks.
SNG0849.json	11	All right. Is there anything else I can do for you?
SNG0849.json	12	No, thank you for your patience. I am all set now. Bye.
SNG0849.json	13	Great! Have a wonderful day! Goodbye!
PMUL2498.json	0	I am looking for information on attractions in the west side of town.
PMUL2498.json	1	Do you have any attraction type in mind?
PMUL2498.json	2	Not really, but I do need a postcode.
PMUL2498.json	3	You can visit the Cambridge and County Folk Museum, it is located at 2-3 castle street and the admission price is 3.50 pounds.
PMUL2498.json	4	thanks! can you help me find a restaurant in that area? I want to spend a lot of money
PMUL2498.json	5	What type of food are you interested in?
PMUL2498.json	6	I'm open to suggestions.
PMUL2498.json	7	I would suggest graffiti
PMUL2498.json	8	Okay. Why type of food do they serve and I need the postcode then too please
PMUL2498.json	9	Graffiti serves British food, and they're located in postcode cb30lx.
PMUL2498.json	10	Great. Thanks for your assistance!
PMUL2498.json	11	You are welcome. I forgot to get you the postcode for Cambridge County you asked for. It is cb30aq. Will that be all for today?
PMUL2498.json	12	that is all the information I need today thank you.
PMUL2498.json	13	You're welcome. Have a great day.
SNG01476.json	0	I want help booking a taxi
SNG01476.json	1	Okay, what is your destination?
SNG01476.json	2	I am going to the Cambridge county fair next to the city tourist museum.
SNG01476.json	3	And when would you like to leave?
SNG01476.json	4	I want to leave after 16:45
SNG01476.json	5	And where will you be leaving from?
SNG01476.json	6	Leaving from travelers rest
SNG01476.json	7	Booking completed! Booked car type : white ford Contact number : 07267142867
SNG01476.json	8	Perfect! Thank you so much for all of your help.
SNG01476.json	9	You are more than welcome!
PMUL4243.json	0	I'm looking for a expensive guesthouse.
PMUL4243.json	1	Would you settle for a moderately priced 4 star?
PMUL4243.json	2	Are there any expensive guesthouses in any area? I just need it to have free parking.
PMUL4243.json	3	I'm afraid not. Would you prefer a cheaper one, or perhaps a hotel?
PMUL4243.json	4	Sure, I'll go with a cheap one.
PMUL4243.json	5	Alexander bed and breakfast is available, would you like to book it?
PMUL4243.json	6	No, I don't need to book at the moment, but I would like the address.
PMUL4243.json	7	Certainly! Their address is 56 Saint Barnabas Road. Is there anything more I can help you with?
PMUL4243.json	8	I also need a train arriving by 17:45 on Sunday.
PMUL4243.json	9	How about TR7423? it leaves at 0500
PMUL4243.json	10	Sorry the train should arrive in Leicester by 17:45 and depart from Cambridge on Sunday.
PMUL4243.json	11	How silly of me to recommend an early morning train when you need to be there in the afternoon, I apologize TR9992, arrives by 17:06, interested in tickets?
PMUL4243.json	12	Could you please let me know when that departs and what the total travel time is?
PMUL4243.json	13	Let me check into that for you.
PMUL4243.json	14	Thank you, please.
PMUL4243.json	15	That departs at 15:21 and the total travel time is 105 minutes.
PMUL4243.json	16	Thank you very much for your help today!
PMUL4243.json	17	Is there anything else I can do for you?
PMUL4243.json	18	nope, that's it thanks!
PMUL4243.json	19	Have a wonderful day!
PMUL4401.json	0	I am looking for information in Cambridge.
PMUL4401.json	1	Can you be more specific please?
PMUL4401.json	2	Oops, sorry. I should have given you more info. I am wanting to find a train to get me to Bishops Stortford.
PMUL4401.json	3	Could you tell me what day and time you are wanting to leave?
PMUL4401.json	4	Me and 6 of my friends want to leave sometime after 8:30.
PMUL4401.json	5	Please tell me what place you want to depart from?
PMUL4401.json	6	I'll be leaving cambridge on Tuesday and need a booking.
PMUL4401.json	7	Ok, the first train after 8:30 is TR1562 and it leaves at 09:29, shall I book you?
PMUL4401.json	8	Yes, for 7. Please give me the reference number.
PMUL4401.json	9	Alright, you're all booked up. It will cost 70.7 GBP at the station, and your reference number is UXGLG4VF . Can I help you with anything else?
PMUL4401.json	10	Can I get an expensive place to stay? A hotel more specifcally, 2 stars please.
PMUL4401.json	11	There is only one in that price range. It is express by holiday inn cambridge.
PMUL4401.json	12	Can you book a room for me?
PMUL4401.json	13	Of course! What day, how many people, and how many nights?
PMUL4401.json	14	I'm looking just for the phone number, address, and area of the hotel.
PMUL4401.json	15	Would you like express by holiday inn?
PMUL4401.json	16	Yes, that one would be perfect. I need the address, phone number and area please.
PMUL4401.json	17	It is located in the east area at 15-17 Norman Way, Coldhams Business Park. The phone number is 01223866800.
PMUL4401.json	18	that is all i wanted to know for today thank you
PMUL4401.json	19	You're welcome, have a great day!
SNG0854.json	0	I'm needing a place to stay that is in the centre of town.
SNG0854.json	1	I have several options for you in the center of town. Do you have a price range in mind?
SNG0854.json	2	I don't care about the price range, but I need free parking, please.
SNG0854.json	3	I have narrowed it down to 4 options. I have 2 cheaper ones that are guesthouses, and 2 expensive hotels. Do you have a preference?
SNG0854.json	4	I would prefer a hotel with 4 stars please, are either of those 4 stars with free parking? And also do either have free wifi?
SNG0854.json	5	You might be interested in the University Arms Hotel. Should I book you a room?
SNG0854.json	6	I don't want to book it right now. Can I get the phone number and postcode, please?
SNG0854.json	7	Yes, the phone number is 01223351241 and the postcode is cb21ad. May I help you with anything else?
SNG0854.json	8	Just to verify, the University Arms offers free WiFi and free parking?
SNG0854.json	9	Indeed, they do!
SNG0854.json	10	Great! That is wonderful! Have a great day!
SNG0854.json	11	I hope you have a wonderful day as well.
SNG01764.json	0	I am looking for the Addenbrookes Hospital
SNG01764.json	1	Addenbrookes Hospital is located at Hills Rd, Cambridge, postcode CB20QQ. Would you like their phone number?
SNG01764.json	2	No, that's all I need. Thank you.
SNG01764.json	3	You are most welcome!
WOZ20516.json	0	I want a moderately priced restaurant and serves asian oriental food. What is the address and phone number?
WOZ20516.json	1	there is an Asian Oriental place at 40428 King Street City Centre. You can call them at 01223 518111.
WOZ20516.json	2	Thank you goodbye.
WOZ20516.json	3	Thank you for using our system! Have a great day!
PMUL1532.json	0	Hello, I need to take a train to Norwich on Tuesday, can you please tell me what's available?
PMUL1532.json	1	We have 19 trains that meet that criteria, where will you be departing from?
PMUL1532.json	2	cambridge and should leave after 14:45
PMUL1532.json	3	Train TR6524 would work for you. Would you like me to book you passage?
PMUL1532.json	4	Yes please book TR6524 on tuesday leaving at 14:45 going to norwich from cambridge. Please confirm departure time. Thank you.
PMUL1532.json	5	Will you only need 1 ticket? The train will leave Cambridge at 15:36.
PMUL1532.json	6	I just need the train travel time , please.
PMUL1532.json	7	the travel time is 79 minutes. anything else today?
PMUL1532.json	8	Yes please, I'm looking for a guesthouse with free wifi. The area doesn't matter.
PMUL1532.json	9	I found a result for A and B Guest House in east that has internet. Would you like more info?
PMUL1532.json	10	Yes, I'm celebrating a special occasion, so money is no object. Is A and B an expensive, 4-star guesthouse?
PMUL1532.json	11	A and B guesthouse is moderately priced. Could you like an expensive guesthouse instead?
PMUL1532.json	12	yes i am rich I need expensive
PMUL1532.json	13	I don't have a expensive guesthouse.
PMUL1532.json	14	how about a hotel type instead?
PMUL1532.json	15	There are a few available. I highly suggest the University Arms Hotel. Would you like to book a room?
PMUL1532.json	16	Yes, please book for 5 people, for 4 nights starting on friday.
PMUL1532.json	17	Booking was successful the Reference number is : ECPE3KUV . Is there anything else I can assist you with?
PMUL1532.json	18	No. Thanks.
PMUL1532.json	19	Great. I'm glad I could be of help.
PMUL1532.json	20	Have a nice day.
PMUL1532.json	21	Thank you for calling.
PMUL1416.json	0	I want a train leaving from cambridge.
PMUL1416.json	1	Okay. I have 566 trains leaving Cambridge. Can we narrow it down a little?
PMUL1416.json	2	I need it to leave after 12:15 on Saturday.
PMUL1416.json	3	We have over 100 results. Where is your destination?
PMUL1416.json	4	My destination is leicester.
PMUL1416.json	5	I would recommend TR2129 which leaves Cambridge at 12:21 and arrives in Leicester at 14:06.
PMUL1416.json	6	Awesome, book me one ticket please
PMUL1416.json	7	Your reference number is V34K85R7 . Is there anything else I can help you with?
PMUL1416.json	8	I also need to find an attraction while I'm there.
PMUL1416.json	9	Certainly, there are many great attractions here. Do you have a preference for the type or location?
PMUL1416.json	10	It should be in the centre of town. What type of attractions are available?
PMUL1416.json	11	In the centre there is architecture, boats, cinemas, colleges, museums, nightclubs, theatres, parks, and pools.
PMUL1416.json	12	You choose. Can you tell me the attraction type and phone number?
PMUL1416.json	13	How about Club Salsa? It's a nightclub and their phone number is 07782218745.
PMUL1416.json	14	Ok, sounds like a blast, thank you!
PMUL1416.json	15	Anything else you need today?
PMUL1416.json	16	No. That was all. Thanks. Bye.
PMUL1416.json	17	thanks for using our services and have a good day
WOZ20112.json	0	Do you have any restaurants that serve caribbean food?
WOZ20112.json	1	There are no Caribbean restaurants. Would you like something else?
WOZ20112.json	2	What about a restaurant that serves Chinese food? What is their phone number?
WOZ20112.json	3	There are many Chinese restaurants to choose from. Do you have a preferred area of town?
WOZ20112.json	4	no, it doesn't matter
WOZ20112.json	5	Let me provide you with a couple options, Charlie Chan- phone 01223 361763 or Golden House - phone 01842 753771
WOZ20112.json	6	Thank you, goodbye
WOZ20112.json	7	Thank you for calling. Goodbye.
MUL2066.json	0	Hi, I'm looking for a guesthouse that's in the expensive range.
MUL2066.json	1	I am sorry but there are no guesthouses in the expensive price range. Do you want me to check hotels or a different price range for a guesthouse?
MUL2066.json	2	I need the place I'd like to stay to also include wifi, is there anything?
MUL2066.json	3	A and B guest house looks like it is in the moderate price range with internet, would that work for you?
MUL2066.json	4	I'd prefer a cheap guesthouse instead (that still offers WiFi).
MUL2066.json	5	Allenbell looks like a good fit. Would you like me to make a reservation?
MUL2066.json	6	Yes, please. I would like to book a room starting Wednesday for 5 people, 2 nights.
MUL2066.json	7	I have booked you into the Allenbell on Wednesday for 2 nights with accommodations for 5 people. Your reference number is AJSQZY8R .
MUL2066.json	8	I also am looking for a train.
MUL2066.json	9	Ok, would you please give me some information? What day and time are you traveling? Where are you going?
MUL2066.json	10	I will be travelling from Ely to Cambridge on Wednesday and need to leave after.
MUL2066.json	11	There are 10 trains that day starting at 05:35 and then every 2 hours. What time do you want to leave and how many tickets would you like to book?
MUL2066.json	12	I'd like to leave after 16:30, please.
MUL2066.json	13	TR8610 leaves at 17:35. Can I help you book? If so, how many tickets do you need?
MUL2066.json	14	Thank you, I will not need the booking quite yet but I would like to have the price of the train as well please.
MUL2066.json	15	Not a problem, the train tickets cost 4.40 pounds each. Can I assist you with anything else,
MUL2066.json	16	And what time does the train arrive?
MUL2066.json	17	It arrives by 17:52. Would you like me to book it?
MUL2066.json	18	No thank you. That's all I need. Thank you and goodbye!
MUL2066.json	19	You're welcome. Have a nice day.
MUL1591.json	0	I'm looking for a train that leaves from Cambridge after 14:45.
MUL1591.json	1	We have quite a few options available. Is there a particular day you are needing this?
MUL1591.json	2	I am looking to travel friday and head to bishops stortford.
MUL1591.json	3	Train TR2730 departs at 15:29 and arrives by 16:07. Would you like more information or to book a spot?
MUL1591.json	4	No, that's all the information I need. Thanks, have a great day!
MUL1591.json	5	Thank you goodbye.
MUL1591.json	6	I'm also looking for a place for dinner. Can you help with that?
MUL1591.json	7	Of course, there are over 100 restaurants in the city. Would you like to eat in the same area as your hotel?
MUL1591.json	8	I would like an expensive Italian placem are is not an issue.
MUL1591.json	9	There are 5 restaurants in the area. I like Frankie and Bennys in the south. Can I make you a reservation?
MUL1591.json	10	Yes, 3 people at 10:15 on friday.
MUL1591.json	11	Success! Your table for 3 has been reserved at Frankie and Bennys on Friday at 10:15. They'll hold the table 15 minutes, and your reference is 90XE260X . Need anything further today?
MUL1591.json	12	No that's all I need. Thank you.
MUL1591.json	13	You're welcome. Don't hesitate to ask if you ever need anything else.
MUL1535.json	0	I am looking for a moderately priced restaurant in the centre.
MUL1535.json	1	There are 21 options for moderately priced food in the centre. What type of food are you looking for?
MUL1535.json	2	I'm hoping to have some european food.
MUL1535.json	3	There are 4 restaurants that meet your specifications: Hotel Du Vin and Bistro, Galleria, De Luca Cucina and Bar, and Riverside Brasserie. Do any of these meet your liking?
MUL1535.json	4	The first one sounds nice. I'd like to make a reservation for 2 people at 13:30 on Thursday.
MUL1535.json	5	Great. I'll make the reservation for you at the hotel du vin and bistro. Is there anything else I can do for you?
MUL1535.json	6	Could I have the reference number please?
MUL1535.json	7	Your reference number is 2AIO16E6, is there anything else you need?
MUL1535.json	8	I am also looking for a train that goes to Stevenage.
MUL1535.json	9	What other information can you give me about this train ride?
MUL1535.json	10	I'd like to leave on Friday and get there by 15:30
MUL1535.json	11	There are 5 trains leaving Cambridge with that arrival time. What time would you like to leave?
MUL1535.json	12	The latest departure time would work best. thank you.
MUL1535.json	13	Ok great, can you please confirm your departure location?
MUL1535.json	14	I'll be departing from Cambridge. What will the ticket cost me?
MUL1535.json	15	Your train trip would cost you 12.80 pounds. Would you like me to book it?
MUL1535.json	16	No thanks. That won't be necessary. Have a great day. Thanks. Bye.
MUL1535.json	17	You're welcome. You have a great day as well. Bye!
WOZ20564.json	0	I would like a cheap restaurant that serves mediterranean food
WOZ20564.json	1	The Gardenia is a cheap restaurant that serves Mediterranean food. Is the centre part of town okay for you?
WOZ20564.json	2	Yes, thank you. Could you tell me the address and phone number of that restaurant?
WOZ20564.json	3	Certainly, The Gardenia is located at 2 Rose Crescent City Centre and can be reached at 01223 356354. May I be of further assistance?
WOZ20564.json	4	The Gardenia sounds good. Thanks.
WOZ20564.json	5	Good bye.
PMUL4393.json	0	Are there any guesthouses in the east?
PMUL4393.json	1	There are six guesthouses in the east. Do you have a preference on price?
PMUL4393.json	2	It needs to be cheap.
PMUL4393.json	3	I have 3 options for you. All of them are 4 star rated and all offer free parking and free internet. Might I suggest the Leverton House.
PMUL4393.json	4	Can I have the address for Leverton House?
PMUL4393.json	5	that address is 732-734 newmarket road. would you like me to make you a reservation?
PMUL4393.json	6	Do they have internet and free parking?
PMUL4393.json	7	Yes they have internet and free parking.
PMUL4393.json	8	That will work can you book that for me?
PMUL4393.json	9	Sure, what day will you be arriving?
SNG1322.json	0	I there! I hope you're having a nice day. Hi, I need ride or taxi from Lovell lodge to Holy Trinity Church around 10:30. What are my options?
SNG1322.json	1	I have booked you a blue toyota. The contact number is 07061402543
SNG1322.json	2	Thank you! That will be all.
SNG1322.json	3	I'm so happy I could be of help. Have a great day!
SNG0158.json	0	Hello I am injured and am looking for a nearby hospital please.
SNG0158.json	1	There is the Addenbrooks Hospital, their phone number is 01223245151, did you want the direct line to the emergency department?
SNG0158.json	2	Can you also send the postcode and address please?
SNG0158.json	3	The address is Hills Rd. Cambridge, the post code is CB20QQ. Is there anything else?
SNG0158.json	4	I think I can take it from here, but I will call you if I need anything else.Thanks,
SNG0158.json	5	no problem have a great day
SNG0158.json	6	You do the same!
SNG0158.json	7	Thank you! I hope you feel better soon!
SNG0484.json	0	I am looking for a place serving christmas food in the centre of town.
SNG0484.json	1	It doesn't look like there are any restaurants of that type. Would you like to try a different cuisine?
SNG0484.json	2	Do you have any Indian restaurants?
SNG0484.json	3	Yes, we have nine Indian restaurants in the center of town. Do you have a preference in price range?
SNG0484.json	4	I actually would prefer gastropub type food and preferably in the moderate price range.
SNG0484.json	5	The Cow Pizza Kitchen and Bar would be perfect for you! Would you like for me to book you a table?
SNG0484.json	6	Are there any other options for gastropub?
SNG0484.json	7	The Cow Pizza Kitchen and Bar is the only gastropub in all of Cambridge.
SNG0484.json	8	In that case, could you give me the address and phone number?
SNG0484.json	9	I sure can. The address is Corn Exchange Street, and the phone number is 01223308871. Can I help you with anything else today?
SNG0484.json	10	No, that's all. Thank you.
SNG0484.json	11	Thank you for calling us today. Goodbye.
SNG01537.json	0	I am looking for a place to stay. The hotel should have a star of 0 and should be in the type of hotel
SNG01537.json	1	I found the cityroomz hotel in the centre part of town. Would you like to book a room?
SNG01537.json	2	The hotel should include free wifi and doesn't need to have free parking.
SNG01537.json	3	Cityroomz has free wifi and does not offer free parking. Do you want me to book it for you?
SNG01537.json	4	yes.book for six people and six nights. remember to also give me the reference number
SNG01537.json	5	What day would you like the reservation to start?
SNG01537.json	6	it needs to start on wednesday, please.
SNG01537.json	7	Sorry, I was unable to complete the booking. Would you like to try booking for a shorter stay or for another day?
SNG01537.json	8	How about for 5 nights?
SNG01537.json	9	your booking was successful. is there anything else i can help you with?
SNG01537.json	10	Actually I need the reservation to be for 4 nights, 6 people, starting from wednesday. Could you change the reservation for me please?
SNG01537.json	11	No problem, I was able to book that for you and your reference number is VA5JADCK . Is there anything else I can do for you?
SNG01537.json	12	I think that is everything, thanks!
SNG01537.json	13	You're welcome. Have a pleasant stay. Goodbye.
PMUL4406.json	0	i'm looking for a particular hotel
PMUL4406.json	1	I'll be happy to find information on the hotel. What hotel would you like me to look up for you?
PMUL4406.json	2	Finches Bed and Breakfast. I would like to book it for 1 person and 4 nights, start date on Wednesday. Can you also provide me with reference number?
PMUL4406.json	3	I have made your reservation. Your reference number is 97RYHJTP .
PMUL4406.json	4	im also looking for a place to go in the south
PMUL4406.json	5	there are many things to do. What would you like ?
PMUL4406.json	6	it should be a theatre. get me the entrance number
PMUL4406.json	7	the junction fits your description. can i give you their address?
PMUL4406.json	8	Actually I'll be taking a taxi between the two. But before I do that, is there an entrance fee?
PMUL4406.json	9	The Junction does not have their entrance fee available. Would you like their phone number to call them?
PMUL4406.json	10	No thank you. I would like a taxi, leaving The Junction by 17:30.
PMUL4406.json	11	All set, look for a yellow bmw, if there are issues, they can be reached at 07689463937, any other questions?
PMUL4406.json	12	No, you have taken care of everything. Thanks you so much. Good-bye.
PMUL4406.json	13	Your Welcome good bye
MUL2694.json	0	Hello, I am looking for a hotel in the south that is moderately priced.
MUL2694.json	1	I can't find any hotels, but I did find a guesthouse called aylesbray lodge guest house with that criteria.
MUL2694.json	2	I'd prefer a hotel. It should have a 4 star rating. Can you check again, please?
MUL2694.json	3	Unfortunately all we have is the aylesbray lodge guest house
MUL2694.json	4	Okay, do you have any hotels with a 3 star rating instead?
MUL2694.json	5	There's one with 3 stars - Bridge Guest House. It's in the south and is moderately priced, and they have free wifi and parking. Would you like to book a room?
MUL2694.json	6	I guess that's fine, book it for 6 people for 2 nights, We'll be there on thursday.
MUL2694.json	7	I was able to book your party of 6 into Bridge Guest House for 2 nights starting Thursday! Reference: GAAQJAQQ . Can I help more today?
MUL2694.json	8	Yes, I'm also looking for info on Wandlebury Country Park.
MUL2694.json	9	Wandlebury Country Park is located at wandlebury ring, gog magog hills, babraham. Is there any other information you need today?
MUL2694.json	10	Can you give me their phone number please?
MUL2694.json	11	The phone number for Wandlebury Country Park is 01223243830. Do you any further assistance today?
MUL2694.json	12	thanks. i want to leave the hotel by 24:45.
MUL2694.json	13	Do you mean that you want to book a taxi? If so, what will your destination be?
MUL2694.json	14	Yes I do. I want to leave the hotel by 24:45 to go to the park.
MUL2694.json	15	Your taxi will be available and has been booked.
MUL2694.json	16	Wonderful. Can you provide me with the contact number? Also, what kind of car is it?
MUL2694.json	17	Of course, sorry about that. Look for a red Lexus. The contact number is 07951076280. Can I be of further assistance today?
MUL2694.json	18	Nope, that's it. Thanks!
MUL2694.json	19	Very please to have been of assistance today.
MUL2030.json	0	I'd like to find a train going to Cambridge that leaves on Sunday.
MUL2030.json	1	Ok, and where are you departing from?
MUL2030.json	2	I would be leaving from Peterborough. I need to arrive in Cambridge by 19:30 though.
MUL2030.json	3	Okay, there are a few trains available. What time would you like to depart?
MUL2030.json	4	My departure time is flexible.
MUL2030.json	5	The earliest train is TR3782 which leaves at 05:19, would you like me to book some tickets for you?
MUL2030.json	6	No, that won't be necessary. I would like to get the price, though.
MUL2030.json	7	Of course. The price for the train running from peterborough to cambridge on Sunday is 13.20 pounds. Is there anything else I can assist you with?
MUL2030.json	8	I am also looking for a hotel called alpha-milton guest house.
MUL2030.json	9	Okay. It's a 3-star guesthouse in the north area with no internet or parking. Is there more you would like to hear?
MUL2030.json	10	That sounds great. Can I just get the postcode please?
MUL2030.json	11	The post code of the alpha-milton guest house is cb41xa. Is there anything else I can assist you with today?
MUL2030.json	12	No, I believe that is everything. Thank you.
MUL2030.json	13	Not a problem, please contact us again if you need any further assistance.
SNG0523.json	0	I am looking for some info on India House
SNG0523.json	1	India House is a restaurant located at 31 Newnham Road Newnham on the west side of town. Is this the place you are referring to?
SNG0523.json	2	That sounds right. Could you reserve a table for 6 at 18:00 on Friday?
SNG0523.json	3	I apologize but the booking was unsuccessful. Can we try another day or time?
SNG0523.json	4	Can you try for 17:00 instead?
SNG0523.json	5	Booking was successful for that time! Your table will be reserved for 15 minutes. Here is your reference number: 6BCI3XF8 .
SNG0523.json	6	Great! Thanks for your help, that's all I need.
SNG0523.json	7	Great! Have a wonderful day!
MUL1335.json	0	I need a 3 star hotel in Cambridge, that offers a guesthouse, can you book it for me ?
MUL1335.json	1	Yes, hamilton lodge is located on 156 chesterton road.
MUL1335.json	2	If this guesthouse is available please book it for me. By the way, what is the price per night?
MUL1335.json	3	I do not have the prices, what day would you like to stay, for how many nights, and how many people?
MUL1335.json	4	Before I book, is the guesthouse located in the south part of town and at what price range?
MUL1335.json	5	The hotel is found in the Northern part of town and it is in the moderate price range
MUL1335.json	6	Great can you book that for 1 person for 3 nights starting friday?
MUL1335.json	7	i have your room all reserved. The reference number is R1E3QVGT . Is there anything else I can assist you with?
MUL1335.json	8	Yes, I am also looking for a barbeque restaurant in the same area and price range as my hotel.
MUL1335.json	9	Unfortunately, I could not find a barbecue restaurant using your criteria. Is there another type of restaurant you would like to consider?
MUL1335.json	10	Yes, are there any modern european restaurants in that area?
MUL1335.json	11	There are no modern European restaurants in the North but there are 2 in the town center. Do you want to book one or change type of restaurant.
MUL1335.json	12	I'd like to book one for the same group of people at 11:00 on the same day as before.
MUL1335.json	13	Neither of the restaurants in the centre are available at that time. Would you like to try a different time?
MUL1335.json	14	How about 10:00 on the same day as before?
MUL1335.json	15	I was able to book restaurant alimentum reference number is HCY10A2Z
MUL1335.json	16	thank you for booking that and the reference number
MUL1335.json	17	Is there anything else I can help you with today?
MUL1335.json	18	Yes please, I need to book a taxi to the restaurant from the hotel for the dinner reservation.
MUL1335.json	19	Ok, a grey honda will pick you up at the hamilton lodge in time to arrive at restaurant alimentum for your 10:00 reservations. Taxi contact number is 07242149665. Anything else?
MUL1335.json	20	That is it for today. Thank you so much for your help. Good bye.
MUL1335.json	21	Thank you for using Cambridge TownInfo centre. Please remember us for all of your future travel needs.
MUL1312.json	0	Hello, I am traveling to Cambridge and I'm looking for some local restaurants. I would like to find some located in the Centre and of moderate price.
MUL1312.json	1	We have a lot of locations to chose from. What type of food would you like?
MUL1312.json	2	Are there any restaurants that serve bistro food?
MUL1312.json	3	There are no bistro style places that meet your criteria, would you like another style of food perhaps?
MUL1312.json	4	how about italian?
MUL1312.json	5	Sure, there are two such restaurants. How about Pizza Express, at Regent Street City Centre? Would you like to book a table?
MUL1312.json	6	Yea! Please book a table for 2 people at 15:00 on Thursday.
MUL1312.json	7	That time is not available, would you like to book another day or time slot?
MUL1312.json	8	Can you try 14:00?
MUL1312.json	9	Yes I was able to make you a reservation at the pizza express on thursday at 14:00 for 2 people. Your reference number is UN9ONONE .
MUL1312.json	10	I am also looking for a hotel in the same area of the restaurant
MUL1312.json	11	I have several options. Do you prefer a certain price range so that we can narrow down the options?
MUL1312.json	12	I don't really care about price range, but I'd like to have free parking.
MUL1312.json	13	The Gonville Hotel is in the expensive range but is located in the Centre.
MUL1312.json	14	Does it have free parking?
MUL1312.json	15	Yes it does! Shall I book that hotel for you?
MUL1312.json	16	Please. Book it for 2 people on thursday, for 3 days. I'll need the reference number for that as well.
MUL1312.json	17	Your Booking was successful.Your Reference number is : K9JGOOGY .
MUL1312.json	18	Can I also book a taxi to get from the restaurant to the hotel? We want to make our dinner reservation.
MUL1312.json	19	I have you booked leaving at 13:45 and arriving at 14:00. Your car is a black audi.
MUL1312.json	20	That sounds great. Can you provide the contact number for the taxi?
MUL1312.json	21	Certainly, the number is 07937202537. Is there anything else I can help you with?
MUL1312.json	22	That's all. Thanks.
MUL1312.json	23	Thank you as well and have a wonderful day!
MUL1906.json	0	I'm looking for a train that arrives by 15:15 on saturday.
MUL1906.json	1	Where would you like to depart from and where do you want to arrive at?
MUL1906.json	2	I need it to depart from Broxbourne and arrive in Cambridge.
MUL1906.json	3	The TR7846 leaves at 09:32 and arrives at 10:32. Would that work?
MUL1906.json	4	Can I get one closer to my arrival time?
MUL1906.json	5	Train TR0279 arrives at 14:32 which is the closest one.
MUL1906.json	6	That's perfect. Please book it for 4 tickets.
MUL1906.json	7	I was able to book you, your reference number is CEP20AFO ., total cost 57.28 payable at the station.. Any other questions?
MUL1906.json	8	Yes please. I've heard that Emmanuel College is an interesting place. What can you tell me about it?
MUL1906.json	9	It is a college in the centre of town located at saint andrew's street, poscode cb23ap and their phone number is 01223334200.
MUL1906.json	10	Great! I appreciate all the info. Goodbye!
MUL1906.json	11	Good night, enjoy the rest of your evening.
PMUL4169.json	0	Hi, I'm interested in getting some information about the cherry hinton village centre in Cambridge.
PMUL4169.json	1	It is a multiple sports venue on the east side of town. The phone number is 01223576412.
PMUL4169.json	2	What is their entrance fee?
PMUL4169.json	3	I'm afraid that the entrance fee is unknown. Would you like the phone number?
PMUL4169.json	4	No, thanks. Could you recommend a hotel in the west with free parking?
PMUL4169.json	5	The cambridge belfry is a cheap hotel, 4 star, and offers free parking and WiFi. Would you like me to book you a stay?
PMUL4169.json	6	Is it a guesthouse? I'm looking for a guesthouse.
PMUL4169.json	7	No, but the finches bed and breakfast is. Can I book you a room there?
PMUL4169.json	8	I actually don't need reservations just information. What can you tell me about the Finches Bed and Breakfast?
PMUL4169.json	9	finches bed and breakfast is a 4 start guesthouse in the west part of town in the cheap price range with free internet and parking.
PMUL4169.json	10	What's their postcode?
PMUL4169.json	11	their postcode is cb30nd
PMUL4169.json	12	OK. Would it be possible to get a taxi from the guesthouse to the sports complex?
PMUL4169.json	13	Yes, I can do that. I just need to know when you want to leave or arrive by, please/
PMUL4169.json	14	I want to leave the hotel at 22:45.
PMUL4169.json	15	A taxi has been booked. It is a grey Tesla and the phone number is 07972543757.
PMUL4169.json	16	Thank you so much! You've been so helpful. That's all I need. Have a good day. Goodbye.
PMUL4169.json	17	Your welcome, have a great day too!
MUL1666.json	0	I need help finding train to Lodon Liverpool Street.
MUL1666.json	1	Thank you, I see there are several to choose from.
MUL1666.json	2	I need it to arrive by 19:45 on Sunday and I'm leaving from Cambridge.
MUL1666.json	3	Train TR1163 leaves at 05:59, is that okay?
MUL1666.json	4	Yes, I'd like to book it for 3 people. Could I get the reference number as well?
MUL1666.json	5	Booking was successful, the total fee is 39.83 GBP payable at the station. Your reference number is 121NE14K . Can I help with anything else today?
MUL1666.json	6	Can you find me an expensive restaurant in the centre, please?
MUL1666.json	7	There are 33 results. Can we narrow down by type of food?
MUL1666.json	8	I would like a restaurant that serves venetian food, please.
MUL1666.json	9	There are no expensive venetian restaurants in the city centre. Is there another food type you want?
MUL1666.json	10	Sure, how about some British food?
MUL1666.json	11	There are 3: Fitzbillies Restaurant, the Cambridge Chop House, and Midsummer House Restaurant. Do any of these sound good to you?
MUL1666.json	12	Are all three of these expensive restaurants? If so I'd like to try the Midsummer House Restaurant. May I get their address please?
MUL1666.json	13	Yes Midsummer House Restaurant is expensive, it's located at Midsummer Common. Would you like me to help you make a booking?
MUL1666.json	14	That was all the information I needed, thank you!
MUL1666.json	15	Thank you for using our system!
MUL0522.json	0	Can you tell me anything about cafe jello gallery?
MUL0522.json	1	Yes, the Cafe Jello Gallery is a museum located at 13 magdalene street in the west side of town. Would you also like their phone number?
MUL0522.json	2	Yes I would.
MUL0522.json	3	The phone number is 01223312112. Do you need the postcode?
MUL0522.json	4	No, but I am looking for a train from Ely on Thursday.
MUL0522.json	5	There are 10 trains that day. Is there a particular time you'd like to leave or arrive?
MUL0522.json	6	i would like to arrive after 2:00 in the afternoon.
MUL0522.json	7	We have the TR0813 that arrives at 11:52 on thursday. Does that work?
MUL0522.json	8	I think that could work please make a booking for 6 people
MUL0522.json	9	Booking was successful! Your reference number is GXIE5O8F . You have to pay 26.4 GBP at the station.
MUL0522.json	10	Thank you very much that is all I needed. Have a good day.
MUL0522.json	11	You're welcome, and you have a nice day as well!
MUL1553.json	0	Could you give me some information on getting a train to Cambridge on Thursday?
MUL1553.json	1	I sure can! We have several trains that meet that criteria, do you have a specific departure point in mind?
MUL1553.json	2	Yes, I want to leave London Liverpool Street sometime after 10:15.
MUL1553.json	3	I can get you on an 11:39 departure. Will that work for you?
MUL1553.json	4	Yes, can you book that for 2 people and give me a reference number?
MUL1553.json	5	Your train has been booked, reference number is EC3AFT68 .
MUL1553.json	6	I am also looking for a expensive restaurant located in the centre.
MUL1553.json	7	i'd like to suggest to you bedouin
MUL1553.json	8	Sounds great, can you reserve us a table? Same 2 people and on the same day. We'd like to eat at 17:00.
MUL1553.json	9	Reservations for the same day have been booked for the bedouin. The reference number is U5H97VUV .
SNG0944.json	0	I am looking for a place to stay that is a guesthouse with free parking please.
SNG0944.json	1	I have lots of guesthouses available with parking, do you have a preference for area?
SNG0944.json	2	No, but I do need free wifi as well as free parking.
SNG0944.json	3	Do you have a preference for price range?
SNG0944.json	4	No, the price range is flexible. I would like to book a room on Wednesday for 2 people, 2 nights.
SNG0944.json	5	Can I book you in at the allenbell? It is cheap and in the east.
SNG0944.json	6	That will do. And that is for 2 people for 2 nights starting Wednesday.
SNG0944.json	7	Sorry, there isn't any vacancy for those days. Would you care to stay just the Wednesday?
SNG0944.json	8	Sure, let's try for just one night and see if that works please.
SNG0944.json	9	Booking was successful. Can I get you anything else?
SNG0944.json	10	The reference number please!
SNG0944.json	11	Your reference number is LPMF11YC .
SNG0944.json	12	Thanks for your help. I'm all set. Bye.
SNG0944.json	13	Have a good day!
PMUL4411.json	0	Find me a train out of stevenage for Wednesday
PMUL4411.json	1	Is there a time you'd like to leave or arrive by?
PMUL4411.json	2	Yes, I'd like to arrive in Cambridge by 8:30.
PMUL4411.json	3	TR9448 is available, would you like to book that one?
PMUL4411.json	4	Please. I'll need 7 tickets.
PMUL4411.json	5	Booking was successful, the total fee is 89.6 GBP payable at the station. Reference number is : E05ZQIF7 . Is there anything else I can do for you?
PMUL4411.json	6	I'm also looking for a cool college to visit in cambridge. Do you have any recommendations?
PMUL4411.json	7	corpus christi is very popular. It is located in the town centre. The number is 01223338000. Can I help with anything else?
PMUL4411.json	8	That's all I needed to know, thanks for your help!
PMUL4411.json	9	Thank you for using our service today.
PMUL4411.json	10	No problem.
PMUL4411.json	11	Thank you for using the Cambridge Town Info Centre Services!
SNG0620.json	0	I am looking for a place to eat in the moderate price range serving Indian food.
SNG0620.json	1	There are 4 places serving indian food in the moderate price range. Do you have a preferred area to dine at?
SNG0620.json	2	The west.
SNG0620.json	3	I have narrowed it down to Meghna which serves Indian Food. Would you like me to book this for you?
SNG0620.json	4	Yes. could you please make a reservation for Saturday for 7 people at 15:00?
SNG0620.json	5	Sorry, that time slot doesn't work for what you would like. Would you like to change the day or time?
SNG0620.json	6	How about 14:00 then?
SNG0620.json	7	Booking was successful. The table will be reserved for 15 minutes. Reference number is : NR6VPA82 .
SNG0620.json	8	Excellent, that's all I need. Thank you!
SNG0620.json	9	Thank you so much have a great day!
SNG0620.json	10	Could you repeat the reference number please.
SNG0620.json	11	Reference number is : NR6VPA82 .
SNG0620.json	12	Thanks again for all your help.
SNG0620.json	13	You are very welcome. Feel free to call again in the future. Have a great morning.
PMUL3076.json	0	I am looking for a place to eat in the north. Can you help me?
PMUL3076.json	1	sure, there are nine to choose from
PMUL3076.json	2	Do you have anything serving Turkish food?
PMUL3076.json	3	There are no Turkish restaurants in the North area.
PMUL3076.json	4	Okay, how about one that serves Chinese food?
PMUL3076.json	5	Yes, the golden wok is in that area. Would you like to book a seat there?
PMUL3076.json	6	Yes, a reservation would be great. Let's say Friday for 6 people at 15:45.
PMUL3076.json	7	Booking was successful. The reference number is : Q79BLCSB .
PMUL3076.json	8	Thank you! I'm also looking for a train leaving Cambridge. I'll need to arrive by 08:15, please?
PMUL3076.json	9	how about TR5767? it arrives at 05:51
PMUL3076.json	10	Well, I need to go to bishops stortford. Will that train go there on Sunday?
PMUL3076.json	11	You want TR8095 - it will arrive in Bishops Stortford at 08:07 on Sunday.
PMUL3076.json	12	Yes I would like to book seats on the TR8095 train for 6 people.
PMUL3076.json	13	I will work on getting that booked and be back with you shortly.
PMUL3076.json	14	Thank you for your help.
PMUL3076.json	15	Booking was successful, the total fee is 48.48 GBP payable at the station. Reference number is : 1NR94D63 . Is there anything else I can help with?
PMUL3076.json	16	nope that is all, thanks so much for all of your help!
PMUL3076.json	17	You're welcome have a great day
MUL0568.json	0	I would like to book a train leaving on Monday going to London Liverpool street, can you help me with that please?
MUL0568.json	1	I found ten, trains, what time would you like to leave or arrive by?
MUL0568.json	2	The train should depart from cambridge and should arrive by 18:30.
MUL0568.json	3	There are 7 trains meeting those criteria. They call cost the same amount. When would you like to leave by?
MUL0568.json	4	Any train just arriving by 18:30, can I just get the train ID and price of one of those?
MUL0568.json	5	I have one that leaves at 11:59 and arrives at London Liverpool Street at 13:27. Train ID TR7276 and it is 16.60 pounds
MUL0568.json	6	Thanks. I'd also like someplace to go in the west. Maybe some sort of attraction.
MUL0568.json	7	There are 13 different attractions in that area, mostly colleges and museums, do either of those options interest you?
MUL0568.json	8	Anything in the west that seems interesting, I just need the postcode and entrance fee.
MUL0568.json	9	I believe you might enjoy Queens' college. It is very rich with history. It is 2.50 pounds to get in and it's postcode is cb39et.
MUL0568.json	10	Thank you so much!
MUL0568.json	11	You are very welcome! Have a pleasant day!
PMUL4785.json	0	i need a guest house which has free parking
PMUL4785.json	1	What part of town do you want to stay in?
PMUL4785.json	2	No specific area. I would like it to have free wifi and 4 stars.
PMUL4785.json	3	I have 16 entries that are a match. What area would you like the hotel in?
PMUL4785.json	4	I am not particular as long as it has a 2 star rating, free wifi and is a guesthouse.
PMUL4785.json	5	I'm sorry, can you just clarify whether you prefer 2 or 4 stars?
PMUL4785.json	6	Sure, I need a 4 star guesthouse with wifi and parking. The area doesn't matter.
PMUL4785.json	7	how about the archway, its moderately prices and has free wifi and parking?
PMUL4785.json	8	That sounds good. I'd like to book a room for 2 people starting on Saturday and lasting 5 nights.
PMUL4785.json	9	Alright, you're all booked. Your reference number is JAKFVTLQ . Can I help with anything else today?
PMUL4785.json	10	I'm looking for info on soul tree nightclub.
PMUL4785.json	11	It's located in the centre. Here's the phone number 01223477900. The address is 1-6 corn exchange street
PMUL4785.json	12	Can you tell me what type of attraction this is and the entrance fee?
PMUL4785.json	13	Sure. Soul Tree Nightclub is a nightclub attraction. The entrance fee is 4 pounds.
PMUL4785.json	14	Thank you so much for your help. That was all I needed.
PMUL4785.json	15	You're welcome! Have a great day!
PMUL0094.json	0	Hello, I'm looking for a modern European restaurant. Got any?
PMUL0094.json	1	You might like City Harvest. It's a very popular modern European restaurant.
PMUL0094.json	2	Can you book it for me for 3 people at 14:00 on Wednesday?
PMUL0094.json	3	I'm sorry, that restaurant seems to have closed. I can reserve a table at The River Bar Steakhouse and Grill if you'd like.
PMUL0094.json	4	Yes, that is fine. I also need a place to stay that has free parking and at least a three star rating, can you find one for me?
PMUL0094.json	5	yes, i have 5 that meet that criteria.
PMUL0094.json	6	i need one to be the same price range as the restaurant.
PMUL0094.json	7	I found no hotels that are in the cheap price range like the restaurant. Is there another price range or star rating you would consider?
PMUL0094.json	8	Actually it should be in the moderate price range.
PMUL0094.json	9	Would you like to try Hamilton lodge?
PMUL0094.json	10	Yes. I will need it for three nights, 3 people starting Wednesday.
PMUL0094.json	11	your booking was successful. Confirmation # is AJANORT5, anything else today?
PMUL0094.json	12	No that was all I needed.
PMUL0094.json	13	If you need anything else contact our help desk anytime. Have a good day.
MUL2583.json	0	I'm looking for a hotel, but not a guesthouse. All it needs is free parking. Can you recommend one?
MUL2583.json	1	I am sorry are not hotels that match your criteria. Can I try to find a hotel in the south?
MUL2583.json	2	Yes, I'm trying to find a hotel in the south with a 4 star rating, with free parking.
MUL2583.json	3	Unfortunately there are no hotels that match those specifics, can you alter your location?
MUL2583.json	4	Ok, let's try the same other criteria but how about a guesthouse?
MUL2583.json	5	There are 2 guesthouses in the south that have 4 stars: Aylesbray Lodge Guest House (moderate prices), and Rosa's Bed and Breakfast (cheap). Would you like to book at one?
MUL2583.json	6	No but can I get the address and postcode for Rosa's Bed and Breakfast please?
MUL2583.json	7	The address is 53 roseford road and the post code is cb22ha.
MUL2583.json	8	Thanks. I'm also looking for a cinema in the same place at the hotel.
MUL2583.json	9	Cineworld Cinema is in that part of town.
MUL2583.json	10	Can you confirm if Cineworld Cinema is in the south? Also, can you look up a swimming pool? I'm thinking of going swimming.
MUL2583.json	11	Yes, Cineworld Cinema is in the south part of town unfortunately there are no swimming pools in the south. Can I check another area of town for you?
MUL2583.json	12	Can I get the fee and the phone number for Cineworld Cinema please?
MUL2583.json	13	The phone is 00872208000. Unfortunately my system does not show fees.
MUL2583.json	14	Okay. That's all I needed then.
MUL2583.json	15	Thank you for using our services.
SNG1264.json	0	I am looking for a restaurant that serves indian food.
SNG1264.json	1	In what area of town would you like to eat?
SNG1264.json	2	In the centre of town please. I am looking to stay in the expensive price range.
SNG1264.json	3	Great, there are 6 restaurants that meet your criteria. I would suggest Curry Garden. Can I book it for you?
SNG1264.json	4	Yes, could you please book it for 6 people at 14:30 on tuesday?
SNG1264.json	5	Your table is reserved, ref# UQONY6CJ . Is there anything else I can help you with today?
SNG1264.json	6	That would be all thank you very much.
SNG1264.json	7	Okay, you are welcome. Have a nice day!
PMUL2533.json	0	I am looking to stay at a four start place with free wifi.
PMUL2533.json	1	I am showing three results for four star hotels with internet. Would you rather be located in the center of town, or on the west side?
PMUL2533.json	2	Either will do. Are there by any chance any cheap guesthouses available?
PMUL2533.json	3	alexander bed and breakfast is located in the centre and finches bed and breakfast is located in the west. both are cheap guesthouses with internet.
PMUL2533.json	4	Please book Alexander Bed and Breakfast for 4 people and 5 nights starting on Tuesday.
PMUL2533.json	5	I've got it all booked for you. Your reference number is YIZ6WQ8T .
PMUL2533.json	6	I'm also looking for an architecture attraction to go to. Do you have information on any of those?
PMUL2533.json	7	yes there are a number of them. which side would you prefer?
PMUL2533.json	8	well since the hotel is in the center try nearby.
PMUL2533.json	9	There are 5 choices. I recommend old schools on trinity lane. It is free admission.
PMUL2533.json	10	Please send me their phone number and postcode.
PMUL2533.json	11	The phone number is 01223332320 and post code is cb21tt.
PMUL2533.json	12	Okay, that's all I need for today. Thanks, bye!
PMUL2533.json	13	Thank you, enjoy your stay!
MUL2159.json	0	I need a train to Cambridge, leaving after 17:00.
MUL2159.json	1	There are quite a few. What station will you be leaving from?
MUL2159.json	2	I'll be leaving from Norwich on Wednesday.
MUL2159.json	3	How about the TR2379 train? It leaves Norwich at 17:16 and arrives in Cambridge at 18:35.
MUL2159.json	4	Can you give me the price and travel time of TR2379, please?
MUL2159.json	5	TR2379 is 17.60 pounds per ticket, and the travel time is 79 minutes.
MUL2159.json	6	Great, please book that. I would also like to book a hotel, called Kirkwood house
MUL2159.json	7	Trains all booked for you and your reference number is ZLRL98VP . What nights would you need me to book at kirkwood house for you?
MUL2159.json	8	Can you book the hotel for 4 people starting Wednesday night for 4 nights?
MUL2159.json	9	Alright, I got your room at the Kirkwood booked. The reference number is: 90EPN6VX . Anything else I can do for you today?
MUL2159.json	10	No, that looks good to me. You have a great day.
MUL2159.json	11	Thank you for using our service, have a wonderful day. If you need any assistance, feel free to contact us again.
MUL1760.json	0	I'm looking for a train from cambridge to stevenage.
MUL1760.json	1	I can get you tickets for friday. The train departs the station at 05:21, is that time suitable for you?
MUL1760.json	2	How long is the trip? I might like to leave somewhat later.
MUL1760.json	3	The trip is 49 minutes.
MUL1760.json	4	Excellent. Book it for 6 people and I'd like to arrive before 12:45.
MUL1760.json	5	Okay, I've booked you 6 tickets on train TR2515, which leaves at 05:21 and arrives at 06:10 in Stevenage. Your reference number is 1RMGSH2B . Can I help you with anything else?
MUL1760.json	6	Thanks so much. And yes, could you possibly point me to some entertainment in the town centre?
MUL1760.json	7	Unfortunately there isn't anything in the town centre that's entertainment, do you have an alternate preference or area you'd like?
MUL1760.json	8	Are there any museums in the centre?
MUL1760.json	9	There are 11 museums in the centre. Would you like to visit the Castle Galleries or Primavera perhaps? Both are free.
MUL1760.json	10	Can I get the addresses of both?
MUL1760.json	11	Castle galleries is at unit su43, grande arcade, saint andrews street. Primavera is at 10 king s parade.
MUL1760.json	12	Fantastic. May I have the postcodes for those museums as well?
MUL1760.json	13	Castle Galleries is cb23bj and Primavera is cb21sj.
MUL1760.json	14	Thanks, that's all I need today. Goodbye!
MUL1760.json	15	Is there anything else I can help you with?
MUL1807.json	0	I need a train that departs from cambridge and should leave on thursday.
MUL1807.json	1	What is you destination?
MUL1807.json	2	I am heading to Peterborough and need it to leave after 13:00.
MUL1807.json	3	There is a train at 1:06 pm on thursday, it is a 50 minute ride. Should I book?
MUL1807.json	4	Yes please book 7 tickets.
MUL1807.json	5	Reference number is : G2KRNAR7 . AND PRICE IS 115.5 GBP
MUL1807.json	6	Thanks. What's interesting in the way of attractions in the centre of town?
MUL1807.json	7	All Saints Church on Jesus Lane is very interesting. Admission is free and it has the most impressive architecture I've seen. Does that interest you?
MUL1807.json	8	Definitely - can I have their phone number?
MUL1807.json	9	The phone number is 01223452587, is there anything else I can help you with today?
MUL1807.json	10	Thank you for your help, I think that will be everything today!
MUL1807.json	11	Okay. Glad I could help.
SNG1223.json	0	I need to book a train for 8:45 to go to london kings crossing.
SNG1223.json	1	What day are you planning to travel?
SNG1223.json	2	I would like to travel on Friday.
SNG1223.json	3	I'm sorry I dont' have any trains for that day. Would you like to leave at a different time?
SNG1223.json	4	I will be leaving from Cambridge on Friday.
SNG1223.json	5	The earliest train I have is at 09:00. Is that ok?
SNG1223.json	6	That's fine. Can you give me the arrival time, travel time, and train ID please?
SNG1223.json	7	TR2000 takes 51 minutes to arrive at by 9:51. Would you like me to reserve this for you?
SNG1223.json	8	Nope, that's all I needed. Thanks!
SNG1223.json	9	Thank you for using the Cambridge TownInfo Centre, and have a great day!
PMUL0005.json	0	I was looking for a specific restaurant, please.
PMUL0005.json	1	I can help you with that. Do you know the name of it?
PMUL0005.json	2	Yes, it;s called The Golden Curry.
PMUL0005.json	3	The Golden Curry is an expensive restaurant in the Centre of town, at Mill Road City Centre, CB12AZ. Their number is 01223329432. Would you like to book a reservation?
PMUL0005.json	4	Yes I need it booked for 8 people on Monday at 17:15.
PMUL0005.json	5	I will book that for you now.
PMUL0005.json	6	Thank you. If that one fails, Thursday would be good as well. Please provide the reference number. I also need a hotel, at least 1 star and include internet.
PMUL0005.json	7	What area would you like the hotel to be in?
PMUL0005.json	8	I do not mind the area. Just free wifi and I like to only have 1 star.
PMUL0005.json	9	i can't find any hotels that fit your criteria, i'm sorry.
PMUL0005.json	10	Can you find me a 4 star hotel then?
PMUL0005.json	11	There are many! Would you like a hotel, or a guesthouse?
PMUL0005.json	12	i prefer a hotel type.
PMUL0005.json	13	There are three available. Two are expensive and one is cheap. Do you have a preference?
PMUL0005.json	14	Are any of them in the Centre?
PMUL0005.json	15	the university arms is in the centre, when are you planning your stay?
PMUL0005.json	16	I would like to go to the hotel right after my reservation at the restaurant.
PMUL0005.json	17	Okay, and what time would you like the reservation for?
PMUL0005.json	18	The restaurant reservation is at 17:15
PMUL0005.json	19	What day would you like to dine and how many people will be with you?
PMUL0005.json	20	I have a restaurant reservation, I need a hotel now. 1 star hotel with free wifi.
PMUL0005.json	21	I am sorry. There restaurant reservation was not completed. You are now booked at the golden curry. The reference number is 6EF50SVX . Do you want a hotel booked, too?
PMUL0005.json	22	Yes 8 people, 4 nights on monday.
PMUL0005.json	23	How many days will you need the booking for?
PMUL0005.json	24	I will need it for 4 nights. Thanks.
PMUL0005.json	25	Would you like me to book it for you?
PMUL0005.json	26	Yes and please provide the reference number.
PMUL0005.json	27	You're all set. Your Reference number is : OI8ROWNH .
PMUL0005.json	28	That's all I need today. Thank you so much for all your help.
PMUL0005.json	29	My pleasure. Do you need to arrange any transportation today?
PMUL0005.json	30	No thank you that will be all
PMUL0005.json	31	Would you like me to book it for you ?
MUL1737.json	0	I need to take a train on Tuesday. I want to visit somewhere I haven't been before.
MUL1737.json	1	That sounds like fun! Will you be departing from Cambridge or somewhere else?
MUL1737.json	2	I need to depart cambridge and head to the stansted airport and arrive by 12:15
MUL1737.json	3	There are several options for you, leaving hourly. The TR7293 leaves at 11:40 and arrives at 12:08. Would you like me to book that for you, or perhaps an earlier one?
MUL1737.json	4	That sounds great. Can you book 4 seats for me?
MUL1737.json	5	Sure. I have done so and your confirmation number is VOONS2E2 .
MUL1737.json	6	I am also interested in places to go in town centre. Can you offer me some ideas?
MUL1737.json	7	There are numerous options available. Were you looking for free attractions? There are some great free museums.
MUL1737.json	8	Sure, a museum sounds good, which one would you recommend?
MUL1737.json	9	I just love the Museum of Archaeology and Anthropology. They're in the city centre and have no entrance fee.
MUL1737.json	10	That sounds perfect. I will check it out, thanks.
MUL1737.json	11	You're very welcome! Is there anything else I can help you with today?
MUL1737.json	12	That is all, goodbye.
MUL1737.json	13	Goodbye. Enjoy your trip.
SSNG0349.json	0	Hi, I'm looking for a place that offers free internet and parking.
SSNG0349.json	1	We have quite a few like that. I could recommend Home From Home, a moderately priced guesthouse in the north. Or are there other factors that matter?
SSNG0349.json	2	Just free wifi and free parking. Moderate priced and should be a guesthouse please.
SSNG0349.json	3	If you tell me when you will be staying, how many people and for how many days, I can book you at he home from home?
SSNG0349.json	4	There will be 5 of us staying for 2 nights. We would like to start on Sunday.
SSNG0349.json	5	I'm sorry, there were no rooms available. Perhaps you'd like to find another hotel?
SSNG0349.json	6	How about a different hotel in the same price range?
SSNG0349.json	7	I was able to book you into Kirkwood house. Your reference number is ANO69RVP . Is there anything else I can help you with?
SSNG0349.json	8	Oh, wait, I think I made a mistake, we're actually arriving on Friday, not Sunday.
SSNG0349.json	9	I was able to book a guest house called Acom guest house. It is moderately priced and has internet and parking. Reference number is 0RA8Y7GS . Would that work for you?
SSNG0349.json	10	Yes that's great. Thanks so much!
SSNG0349.json	11	You're welcome! Have a great day!
SSNG0349.json	12	Thanks again for your help
SSNG0349.json	13	You're welcome! Have a great day!
PMUL2561.json	0	A friend of mine mentioned this attraction called The Place. Can you give me some information about it?
PMUL2561.json	1	Yes, it is a nightclub in the south. Would you like the phone number?
PMUL2561.json	2	Yes. Phone number and address
PMUL2561.json	3	The Place is located at 22 Sidney Street, postcode cb23hg, and their phone number is 01223324600. Can I help you with anything else today?
PMUL2561.json	4	I am also looking for a place to stay in the east in the expensive price range.
PMUL2561.json	5	I have one listing for express by holiday inn cambridge, is that okay for you?
PMUL2561.json	6	That works fine.
PMUL2561.json	7	Alright. They're at 01223866800 at the property is on 15-17 norman way, coldhams business park. Would you like a reservation?
PMUL2561.json	8	What's the star rating? I want to stay at a 4 star place.
PMUL2561.json	9	The Express by Holiday Inn Cambridge is only 2 stars. Unfortunately, there are no 4 star places to stay in the east in the expensive price range.
PMUL2561.json	10	Let's try for moderate price range, four stars please.
PMUL2561.json	11	I have three moderate price, 4 star guesthouses in the east. May I suggest Warkworth House? It's located at Warkworth Terrace.
PMUL2561.json	12	Does the guesthouse have internet?
PMUL2561.json	13	Yes it does have internet.
PMUL2561.json	14	Okay. That is all I needed to know. Thanks.
PMUL2561.json	15	Before I let you go, is a booking needed, or are there any other services like a taxi that I can help with?
PMUL2561.json	16	No thank you I do not need anything else today.
PMUL2561.json	17	OK, great. Please call again if there is anything else we can assist you with. Have a great day. Goodbye!
PMUL0456.json	0	Hi. I am looking for a place to stay.
PMUL0456.json	1	I can narrow your results if you would like to be more specific. Otherwise Allenbell on Coldham Lane gets 4 stars.
PMUL0456.json	2	I'm looking for a cheap 4 star hotel in the east that has free wifi.
PMUL0456.json	3	OK, there are 3 to choose from.
PMUL0456.json	4	Please recommend the best one, I need to book a stay for 7 people starting Thursday for 2 nights.
PMUL0456.json	5	Booking was successful. Reference number is : Q884IOVI .
PMUL0456.json	6	Thanks! Are there any cheap Indian restaurants near the hotel?
PMUL0456.json	7	I'm sorry, there is not an Indian restaurant in the east that is cheap. Would you prefer one that is moderately priced or expensive instead?
PMUL0456.json	8	How about Indian restaurant with moderate price range and do not care about location
PMUL0456.json	9	There are four that meet your criteria. Two in the east, one in the north, and one in the west. Which one would you like more information on?
PMUL0456.json	10	I would prefer one that is located in the east.
PMUL0456.json	11	Curry price is located in the east and moderately priced, would you like a reservation?
PMUL0456.json	12	Yes, I will need to book it for the same day.
PMUL0456.json	13	I need a time and for how many people please.
PMUL0456.json	14	There will be 7 of us.
PMUL0456.json	15	What time should I reserve it for?
PMUL0456.json	16	I would like the table at 16:45, please.
PMUL0456.json	17	You are booked. the reference number is 6SOS8UJ4
PMUL0456.json	18	Great. I have all that I need. Thank you very much!
PMUL0456.json	19	Let me add that you were booked into the Autumn House. If that is all, have a wonderful stay in Cambridge. Goodbye.
PMUL3570.json	0	Can you get me information on a hotel called cityroomz?
PMUL3570.json	1	Cityroomz is a 0-star, moderately-priced hotel in the center of town. They offer free internet, but no parking. Their address is Sleeperz Hotel, Station Road, cb12tz.
PMUL3570.json	2	I would like to book this hotel for 4 people and 2 nights for Tuesday.
PMUL3570.json	3	Ok, I've booked the cityroomz hotel for your party of 4, for two nights starting Tuesday.
PMUL3570.json	4	Can I have the reference number please.
PMUL3570.json	5	Yes your reference number is BEVM8GPA .
PMUL3570.json	6	Thank you. I will also need a train to cambridge.
PMUL3570.json	7	Where will you be leaving from?
PMUL3570.json	8	I will be coming in from Stansted Airport heading into Cambridge.
PMUL3570.json	9	What day would you like to travel?
PMUL3570.json	10	I want to travel on Tuesday.
PMUL3570.json	11	There are 19 trains available that day. Is there a specific time you would like to book?
PMUL3570.json	12	I'd like to arrive by 18:30, but I can leave at any time.
PMUL3570.json	13	I have 13 trains. The TR9892 leaves at 5:24, would that work?
PMUL3570.json	14	Sounds good enough to me. What is the price of the TR 9892?
PMUL3570.json	15	10.10 pounds for one ticket
PMUL3570.json	16	Ok, great and could you please confirm the departure time for that train?
PMUL3570.json	17	The TR9892 leaves Stansted Airport at 5:24 and arrives in Cambridge at 5:52. The TR0135 would also work, it leaves at 14:24 and arrives in Cambridge at 14:52.
PMUL3570.json	18	Okay great. Thank you!
PMUL3570.json	19	Is there anything else that I can help you with?
PMUL3570.json	20	No, you have been a great help. That's it for now. Goodbye.
PMUL3570.json	21	Thank you for using our service. Hope you have a great day.
PMUL4777.json	0	I want to know if there are any places serving Belgian food in the centre?
PMUL4777.json	1	There are not. Would you like to look in another part of town, or for a different cuisine?
PMUL4777.json	2	Let's try a place serving indian food.
PMUL4777.json	3	We have many Indian restaurants. I recommend Saffron Brasserie, but it's expensive.
PMUL4777.json	4	That works for me. Can you reserve a table for 3 people on Sunday at 4 PM?
PMUL4777.json	5	Booking was successful. The table will be reserved for 15 minutes. Reference number is : O3J11WKJ .
PMUL4777.json	6	Thank you for taking care of the restaurant. I now need help with a specific hotel called autumn house.
PMUL4777.json	7	That is on the east side and is 4 stars. When are you wanting this booked for?
PMUL4777.json	8	Please book that for the same day and same group of people for 4 nights
PMUL4777.json	9	Your reservation for 3 people at the Autumn House for 5 days 4 nights was successful. Your eference number is : 0C45ZUDN . Can i assist you any further?
PMUL4777.json	10	I'd like to book a taxi also, to commute between those two locations, please.
PMUL4777.json	11	How many people will be in the taxi?
PMUL4777.json	12	It will be for 3 people as well.
PMUL4777.json	13	a red lexus will pick you ap at 3:30 the contact number is 07739253298, is there anything else today?
PMUL4777.json	14	Nope that's all I needed tonight.
PMUL4777.json	15	Good bye and enjoy !
SNG0842.json	0	Are there any proper hotels in the south?
SNG0842.json	1	Yes, the Lensfield Hotel is an expensive hotel in the south with 3 stars, free wifi, and free parking. It's located at 53-57 lensfield road cb21en. Would you like to book?
SNG0842.json	2	Ok, are there any hotels in the cheap price range in the south part of town?
SNG0842.json	3	I'm not finding any. Would you care for another part of town?
SNG0842.json	4	Can we check for guesthouses?
SNG0842.json	5	Rosa's bed and breakfast is a guesthouse in the south area that meets your preferences. Would you like me to make a reservation for you?
SNG0842.json	6	Yes, that will work.
SNG0842.json	7	When would you like to visit?
SNG0842.json	8	I don't need a reservation right now, but does Rosa's B&B have internet?
SNG0842.json	9	Yes they do! Do you have any other questions about Rosa's?
SNG0842.json	10	I really need internet. Can you tell me if they have free wifi?
SNG0842.json	11	Yes, Rosa's absolutely has free WiFi. Can I book a room for you?
SNG0842.json	12	No, that's fine!
SNG0842.json	13	Sure. Is there anything else I can help you with today?
SNG0842.json	14	No, that is all I need. Thank you.
SNG0842.json	15	Thank you for using our services & have a good day.
MUL0780.json	0	I am looking for a train that departs from Cambridge. It needs to leave after 15:00.
MUL0780.json	1	There are many trains that leave from Cambridge, where are you going and what day would you like to leave?
MUL0780.json	2	I need to go to stansted airport and I want to leave on Monday
MUL0780.json	3	Ok, there are 9 different trains, did you have an arrival time you needed?
MUL0780.json	4	I need to leave after 15:00.
MUL0780.json	5	Sure. TR7095 is leaving at 15:40. The price is 10.10 pounds and duration 28 minutes. It'll arive at 16:08. Should we book?
MUL0780.json	6	Yes please. I also need a place to stay, preferably in the west part of town.
MUL0780.json	7	In the west, we have four fine lodging establishments. Do you prefer a guesthouse or a hotel?
MUL0780.json	8	A guesthouse please that is not too expensive.
MUL0780.json	9	Finches Bed and Breakfast is listed as cheap, and it has 4 stars. Hobson's House is moderately priced, with 3 stars.
MUL0780.json	10	Is Finches located in the west and if so, can I please get the postcode?
MUL0780.json	11	Yes it is, the post code is cb30nd.
MUL0780.json	12	Thank you. That is everything I needed today.
MUL0780.json	13	You are welcome and I am glad we could be of help.
SNG0788.json	0	Hi there. I was wondering if you might be able to help me locate a guesthouse to stay at in town.
SNG0788.json	1	I found 24 guesthouses do you have a location you prefer or any other requirements?
SNG0788.json	2	I am just looking for one with free parking
SNG0788.json	3	All right, the Allenbell is a cheap guesthouse on the east side that might suit your needs.
SNG0788.json	4	That sounds good. Please book it for 1 person and 3 nights starting on Friday.
SNG0788.json	5	I have reserved you a room at the allenbell guesthouse for 1 on Friday, for 3 nights, reference number O35QES09 .
SNG0788.json	6	That's all I need, thank you.
SNG0788.json	7	Enjoy your stay! Goodbye!
PMUL4476.json	0	I'm looking for a place to stay that has 4 stars and includes free parking.
PMUL4476.json	1	I can help you with that. Would you prefer a guest house or hotel?
PMUL4476.json	2	I think I need it to be in the centre. I probably prefer a hotel if possible.
PMUL4476.json	3	There is one available. The university arms hotel. It is expensive, is that okay?
PMUL4476.json	4	Sure. I need a room for 4 people and 4 nights starting from thursday.
PMUL4476.json	5	Your reservation at the university arms hotel for 5 days 4 nights for 4 people was successful. Your Reference number is : BW6K6IAR .
PMUL4476.json	6	Thanks. Now that the hotel is set, I need to book a train for Thursday going to Peterborough.
PMUL4476.json	7	I have 38 trains going to Peterborough on Thursday. Will you be leaving from Cambridge and what time would you like to leave and arrive by?
PMUL4476.json	8	Yes, I am leaving from Cambridge and I will need to arrive by 09:45 please
PMUL4476.json	9	ok am booking for you one and send you the requirements
WOZ20411.json	0	I am looking for a restaurant in the center of town that serves Russian food.
WOZ20411.json	1	There are no Russian restaurants in the centre of town. Would you like something else?
WOZ20411.json	2	yes please, is there any restaurant serve british food?
WOZ20411.json	3	There is one moderately priced British restaurant and one expensive restaurant. Do you have a preference?
WOZ20411.json	4	No. What is the address and phone number?
WOZ20411.json	5	fitzbillies restaurant's phone number is 01223 352500. Their address is 51 Trumpington Street City Centre
WOZ20411.json	6	thank you, good bye
WOZ20411.json	7	Thank you good bye
WOZ20520.json	0	I need a cheap restuarant. Probably in the west part of town
WOZ20520.json	1	How about La Margherita?
WOZ20520.json	2	What kind of food do they serve?
WOZ20520.json	3	la margherita is an italian restaurant in the area of west in the cheap price range.
WOZ20520.json	4	That sounds good. What is their phone number?
WOZ20520.json	5	Their phone number is 01223 315232.
WOZ20520.json	6	that was all I needed. Bye now.
WOZ20520.json	7	Goodbye
PMUL0305.json	0	I'm looking for a place to eat in Cambridge. I'd like to eat light bites in the mid price range please.
PMUL0305.json	1	Hmmm. Nothing is coming to mind for light bites in that price range. May I suggest something else for dining?
PMUL0305.json	2	Okay, how about some Italian food? That sounds good, too.
PMUL0305.json	3	Is there a certain area you prefer?
PMUL0305.json	4	anywhere should be fine. find me the postcode, phone number and location please.
PMUL0305.json	5	You should try Prezzo it is located at 21-24 Northampton Road in the West, post code cb30ad and their number is 0179952160. Do you need more help today?
PMUL0305.json	6	I would like to find a room as well, with free wifi.
PMUL0305.json	7	We have several is there a specific area or price range you'd like me to look at?
PMUL0305.json	8	I want a 4 star place with the same price range as the restaurant. And free parking as well.
PMUL0305.json	9	How about Finches Bed and Breakfast?
PMUL0305.json	10	Sure, can you book that for me? Starting friday, 2 nights, and 5 people
PMUL0305.json	11	I apologize, but our hotel booking system is currently down. Can I help you with something else?
PMUL0305.json	12	That is all that I need.
PMUL0305.json	13	I apologize for the delay. The system is up and the booking was successful. Your reference number is GXCM3S30 .
PMUL0305.json	14	Thank you that is all I need today. Have a great day.
PMUL0305.json	15	Okay, I am happy to have assisted! Goodbye!
PMUL4472.json	0	Find me a place to dine on some cheap foods from the americas please.
PMUL4472.json	1	I am sorry but I am not finding any results for the Americas. Is there another food type you would be interested in?
PMUL4472.json	2	How about spanish food?
PMUL4472.json	3	It seems there are no cheap Spanish restaurants either. Can I help you with anything else today?
PMUL4472.json	4	you can help me to book a table for 8 people at 16:45 on friday. Make sure you get the reference number with moderate price range
PMUL4472.json	5	Your booking is successful, reference number is WLB1869A
PMUL4472.json	6	Great, thanks! Can you also help me find a train to get me to Cambridge from Leicester?
PMUL4472.json	7	which day will you want to travel?
PMUL4472.json	8	I would like Friday
PMUL4472.json	9	I have a few options on Friday with departures starting at 5:09 and recurring every hour. What time would you like to depart?
PMUL4472.json	10	Can you pick one and get me 8 tickets please?
PMUL4472.json	11	Booking was successful, the total fee is 302.39 GBP payable at the station . Reference number is : I0W8XGUW .
PMUL4472.json	12	Thanks, that's all I needed today!
PMUL4472.json	13	enjoy your stay in cambridge
PMUL0895.json	0	I'm looking for a restaurant in the north.
PMUL0895.json	1	Absolutely! What type of food are you looking to eat and is there a specific price range?
PMUL0895.json	2	I want some light bites food, and cheap if possible.
PMUL0895.json	3	I haven't found anything. Is there another cuisine you're interested in?
PMUL0895.json	4	how about one that serves italian food
PMUL0895.json	5	da vinci pizzeria is a good choice! Would you like a reservation?
PMUL0895.json	6	Yes I would like to book a table for 2 at 12:30 on Thursday please.
PMUL0895.json	7	Your reservation has been made. The reference number is 6BL860WY .
PMUL0895.json	8	great, thanks for your help.
PMUL0895.json	9	Is the anything else I can help you with ?
PMUL1033.json	0	I need to book a train to cambridge on Monday.
PMUL1033.json	1	Where will you be departing from?
PMUL1033.json	2	I will be departing out of Stevenage.
PMUL1033.json	3	We have 10 different trains on that day. What time will you be departing or arriving?
PMUL1033.json	4	I want to arrive by 16:45.
PMUL1033.json	5	Okay TR8265 departs at 09:54. Would you like me to book that for you?
PMUL1033.json	6	Sorry, I looked at the calendar. I need a Thursday train, not a Monday. Can you please find a train on that day instead?
PMUL1033.json	7	Okay, no problem. The TR1163 train leaves at 05:54. Will that work for you?
PMUL1033.json	8	What time will the train arrive in Cambridge?
PMUL1033.json	9	It arrives at 06:43.
PMUL1033.json	10	Ok please book that for 5 people.
PMUL1033.json	11	I have made those reservations and your reference number is 9JXA0UWF .
PMUL1033.json	12	Thank you. I am also looking for a museum to visit. Do you have any recommendations?
PMUL1033.json	13	Broughton house gallery is a great place in the centre of town! The entrance fee is free! Would you like their information?
PMUL1033.json	14	Yes, please give me the postcode, entrance fee and address.
PMUL1033.json	15	They are at 98 King Street, postcode cb11ln, admission is free, any further questions today?
PMUL1033.json	16	No thank you.
PMUL1033.json	17	Can I look up anything else for you?
PMUL1033.json	18	Nope, you have been extremely helpful. Thanks again. Bye.
PMUL1033.json	19	You are welcome. Have a great time in Cambridge. Bye.
MUL1115.json	0	Yes I would like information on Clare hall.
MUL1115.json	1	Of couse. Clare Hall is a college located in the west. It's address is herschel road, and there is no entrance fee. Is there anything else you would like to know?
MUL1115.json	2	What is the phone number for Clare Hall?
MUL1115.json	3	The phone number is 01223332360. Could I be of further assistance?
MUL1115.json	4	I also am looking for a hotel called kirkwood house
MUL1115.json	5	Kirkwood House is a guesthouse in the north area with 4 stars moderately priced.
MUL1115.json	6	Can I get the address for the Kirkwood House?
MUL1115.json	7	The address for Kirkwood House is, 172 Chesterton Road post code cb41da. Is there anything else you would like to know?
MUL1115.json	8	That's it. Thank you.
MUL1115.json	9	You're welcome. Enjoy your stay!
MUL0121.json	0	While I am visiting Cambridge, I would like to stay at the Ashley Hotel. Where is it located?
MUL0121.json	1	The Ashley Hotel is located at 74 Chesterton Road. Would you like the phone number? I can also book a reservation for you.
MUL0121.json	2	Book me a room there for 2 night with 6 people, starting Friday. Also, I will need the reference number.
MUL0121.json	3	Your booking was successful! The reference number is DH7R8VDH . Is there anything else I can help you with today?
MUL0121.json	4	I'd like a cheap restaurant in the centre of the city.
MUL0121.json	5	There are a few cheap restaurants in the center of the city. Would you like Asian Oriental or Chinese food?
MUL0121.json	6	I would like Chinese food.
MUL0121.json	7	I found three restaurants, Charlie Chan, Rice House, and Golden House, which would you like to book?
MUL0121.json	8	Let's go with Charlie Chan for 6 people at 15:45 Friday
MUL0121.json	9	Your booking was successful. The table will be reserved for 15 minutes. Your reference number is KFI8B8IF . Is there anything else I can help you with today?
MUL0121.json	10	No that will be all. Thank You.
MUL0121.json	11	You are welcome! Goodbye.
WOZ20619.json	0	I would like a restaurant in the north part of town that serves australasian food
WOZ20619.json	1	There are no restaurants matching your criteria. Would you like to search for something else?
WOZ20619.json	2	How about asian oriental food?
WOZ20619.json	3	Saigon City serves asian oriental and they are located in the north, although they are quite expensive. Would you like the address?
WOZ20619.json	4	Yes, I would like their address and phone number.
WOZ20619.json	5	Saigon City's address is 169 High Street Chesterton Chesterton and its phone number is 01223 356555
WOZ20619.json	6	Thank you goodbye.
WOZ20619.json	7	thank you and good bye
MUL0726.json	0	I've heard good things about the Acorn guest house. Could you find it for me?
MUL0726.json	1	The Acorn Guest House is a 4 star guesthouse in the north with free Wifi and parking. The address is 154 Chesterton Road and the phone number is 01223353888.
MUL0726.json	2	Thank you very much!
MUL0726.json	3	Is there anything else I can help you with?
MUL0726.json	4	Yes, I also need a train to Cambridge from Ely.
MUL0726.json	5	Sure what day will you be traveling?
MUL0726.json	6	Wednesday and needs to arrive by 18:15 that day.
MUL0726.json	7	There are 7 trains, TR1549 arrives at 18:07 if you'd like to book that just let me know.
MUL0726.json	8	I don't need to book right now. What time does this train depart from Ely?
MUL0726.json	9	Train TR1549 departs at 17:50 and arrives in Ely at 18:07.
MUL0726.json	10	Excellent, that's all the information I need right now. Thank you!
MUL0726.json	11	Have a great day.
PMUL0047.json	0	Hi! I'm planning my trip to Cambridge and I was wondering if you had information on any Mediterranean restaurants located in the centre of Cambridge?
PMUL0047.json	1	Thre are 3 such places. Do you have a price range?
PMUL0047.json	2	Not really but I would like to make a reservation for 7 people at 16:45 on a Friday. I will need the reference number as well.
PMUL0047.json	3	I would like to recommend the gardenia is that okay to book?
PMUL0047.json	4	Yes. That sounds good. Do you have any moderate priced guesthouses available?
PMUL0047.json	5	I was able to book the table for you the reference number is HH5J45Z5 . There are many guesthouses to chose from, what area do you want to stay in?
PMUL0047.json	6	I don't seem to have a preference but I wiukd like a moderately priced place with free parking.
PMUL0047.json	7	Can I reccommend acorn guest house in the north,it has free parking and moderately priced?
PMUL0047.json	8	Could I have the postcode and how many stars of the hotel?
PMUL0047.json	9	The postcode of Acorn Guest House is cb41da.
PMUL0047.json	10	I also need to get a taxi to go from the hotel to the restaurant. I need it to arrive at 16:45. I'd like the contact number and the car type.
PMUL0047.json	11	The car type is a White Volkswagen and the contact info is 07869317817. They will pick you up in time to have you at the restaurant by 16:45.
PMUL0047.json	12	Thank you so much, thats all I need
PMUL0047.json	13	You're very welcome! Have a great stay! Bye!
MUL1644.json	0	I need to book a train from Norwich to Cambridge.
MUL1644.json	1	There are several what day and time would you like to leave?
MUL1644.json	2	I need to leave on Monday and arrive by 17:45.
MUL1644.json	3	Of course! I'd recommend the TR0192 train, which arrives by 17:35. Would that work for you?
MUL1644.json	4	Could I please get the price and the train ID?
MUL1644.json	5	The train id is TR0192 and the cost is 17.60
MUL1644.json	6	I also need a restaurant. Can you do that?
MUL1644.json	7	Yes. What type of resturant do you need?
MUL1644.json	8	fusion food would be ideal.
MUL1644.json	9	I'm sorry, there are no fusion restaurants in Cambridge. Can I find a different type of cuisine for you?
MUL1644.json	10	Try chinese food instead.
MUL1644.json	11	We've got 17 Chinese restaurants. Is there a part of the city or a price range you had in mind?
MUL1644.json	12	Can we get a restaurant in the cheap price range. It will be for 5 people at 20:30, on the same day
MUL1644.json	13	I have 3 cheap Chinese restaurants in the centre and 1 in the south, which would you like me to try to book?
MUL1644.json	14	Pick your favorite and book it. We are a party of 5 and we'd like to eat late, like 20:30, on the same day as that train you found for me.
MUL1644.json	15	I was not able to book any of those 4 at 20:30, would you like to try an earlier time?
MUL1644.json	16	Could you try for 19:30 please?
MUL1644.json	17	That was successful. Your reference number is WM46ALL4
MUL1644.json	18	Thanks for all your help
MUL1644.json	19	Thank you for using our system!
PMUL2171.json	0	Hi, can you help me with some information on places to go in town?
PMUL2171.json	1	Sure, what type of attraction are you looking for?
PMUL2171.json	2	I'm looking for a swimming pool in the North.
PMUL2171.json	3	Jesus green outdoor pool is in that area.
PMUL2171.json	4	What's the address and entrance fee for that pool?
PMUL2171.json	5	Adress, between victoria road and the river. The entrance fee is unknown. Is there anything else?
PMUL2171.json	6	I would like a restaurant in the same area.
PMUL2171.json	7	Okay, what type of food would you like to eat and what is your price range?
PMUL2171.json	8	I would like asian oriental food in the expensive range.
PMUL2171.json	9	I found Saigon City matching. Would you like to book a table there?
PMUL2171.json	10	Yes please book a table for 1 person at 14:45 on friday.
PMUL2171.json	11	Your table at Saigon City is booked for Friday at 14:45. The reference number is 2LC9ER6D . Is there anything else I can help you with today?
PMUL2171.json	12	Yes. I will also need a taxi to take me from Jesus Green Outdoor pool to Saigon City arriving in time for the reservation.
PMUL2171.json	13	Booking completed! Booked car type : yellow volkswagen Contact number : 07774063266
PMUL2171.json	14	Thanks. That was all I needed. Goodbye.
PMUL2171.json	15	You are welcome! Enjoy your visit.
PMUL2221.json	0	What kind of cool attractions to we have in town? Maybe in the water.
PMUL2221.json	1	I have 4 swimming pools in town if you are interested in that? I have 2 in the north, 1 in the east, and 1 in the centre.
PMUL2221.json	2	I would like to the information for the one east.
PMUL2221.json	3	The abbey pool and astroturf pitch is located in the East at pool way, whitehill road, off newmarket road. Their phone number is 01223902088. Would you like to know anything else?
PMUL2221.json	4	I am actually looking for a boat attraction in the north, not a swimming pool.
PMUL2221.json	5	riverboat georgina is in the north. do you want their information?
PMUL2221.json	6	Can I get their postcode please? I also am looking for a good restaurant in town.
PMUL2221.json	7	Their postcode is cb43ax. Can I help you with anything else?
PMUL2221.json	8	Yes I would like to find a restaurant that serves German food that is expensive.
PMUL2221.json	9	Sorry, no matches. Is there another food you want to try?
PMUL2221.json	10	What about British food?
PMUL2221.json	11	There are 5 British restaurants that meet your needs. Would you prefer the centre, west, or east part of town?
PMUL2221.json	12	Anywhere that you recommend will be great.
PMUL2221.json	13	Fitzbillies is a great British restaurant in the centre of town. Would you like me to reserve a table for you?
PMUL2221.json	14	Yes, please. I would like it to be for 4 people at 14:15 on Saturday.
PMUL2221.json	15	The booking was successful. Your table will be reserved for 15 minutes. Your reference number is 6S09L48Q . Can I help you with anything else?
PMUL2221.json	16	I also need a taxi between the two locations and need to get to the restaurant by 14:15
PMUL2221.json	17	I've booked a taxi for you. You should arrive at the restaurant by 14:15. The contact number is 07165032687. How else can I help you today?
PMUL2221.json	18	Can you let me know the type of car?
PMUL2221.json	19	It'll be a white tesla. Is there anything else I can help you with?
PMUL2221.json	20	No. that is all for now.
PMUL2221.json	21	Wonderful, glad I could be of assistance. Have a great day!
PMUL3365.json	0	I need a train to leave cambridge and arrive by 19:00
PMUL3365.json	1	sure, what is your destination?
PMUL3365.json	2	My destination is going to be stansted airport
PMUL3365.json	3	What day will you be traveling?
PMUL3365.json	4	I should leave on Thursday.
PMUL3365.json	5	Okay, the 17:40 train arriving at 18:08 will get you to the airport a little early.
PMUL3365.json	6	Great. Can you book me 7 seats on that train?
PMUL3365.json	7	Here is your reference number IVUVQUHJ and the total fee is 70.7 GBP. Is their anything else I can help you with?
PMUL3365.json	8	I also want to eat Modern European in the south.
PMUL3365.json	9	restaurant alimentum is the place for you! Do you need a reservation?
PMUL3365.json	10	Yes, please, make it for the same group (7 people), 10:00 on the same day.
PMUL3365.json	11	Your booking has been made at Restaurant Alimentum for Thursday at 10:00. Reference number is 1U8QWEDC .
PMUL3365.json	12	Thanks for the help! Goodbye.
PMUL3365.json	13	Have a great trip! I hope you enjoy your trip!
MUL1029.json	0	Yes I am looking for a place to stay that includes free wifi. I would prefer a guesthouse.
MUL1029.json	1	I have found several guesthouses is there a particular are you wish to stay in?
MUL1029.json	2	I am looking for a cheap hotel with a rating of 0 out of 5 stars.
MUL1029.json	3	I have the El Shaddai in the center that is cheap and has a 0 star rating. Would you like a booking?
MUL1029.json	4	Does the El Shaddai include free wifi?
MUL1029.json	5	Yes they sure do. Would you like me to book you a room?
MUL1029.json	6	Yes that will be fine. I will be needing accommodations for 5 adults for a total of 4 nights 5 days beginning Sunday. Include reference number.
MUL1029.json	7	Your reference number is 0E0R0NEJ .
MUL1029.json	8	Okay, thank you. I would also like to go to a museum while I'm in town. Could you give me some information on possible options?
MUL1029.json	9	There are many different museums available. Is there a certain area you would prefer?
MUL1029.json	10	No thank you. Could you recommend your favorite museum?
MUL1029.json	11	The Broughton House Gallery is a lovely museum in the centre of town. It's located at 98 King Street cb11ln and has free entrance. Their phone is 01223314960. Would that work?
MUL1029.json	12	Actually, yes, that's great. You've answered all my question wonderfully, thank you. Bye!
MUL1029.json	13	You're very welcome. Have a good day, goodbye.
MUL0924.json	0	I am looking for a restaurant called thanh binh in Cambridge.
MUL0924.json	1	Thanh Binh serves cheap vietnamese food and is located in the west. Would you like me to book you a table?
MUL0924.json	2	No thanks, can I have the phone number please?
MUL0924.json	3	Sure. The phone number is 0122362456. Can I be of further assistance?
MUL0924.json	4	Yes, I am searching for a particular attraction named old schools.
MUL0924.json	5	I have old schools located in centre. The entrance fee is free. Can I assist you with anything else today?
MUL0924.json	6	Yes, please provide more information about Old Schools. What type of attraction is it?
MUL0924.json	7	Old Schools is a place to see some amazing architecture.
MUL0924.json	8	Could I get the address and postcode please?
MUL0924.json	9	It is located on Trinity Lane with a postcode of cb21tt. Can I be of further assistance?
MUL0924.json	10	I will need a taxi to commute between Thanh Binh and Old Schools. I need to leave Thanh Binh by 02:00.
MUL0924.json	11	I was able to book that taxi service for you. You will be in a yellow Tesla. The contact number for them is 07657268211.
MUL0924.json	12	Thank you very much! That's all for today.
MUL0924.json	13	Your welcome and goodbye!
WOZ20481.json	0	I would like a moderately priced restaurant in the north part of town
WOZ20481.json	1	Golden Wok is located in the north part of town and is the moderate price range. Their address is 191 Histon Road Chesterton.
WOZ20481.json	2	Is there anything else in the moderate price range on the north part of town?
WOZ20481.json	3	yes, the nirala is indian restaurant in the moderate price range and in the north. It is located at 7 milton road chesterton and its phone number is 01223 360966. Is there anything else I can help you with?
WOZ20481.json	4	No, thank you. That's all I need.
WOZ20481.json	5	Have a good day!
MUL1200.json	0	I am looking for an entertainment attraction in the centre of town.
MUL1200.json	1	Unfortunately, I was unable to find something in entertainment in the centre of town. Can I help you in finding something in a different area or category?
MUL1200.json	2	Could you tell me about the types of museums in the Centre?
MUL1200.json	3	There are 11 museums in the centre, all of which are free. There are art galleries, an archaeology museum, and a history of science museum.
MUL1200.json	4	The History of Science Museum sounds interesting. Could you please send me the phone number and address?
MUL1200.json	5	Their phone number is: 01223330906. Their address is: free school lane. Can I help you with anything else?
MUL1200.json	6	Yes, I'm also like to get away from it all and stay at a place in the centre with no internet.
MUL1200.json	7	I'm sorry, there is nothing in the centre without internet. Would you like to try the North side of town perhaps?
MUL1200.json	8	No. I would like to stay in the same area as the attraction. It doesn't have to have internet but it does need to be expensive and with 3 stars.
MUL1200.json	9	Then the Gonville Hotel is the place for you. Would you like a room reserved for you?
MUL1200.json	10	Yes, if you could do that.
MUL1200.json	11	How many nights and starting when?
MUL1200.json	12	4 nights starting Friday for just myself. If you could book that and provide me a reference number that would be great!
MUL1200.json	13	Okay, your room is reserved. The reference number is 7OB0YMGO . What else can I help you with?
MUL1200.json	14	Please book me a taxi leaving the History of Science Museum back to the Gonville Hotel. I need to leave the museum by 17:45.
MUL1200.json	15	Of course. A blue Volvo will be picking you up at the Museum. The contact number is 07883239708. Will there be anything further?
MUL1200.json	16	No, you have been very helpful. Goodbye.
MUL1200.json	17	Thank you. Goodbye.
MUL2085.json	0	I need to find a train to bishops stortford please.
MUL2085.json	1	When will you be departing and where will you be departing from?
MUL2085.json	2	I need to leave from Cambridge and arrive by 14:30 in Bishops Stortford.
MUL2085.json	3	There 35 trains to choose from, do you have a preference on a date and departure time?
MUL2085.json	4	Yes, I'd like to leave Thursday, what are the departure times and travel times?
MUL2085.json	5	The first leaves at 05:29 and the last pulls out at 13:29. How many tickets please?
MUL2085.json	6	That's not necessary. I need a place to stay too.
MUL2085.json	7	Okay, do you know what sort of place you want or where located?
MUL2085.json	8	I need a hotel in the west , free parking is not necessary but it should be rated 4 stars.
MUL2085.json	9	How about finches bed and breakfast? They are in the west and have an excellent 4 stars. Free internet and parking!
MUL2085.json	10	Sounds great. Can I get more information on finches bed and breakfast please?
MUL2085.json	11	Finches address is 144 thornton road, postcode cb30nd. May I book it for you?
MUL2085.json	12	Would it be possible to book it for eight people for four nights?
MUL2085.json	13	Okay, when would you like to begin your stay?
MUL2085.json	14	On Sunday, please.
MUL2085.json	15	Booking was successful. Reference number is : JFMQZLIX . Is there something else I can assist you with?
MUL2085.json	16	No thank you that was all I needed. Good bye.
MUL2085.json	17	Thank you and enjoy your stay.
PMUL0140.json	0	I'm looking for an expensive indian restaurant.
PMUL0140.json	1	I have many. Is there a certain area you are looking for?
PMUL0140.json	2	Yes it can be in centre. I would like to book it for 1 person at 20:00 on Saturday.
PMUL0140.json	3	OK, I booked a table for you at Saffron Brasserie. Your reference number is 65G14AF2 . Can I help with anything else?
PMUL0140.json	4	No thanks, that will everything.
PMUL0140.json	5	Thank you for using our service today.
PMUL0140.json	6	You're welcome, thanks.
PMUL0140.json	7	Are you sure there is nothing else I can do for you today?
PMUL0140.json	8	I'd like to find a guesthouse in the north. I want it to have 2 stars.
PMUL0140.json	9	There are no guesthouses that meet your criteria, can I check something else for you?
PMUL0140.json	10	Are there any hotels in that area instead of guesthouses?
PMUL0140.json	11	There is the ashley hotel or the lovell lodge. Would you like me to make a reservation?
PMUL0140.json	12	Is there a room at the Lovell Lodge available for 1 person on Saturday for 3 nights?
PMUL0140.json	13	You are all booked! Reference number is 6O4VAAHM .
PMUL0140.json	14	Great, thanks! Now I'd just like a taxi to take me from Lovell Lodge to Saffron Brasserie by 20:00. Please give me the car and contact info
PMUL0140.json	15	Booking completed! Booked car type : red skoda Contact number : 07515009678
PMUL0140.json	16	Thanks that will be all. Goodbye
PMUL0140.json	17	I hope you enjoy your stay. Contact us anytime. Good bye.
WOZ20458.json	0	I would like a restaurant in the east part of town that serves gastropub food
WOZ20458.json	1	That would be the Royal Standard at 280 Mill Road City Centre. They can be reached at 01223247877.
WOZ20458.json	2	Thank you goodbye.
WOZ20458.json	3	Goodbye!
PMUL0341.json	0	I am looking for information on a hotel called Carolina Bed and Breakfast.
PMUL0341.json	1	Yes, the Carolina Bed and Breakfast is located on 138 perne road and is located in the east. It has 4 stars and it's price range is moderate.
PMUL0341.json	2	how is it rated and give me the phone number and post code
PMUL0341.json	3	The Carolina Bed and Breakfast is located at the cb13nx and is rated 4 stars. Would you like me to book a room for you?
PMUL0341.json	4	Can I get the phone number for that please? I want to book directly through them.
PMUL0341.json	5	The phone number is 01223247015
PMUL0341.json	6	Can you help me find a British restaurant in a moderate price range?
PMUL0341.json	7	We have 5 British restaurants that are in that price range. Would you like to dine in the centre or the west?
PMUL0341.json	8	Area doesn't matter. You can pick one and then please book it for me for 2 people on sunday at 16:30
PMUL0341.json	9	i found one at the west i hope you will like it i will book it for you
PMUL3487.json	0	I'm planning a trip and am looking for a place to stay. Can you help me with that?
PMUL3487.json	1	Okay, what is the price range and what area would you like to stay in?
PMUL3487.json	2	I am looking for something in the cheap price range in the centre of town.
PMUL3487.json	3	There is alexander bed and breakfast it's a 4 star guesthouse that's in your price range. Would you like more information or for me to book it for you?
PMUL3487.json	4	Can you please book it? I'd like to stay for five nights beginning on Saturday. It's just me.
PMUL3487.json	5	Booking was successful. Reference number is : US44VVX2 .
PMUL3487.json	6	Great thanks for all your assistance!
PMUL3487.json	7	You're welcome! Have a great trip!
PMUL3487.json	8	I'm also looking for information on an attraction called nusha.
PMUL3487.json	9	Yes, Nusha is entertainment in the south. I do not know the entrance fee, but the phone # is 01223902158.
PMUL3487.json	10	What is the address?
PMUL3487.json	11	they are at unit g6 cambridge leisure park, clifton road, anything else today?
PMUL3487.json	12	Yes, I also need a taxi to go between the two. I want to leave Nusha by 03:00. Can you book and get me the contact and car type?
PMUL3487.json	13	I have you in a Blue Lexus. Contact them at 07671538206. What else may I do for you?
PMUL3487.json	14	Could you verify for me that the Alexander Bed and Breakfast has free wifi and free parking? If not, I'll need to change my reservation.
PMUL3487.json	15	It does! Can I help you with anything else?
PMUL3487.json	16	No that is all the information I need today.
PMUL3487.json	17	Glad I could help. Have a great trip. Good bye.
PMUL3792.json	0	I am looking for information in Cambridge
PMUL3792.json	1	We have plenty of information. Would you like to know about restaurants, hotels, trains, or attractions?
PMUL3792.json	2	I'm looking for a cheap guesthouse in the centre.
PMUL3792.json	3	Yes I have two to choose from. One is rated 4 stars and one is rated 0 stars. Do you have a preference?
PMUL3792.json	4	Can you book the 4-star place? There will be 8 of us staying for 5 nights, and we'll be arriving on Wednesday.
PMUL3792.json	5	I've booked you at alexander bed and breakfast. Your confirmation number is 75OVXX6J . Is there anything else I can help you with?
PMUL3792.json	6	Could you tell me if theres a train going to cambridge that leaves after 21:00?
PMUL3792.json	7	There are many trains available. Where will you be departing from and what day do you prefer?
PMUL3792.json	8	Departing from peterborough and leaving after 21:00
PMUL3792.json	9	What day will you be departing?
PMUL3792.json	10	It will be on Wednesday. I will need the price, please?
PMUL3792.json	11	The fare will be 16.50 pounds. Is there anything else I can help you with?
PMUL3792.json	12	No, thank you. I think I have everything I need right now.
PMUL3792.json	13	thanks for inquiring with us. welcome all the time
PMUL3792.json	14	ok cool leave me alone now
PMUL3792.json	15	Thank you for using our services.
SNG01445.json	0	I was robbed a few minutes ago and need assistance.
SNG01445.json	1	Please contact the Parkside, Cambridge police station.
SNG01445.json	2	I need the address including postcode of the police station and also the phone number.
SNG01445.json	3	Of course. Their address is Parkside, Cambridge postcode CB11JG and phone number is 01223358966.
SNG01445.json	4	Thank you. That's all I needed.
SNG01445.json	5	You are more than welcome!
SNG01445.json	6	Ok, have a good day. Goodbye.
SNG01445.json	7	You are very welcome. Goodbye.
MUL0195.json	0	Can you find me a place with free parking to stay in the centre?
MUL0195.json	1	I can help with that, are you looking for a guesthouse or a hotel?
MUL0195.json	2	A guesthouse with three star rating could be great.
MUL0195.json	3	There are no guesthouses with 3 star but there is a 3 star hotel that offers free parking and free wifi. It is called Gonville Hotel.
MUL0195.json	4	Please book me that hotel, it fits my preferences.
MUL0195.json	5	Excellent. For how many people and for how long?
MUL0195.json	6	What is the price range, address and phone number of the hotel?
MUL0195.json	7	The hotel is expensive. The address is Gonville Place, and the phone number is 01223366611.
MUL0195.json	8	I'm also looking for a really nice restaurant that serves modern european food. Can you help me with that?
MUL0195.json	9	Sure! There is one restaurant meeting that criteria. It is the Darrys Cookhouse & Wine Shop. Would you like me to make a reservation?
MUL0195.json	10	What is the price range of this restaurant and is it located near the hotel?
MUL0195.json	11	They're both in the centre of town, and the restaurant has a price range of expensive.
MUL0195.json	12	I would like a table for 5 on Sunday at 19:30 at Darrys Cookhouse, please.
MUL0195.json	13	Sorry, a table isn't available at that time. Would you like to book another day or time?
MUL0195.json	14	Yes, can I have a table for 18:30 on the same day?
MUL0195.json	15	Ok I have booked your table for 5 at 18:30 on Sunday. Your reference number is 4PXENUHG . Is there anything else I can help you with?
MUL0195.json	16	Yes, I need a taxi to commute between the two places. I need to arrive to the restaurant by 18:30. Can you get me a contact number and car type?
MUL0195.json	17	Okay, it been booked. The car type is a yellow ford and your contact number is 07565490512. Can I help you with anything else?
MUL0195.json	18	Nope that should be it, thank you very much
MUL0195.json	19	You're welcome. Have a beautiful stay in our fair city.
PMUL1030.json	0	Hello, I'd like some information on a train departing from Cambridge on saturday.
PMUL1030.json	1	I am sure I can help you with that. Where will you be traveling to, and is there a special time you would like to depart?
PMUL1030.json	2	I am going to stevenage on saturday.
PMUL1030.json	3	At what time do you wish to depart or arrive?
PMUL1030.json	4	The train should leave after 09:15. I'm not particular on arrival time.
PMUL1030.json	5	I have train TR7542 leaving at 9:21 and arriving at 10:10. Would you like to make reservations for that?
PMUL1030.json	6	Yes please. I will have a party of 7. May I please get the reference number as well?
PMUL1030.json	7	Yes, I will provide a reference number.
PMUL1030.json	8	Can I have the reference number?
PMUL1030.json	9	Your reference number is 3TX311FG .
PMUL1030.json	10	Great. Can you find me a place to go in the west?
PMUL1030.json	11	Is there a certain type of attraction you'd like?
PMUL1030.json	12	I have no preference. Can you just make a recommendation and provide the address, postcode, and phone number?
PMUL1030.json	13	Clare Hall is a great college to visit. Their address is on Herschel Road. Postcode is cb39al. Their phone number is 01223332360.
PMUL1030.json	14	Thank you for the information.
PMUL1030.json	15	You're welcome. Is there anything else I can help you with today?
PMUL1030.json	16	That will be all for today! Thank you for the help!
PMUL1030.json	17	Thank you for contacting us and have a nice day.
PMUL4373.json	0	Please help me book a train from Cambridge to Stanstead Airport.
PMUL4373.json	1	When are you planning to travel?
PMUL4373.json	2	Monday. I need to leave after 18:15
PMUL4373.json	3	The earliest train after that time is TR7696 that leaves at 18:40 and arrives at the airport by 19:08. Would that work? Or, I have later trains.
PMUL4373.json	4	Yes, the 18:40 would work, how much does it cost?
PMUL4373.json	5	The price per ticket is 10.10 pounds. Would you like me to go ahead and book it for you? If so, for how many tickets?
PMUL4373.json	6	That's OK, no thank you. Are there any nightclubs in town?
PMUL4373.json	7	Yes there's 6 in the centre and 1 in the south.
PMUL4373.json	8	What's the postcode for the one in the south?
PMUL4373.json	9	The nightclub called the Place is located at the postcode cb23hg.
PMUL4373.json	10	Yes, thank you.
PMUL4373.json	11	Is there anything else I can do for you?
PMUL4373.json	12	No thank you that is all.
PMUL4373.json	13	enjoy your stay in cambridge!
PMUL2400.json	0	I am looking to visit the centre while I am here. What types of attractions are available for tourists?
PMUL2400.json	1	There's a wide variety of attractions from architecture, museums, among others.
PMUL2400.json	2	Can I get some information about the museums?
PMUL2400.json	3	Sure thing, is there a certain area you are interested in?
PMUL2400.json	4	The centre of town please.
PMUL2400.json	5	There are 11 museums in the Centre area. An example is the museum of archaelogy and anthropology. Are you interested in this one or would you like some other choices?
PMUL2400.json	6	Could I get the phone number of the museum of archaeology and anthropology?
PMUL2400.json	7	Their phone number is 01223333516. Do you need anything else?
PMUL2400.json	8	Yes please. I need a reservation for a particular restaurant called cocum.
PMUL2400.json	9	Okay, I'm looking at the restaurant Cocum in the west, would you like me to book you a table?
PMUL2400.json	10	Yes, Wednesday at 17:45. For 7 people.
PMUL2400.json	11	success! reference number is 3JTL308P, anything else today?
PMUL2400.json	12	Nope, that's it, thanks!
PMUL2400.json	13	welcome and thanks for using our services
MUL1931.json	0	I'm looking for a train.
MUL1931.json	1	I'll be happy to help. Can you tell me where you are leaving from and where you are going?
MUL1931.json	2	I am looking for a train that goes to Peterborough from Cambridge and arrives by 19:00.
MUL1931.json	3	What is your departure day and time?
MUL1931.json	4	I'll be leaving monday and the departure time doesn't matter.
MUL1931.json	5	for 16.50 pounds TR9859 leaves at 05.56
MUL1931.json	6	Okay, does TR9859 arrive by 19:00? I would also like the travel time, please.
MUL1931.json	7	I'm sorry for the confusion. I don't show TR9859. I have TR0607 that leaves at 18:06, arrives at 18:56. Travel time is 50 minutes. Does that work?
MUL1931.json	8	Sure that's fine, does that have the same price?
MUL1931.json	9	Yes, the price is 16.50 pounds. Can I help you with anything else today?
MUL1931.json	10	Yes, I am also looking for more information on parkside pools. Can you tell me what kind of attraction it is?
MUL1931.json	11	Parkside Pools is a swimming pool located in the centre of town. They are located at Gonville Place. Their postcode is cb11ly. They can be reached at 01223446100.
MUL1931.json	12	That sounds like the best attraction ever. Thank you for all your careful assistance. Have a lovely day! Bye!!
MUL1931.json	13	And you have a wonderful day as well!
MUL2217.json	0	Could you help me find a 0 star lodging with free parking?
MUL2217.json	1	Certainly, we have City Centre North B&B in the north and El Shaddai in the centre, both very affordable. Would you like to book one?
MUL2217.json	2	I want to make sure also, that it is a hotel and includes free wifi
MUL2217.json	3	Both City Centre North B and B and El Shaddai have free wifi. Would you like to book one of these?
MUL2217.json	4	Can I just get the address for them please
MUL2217.json	5	City centre is 328a histon road and el shaddai is 41 warkworth street.
MUL2217.json	6	Thanks, I also need a train to go to cambridge.
MUL2217.json	7	From where to cambridge then?
MUL2217.json	8	I want to leave from bishops stortford and arrive by 12:15.
MUL2217.json	9	Alright, what day will you be traveling? There are four trains per day that meet your requirements.
MUL2217.json	10	I would like to leave on friday.
MUL2217.json	11	TR6834 leaves at 11:29 and arrives in Cambridge at 12:07. Does this allow you enough time? Or TR2083 that leaves at 09:29 and arrives in Cambridge at 10:07.
MUL2217.json	12	Please book me for one for train TR 6834
MUL2217.json	13	I booked you one seat on TR6834 departing Bishops Stortford for Cambridge Friday at 11:29. Reference is MFL4CZTS . Is there anything more today?
MUL2217.json	14	Thank you so much for your help.
MUL2217.json	15	You are welcome have a great time!
PMUL2214.json	0	I'm looking to visit a museum in Cambridge. Can you tell me a little about what you have?
PMUL2214.json	1	There are 23 museums that match that criteria. What area should the museum be in?
PMUL2214.json	2	I don't have a preference. Can you recommend one?
PMUL2214.json	3	Cambridge Artworks is a great place and has free entry. Their address and phone number is 5 Greens Road 01223902168.
PMUL2214.json	4	Sounds great, thanks. I am also looking for a restaurant in the Centre that serves gastropub food.
PMUL2214.json	5	Okay, there are 3 different restaurants. What is your price range?
PMUL2214.json	6	It really doesn't matter money is no object. I need a table for 8 on thursday at 14:45. As long as its a gastropub in the centre of town
PMUL2214.json	7	I will make a booking for backstreet bistro,Booking complete here is your reference number T9TB8FBO .
PMUL2214.json	8	awesome! thanks for all the info
PMUL2214.json	9	Sure. Is there anything else I can assist you with today?
PMUL2214.json	10	I would also like to book a taxi to get between the museum and the restaurant.
PMUL2214.json	11	I can work on booking this for you.
PMUL2214.json	12	I need to arrive at the restaurant by 14:45. I'll need the contact number and car type as well please.
PMUL2214.json	13	Okay I have booked your taxi. The contact number is 07498867892 and the car is a blue tesla.
PMUL2214.json	14	Thank you that's all the help I need. Goodbye
PMUL2214.json	15	Thanks for using our service today!
SNG01906.json	0	I Am injured and are looking for a hospital nearby
SNG01906.json	1	The Addenbrookes Hospital is nearby on Hills Rd. Can I call the emergency department for you at 01223217118?
SNG01906.json	2	That hospital will be fine, do you have the address and postcode for that hospital?
SNG01906.json	3	Addenbrookes Hospital is located at Hills Rd, Cambridge, postcode CB20QQ. Is there a particular department you need?
SNG01906.json	4	No. That's all the information I was looking for today. Thanks.
SNG01906.json	5	Can I help you with anything else?
SNG01906.json	6	No, that would be all. Good bye.
SNG01906.json	7	Have a wonderful day, good bye.
PMUL0493.json	0	Hello, I am in need of a 4 star place to stay in the north,please.
PMUL0493.json	1	There are 5 guesthouses and 0 hotels that fit your criteria. Do you require parking or a specific price range?
PMUL0493.json	2	I would like free wifi.
PMUL0493.json	3	The Avalon may be a good choice.
PMUL0493.json	4	Is that a guesthouse? If so, can you book me a room for Sunday for 5 people, 2 nights?
PMUL0493.json	5	It is. Reference number is : W7KCVTHJ . Anything else?
PMUL0493.json	6	I am also looking for a place to dine, in the same area as the hotel.
PMUL0493.json	7	Sure, I can help you with that. Did you have a price range in mind?
PMUL0493.json	8	Moderate price range thank you
PMUL0493.json	9	Then I would recommend the Golden Wok. Would you like to book a reservation?
PMUL0493.json	10	Do they serve barbeque food?
PMUL0493.json	11	They do not. They are a Chinese restaurant. Would you like me to find a barbecue place?
PMUL0493.json	12	I'm sorry, I think I'm spending too much money on this trip. Can you look for a cheap restaurant in the north that serves barbeque?
PMUL0493.json	13	I am sorry but there are no cheap, barbecue restaurants in the north. Do you want another cuisine or area?
PMUL0493.json	14	Is there a cheap italian food restaurant?
PMUL0493.json	15	da vinci pizzeria is cheap, shall I reserve a table for you?
PMUL0493.json	16	Yes please, 5 people, 15:00 on sunday please.
PMUL0493.json	17	I will go ahead and book that for you.
PMUL0493.json	18	Hello, are you still there? Its been a few minutes. I'm kind of in a hurry, is there a problem with the booking?
PMUL0493.json	19	sorry i was trying to make sure i book the right was. it is now booked.Reference number is : D5LV4L6Y .
PMUL0493.json	20	i also need to use a taxi
PMUL0493.json	21	Of course! To book a taxi, I'll need to know your destination, departure site, and what time you would like to leave or arrive by.
PMUL0493.json	22	I want to arrive at da vinci pizzeria by 15:00.
PMUL0493.json	23	Okay! From where are you departing?
PMUL0493.json	24	From the hotel discussed.
PMUL0493.json	25	Great, I will book that for you now.
PMUL0493.json	26	Have you b ooked that yet? I need the reference number.
PMUL0493.json	27	Of course. The reference is W7KCVTHJ . Is there anything else I can help you with?
PMUL0493.json	28	Thank you for all your help.
PMUL0493.json	29	You are more than welcome.
PMUL3338.json	0	Can you help me find a train departing from birmingham new street going to cambridge?
PMUL3338.json	1	Absolutely. What day do you need to get to Cambridge, and at what time?
PMUL3338.json	2	train should arrive by 21:00 and should leave on tuesday
PMUL3338.json	3	There are trains that meet those requirements leaving once an hour starting at 05:40.
PMUL3338.json	4	Can you assist me with booking one?
PMUL3338.json	5	Lets narrow down the time a little, the TR 3802 leaves at 17.40 and arrives at 20.23 so that gives you a little extra time, would you like me to book you?
PMUL3338.json	6	That would be great. I also would like to book a guesthouse for my stay.
PMUL3338.json	7	Okay, great. You have a lot of options. Would you like to narrow it down by area, price range, or stars?
PMUL3338.json	8	Yes. It should have 2 stars and include free wifi.
PMUL3338.json	9	I do not have any in that star range. Shall I try something else?
PMUL3338.json	10	Maybe a star rating of 3 would be good. Is there anything available?
PMUL3338.json	11	yes when were you planning your stay and for how many people?
PMUL3338.json	12	I need the reservation to be for 2 people and 2 nights please.
PMUL3338.json	13	Okay! Starting when?
PMUL3338.json	14	On Tuesday please.
PMUL3338.json	15	I've booked your room for two at Hamilton Lodge. You'll be staying for 2 nights beginning Tuesday. Your reference number is 3NT2B4SP . Can I help you find anything else today?
PMUL3338.json	16	Thanks, that is all I'll need today. Bye.
PMUL3338.json	17	You're welcome, have a great day!
MUL0245.json	0	Can you find me a Turkish restaurant in the expensive price range please?
MUL0245.json	1	I have found the Meze Bar Restaurant located in centre area. Can I book this for you?
MUL0245.json	2	No. That's okay. Thank you. What is some other information on this location?
MUL0245.json	3	They are located in the centre of town, their postcode is cb13nf, and they are located at 196 Mill Road City Centre.
MUL0245.json	4	Thank you for that information I should have everything I need now.
MUL0245.json	5	Are you sure I can't help you with anything else?
MUL0245.json	6	I'm looking for a train from Birmingham New Street to Cambridge.
MUL0245.json	7	There are 133 trains, do you have a day and time you would like to travel?
MUL0245.json	8	Sure, wednesday I would like to leave after 14:45 please.
MUL0245.json	9	I have 9 trains that leave every hour and the first one is at 15:40. Would you like me to book you the 15:40 train?
MUL0245.json	10	Yes but can you make a booking for 6 people? I would like a reference number too.
MUL0245.json	11	Booking was successful for TR5567, the total fee is 450.6 GBP payable at the station. The reference number is 4ARZYTLC . Is there anything else you need help with?
MUL0245.json	12	Nope that should be it thank you
MUL0245.json	13	Booking was successful, the total fee is 450.6 GBP payable at the station . Reference number is : 4ARZYTLC .
MUL2047.json	0	Hi. I'm looking for a train going to Kings Lynn on Monday.
MUL2047.json	1	I have 19 different options. Can you tell me if you have a time you want to leave or arrive by?
MUL2047.json	2	I would definitely like to arrive by 14:45 at the latest.
MUL2047.json	3	There are 9 possible trains to take, do you have a preference on departure time?
MUL2047.json	4	No. I just need to arrive by 14:45. I would also like the price.
MUL2047.json	5	I have train TR0793 that departs at 13:11 and will get you there by 13:58. Do you think that would work? Oh, and the price is 9.80 pounds per ticket.
MUL2047.json	6	I'm also looking for a place to stay that includes parking
MUL2047.json	7	There are 29 options available. What area of town do you prefer and what is your price range?
MUL2047.json	8	I would like one in the expensive price range and needs to include free parking.
MUL2047.json	9	I would recommend the Gonville Hotel. It is in the centre of town and is an expensive offering with free parking.
MUL2047.json	10	Does it have a 4-star rating by chance?
MUL2047.json	11	No, Gonville has a 3 star rating. Can I help you make a booking there or would you like more options?
MUL2047.json	12	Are there any 1 star hotels meeting those requirements?
MUL2047.json	13	No there are only 3 and 4 star. Would you like one of those or would you like to keep looking?
MUL2047.json	14	I guess the 4 star would be better. They have internet, right?
MUL2047.json	15	University arms hotel is a 4 star hotel with internet and parking. Would you like to make a reservation?
MUL2047.json	16	No, just the phone number if you have it.
MUL2047.json	17	Of course! The phone number is 01223351241. May I help with anything else?
MUL2047.json	18	No that is everything. I need thank you for your help!
MUL2047.json	19	Enjoy your stay. Goodbye
SNG0124.json	0	I'm looking for the Parkside Police Station please.
SNG0124.json	1	The address of the Parkside Police Station is Parkside, Cambridge. It's phone number is 01223358966 and it's postcode is CB11JG.
SNG0124.json	2	Thanks, I think that's all I needed!
SNG0124.json	3	Thank you for using our service, and have a great day!
SSNG0397.json	0	I want to find a place to stay in the north with free parking.
SSNG0397.json	1	I have several hotels in the north that offer free parking. Do you have a preferred price range so that I can narrow it down for you a bit?
SSNG0397.json	2	Yes, I would prefer a moderate price range.
SSNG0397.json	3	The Acorn Guest House appears to meet your Criteria. Would you like more details on this hotel?
SSNG0397.json	4	That sounds great, could you make the reservations for me there then? I will be there Sunday with 3 people and we will stay for 2 nights.
SSNG0397.json	5	I am sorry the acorn doesn't have a room available then, how about another hotel?
SSNG0397.json	6	No,lets try ext weekend,see if you can book it for then ?
SSNG0397.json	7	I'm sorry. There is still no availibility. Would you like to try a different hotel then?
SSNG0397.json	8	Yes, same price range.
SSNG0397.json	9	Hamilton Lodge has the same amenities and is right next door. Would you like me to book that property for you?
SSNG0397.json	10	Yes, please.
SSNG0397.json	11	Booked! Reference number: 2BA346MA .
SSNG0397.json	12	Okay great. Thank you very much.
SSNG0397.json	13	You're welcome. Is there anything else I can help you with today?
SSNG0397.json	14	That will be all. Thank you for your help.
SSNG0397.json	15	No problem. Have a great day. Good-Bye.
PMUL3814.json	0	I'm planning a trip to Cambridge and need a 4 star place with wifi to stay. It doesn't matter if its a hotel or guesthouse, just 4 star please.
PMUL3814.json	1	There are 21 guesthouses offering free wifi. Do you have a price range?
PMUL3814.json	2	It should be cheap and include free parking.
PMUL3814.json	3	I have 8 results. What area would you like?
PMUL3814.json	4	No particular area. What do you recommend?
PMUL3814.json	5	I recommend finches bed and breakfast, that've got some good reviews.
PMUL3814.json	6	Oh thats great. Please assist to book that for 5 nights starting from Saturday and if it fails then Tuesday. Please send me the reference number when you are done.
PMUL3814.json	7	Booking was successful for Saturday. Reference number is : 5LQHD9SU . Can I help with anything else?
PMUL3814.json	8	Yes, I'm looking for entertainment attractions located in the centre.
PMUL3814.json	9	I'm sorry there are no matches.
PMUL3814.json	10	Okay, perhaps you can find a college that I can visit.
PMUL3814.json	11	There are five colleges available in the centre area. How about Downing College? The entrance fee is free.
PMUL3814.json	12	Sounds great. What is the address?
PMUL3814.json	13	it is on regent street
PMUL3814.json	14	i also want a taxi to commute between the two places
PMUL3814.json	15	Okay, do you need the taxi to go to the restaurant or the attraction?
PMUL3814.json	16	I want to leave the attraction at 09:45 and head to the restaurant.
PMUL3814.json	17	Sure, you will be expecting a black lexus , their contact number is 07988632177
PMUL3814.json	18	Thank you so much.
PMUL3814.json	19	you are welcome, enjoy yourself.
MUL0441.json	0	I'm wondering if there is a train leaving at 21:15 that will take me to the Stansted Airport.
MUL0441.json	1	thank you, though there are many choices there isn't a 21:15 so I guess I will take the 21:40 on Friday.
MUL0441.json	2	Is there a train leaving before that?
MUL0441.json	3	Unfortunately no. The earliest that day departs at 21:40.
MUL0441.json	4	Okay. Can you book that for me please?
MUL0441.json	5	Sure. how many will be traveling?
MUL0441.json	6	It's just me. Can I have the price, travel time, and train ID? Also, do you have any places I can go when I get there?
MUL0441.json	7	Price is 10.10 pounds, the travel time is 28 minutes, and the train ID is TR4067. I'm sorry, but I don't see any attractions at the Stansted Airport.
MUL0441.json	8	Okay, can you find attractions near the centre?
MUL0441.json	9	There are 44 attractions near the center of town. Is there a certain type you're looking for?
MUL0441.json	10	Could you suggest me one? Also let me know of what type of attraction it is and the place's postcode.
MUL0441.json	11	The Cambridge corn exchange is a theatre and the post code is cb23qe. Would you like any more information?
MUL0441.json	12	Thanks, I have all I need. Have a nice day.
MUL0441.json	13	No problem! Have a great day.
MUL0441.json	14	Wonderful help, thanks
MUL0441.json	15	Thank you, Enjoy the Cambridge Exchange!
PMUL1425.json	0	Can you find me an attraction in the centre?
PMUL1425.json	1	Are you looking for a specific place? Or do you prefer a particular type of attraction?
PMUL1425.json	2	Not looking for anything specific. Maybe a college or museum if you can give me the address and entrance fee.
PMUL1425.json	3	I would recommend Hughes Hall. It is a college on Jesus Lane and the entrance is free.
PMUL1425.json	4	Thank you goodbye
PMUL1425.json	5	Thank you for using our service today.
WOZ20610.json	0	I would like a restaurant in the west part of town that serves international food
WOZ20610.json	1	Sorry but there is not matching restaurants serving international food in the west .
WOZ20610.json	2	Is there any restaurant in the east that serves international food?
WOZ20610.json	3	Yes, the missing sock serves international food and is located in the east part of town.
WOZ20610.json	4	can i have the phone number please
WOZ20610.json	5	there phone number is 01223812660 is there anything else I can help you with?
WOZ20610.json	6	That is all, thank you.
WOZ20610.json	7	Goodbye.
PMUL0500.json	0	I'm looking for a four star place to stay.
PMUL0500.json	1	I'd love to help you out there. What price range or area are you looking for?
PMUL0500.json	2	Expensive would be good. And I prefer the west part of town.
PMUL0500.json	3	The Huntington Marriott Hotel is located in the west part of town and is a 4 star rating.
PMUL0500.json	4	Does it have free parking and what is the price rage?
PMUL0500.json	5	It's in the expensive price range and yes, there is free parking there.
PMUL0500.json	6	Could you give me the phone number for that hotel?
PMUL0500.json	7	Their phone number is 01480446000. Can I help you with anything else today?
PMUL0500.json	8	Yes, can you help me find a place to dine that is in the same area as the hotel?
PMUL0500.json	9	Sure thing, here is a place saint johns chop house.
PMUL0500.json	10	Is it an expensive restaurant? I'll need the address, postcode and phone number
PMUL0500.json	11	I am sorry I was clearly misinformed. How about graffiti? They are in the west phone is 012232477977 & postcode is cb30lx.
PMUL0500.json	12	May I have the address as well please?
PMUL0500.json	13	Yes, their address is Hotel Felix Whitehouse Lane Huntingdon Road.
PMUL0500.json	14	Ok thank you. That's all I needed, bye now.
PMUL0500.json	15	Thank you for contacting us and have a nice day.
PMUL0125.json	0	I need to find a moderately priced place to stay.
PMUL0125.json	1	There are 3 hotels and 12 guesthouses in the moderate price range. What type of place do you want to stay at?
PMUL0125.json	2	I would like a 4 star place to stay in but I don't need parking.
PMUL0125.json	3	Depending on location, you have quite a few options. Lets try narrowing down which area and other options you might want. In the east area a and b guesthouse would be good. There are several choices for north part of town.
PMUL0125.json	4	I'm not concerned about area, but I do need a hotel.
PMUL0125.json	5	I have none that are in the moderate price range with 4 stars. Would you like to try a different search?
PMUL0125.json	6	Are you sure? It does NOT need to have free parking.
PMUL0125.json	7	I'm sorry, but I'm sure there are no hotels matching your criteria. Would you like to search in any price range?
PMUL0125.json	8	I think a bed and breakfast would be fine. I just need a moderate price range 4 star place.
PMUL0125.json	9	Avalon is a 4 star guesthouse in the North. It is moderately priced. Would you like to book a room?
PMUL0125.json	10	yes, i want to book it for 1 people and 2 nights starting from thursday.
PMUL0125.json	11	I have that booked for you! Booking was successful. Reference number is : BQ10XUIJ .
PMUL0125.json	12	I also need to book a table for 1 on Thursday at 16:45 at India House. Can you do that for me?
PMUL0125.json	13	Your table for 1 at India House this Thursday at 16:45 Booking was successful. The table will be reserved for 15 minutes. Your Reference number is : OSUO8YDY .
PMUL0125.json	14	I will need a taxi that will take me from the Avalon to the India House by 16:45, can you book that for me?
PMUL0125.json	15	Yes, the booking is completed. Car type is grey lexus and contact number is 0766024206.
PMUL0125.json	16	well thank you thats all for today
PMUL0125.json	17	You're welcome! Have a great day!
SNG0366.json	0	I need a train leaving cambridge. I have to arrive by 20:15.
SNG0366.json	1	What is your destination and at what time would you like to leave?
SNG0366.json	2	To Birmingham new street on Wednesday.
SNG0366.json	3	TR0115 will be departing at 05:01 and arrive at 07:44. Would you like me to book that for you?
SNG0366.json	4	Can you give me the total travel time?
SNG0366.json	5	The total duration is 163 minutes. Will you be needing tickets?
SNG0366.json	6	Not today I think I may book at the station. That is all for today. Thank you so much!
SNG0366.json	7	Your Welcome. Please feel free to contact us anytime!
PMUL3284.json	0	Can you let me knows about what architecture is available ot visit in south cambridge?
PMUL3284.json	1	I'm afraid there aren't any especially notable architectural attractions in the south, especially not compared to the ones in the centre of Cambridge. Perhaps you might consider those?
PMUL3284.json	2	how about one that is in the type of nightclub
PMUL3284.json	3	wow that's a 360! Anyway there is a place called the place in the south.
PMUL3284.json	4	Yes, I'm random like that! How much is the entrance fee for The Place?
PMUL3284.json	5	An entrance fee is not listed. I can give you the address and phone number if you'd like.
PMUL3284.json	6	I would also like the postcode.
PMUL3284.json	7	The Place is located at 22 Sidney Street, cb23hg. Their phone number is 01223324600. Can I help you with anything else today?
PMUL3284.json	8	i also need a train
PMUL3284.json	9	Okay I'll be happy to help you with that. Do you know where you'd like to go and where you plan to depart from?
PMUL3284.json	10	I'll be departing from london liverpool street on wednesday, and wold like to arrive in cambridge by 11:15.
PMUL3284.json	11	There is TR8813 that will arrive by 09:07 and TR7519 that will arrive by 11:07. Will one of those work for your schedule?
PMUL3284.json	12	I think TR8813 will work. Can you tell me what time it leaves?
PMUL3284.json	13	TR8813 leaves at 07:39. Anything else I can help you with?
PMUL3284.json	14	That's all I need today. Thanks!
PMUL3284.json	15	Ok. Have a great day.
MUL0495.json	0	I'm looking for the Cambridge Contemporary Art.
MUL0495.json	1	It is a museum in the center of town.
MUL0495.json	2	May I have the phone number and postcode?
MUL0495.json	3	Phone number is 01223324222 and postcode is cb21su.
MUL0495.json	4	Can you help me find a train leaving Saturday, departing from stansted airport?
MUL0495.json	5	Where are you headed?
MUL0495.json	6	I am headed to Cambridge and need to arrive by 1:30pm.
MUL0495.json	7	The TR8488 leaves Stansted at 12:24 and arrives in Cambridge at 12:52. Would that suit you?
MUL0495.json	8	It would, thanks. Please make me a booking for 2 people on that train.
MUL0495.json	9	I have booked two tickets for you. It'll be 16.16 GBP and the reference number is: VZK4BVQ5
MUL0495.json	10	Thanks, that's all I need today. I appreciate your help.
MUL0495.json	11	You're welcome. I hope you enjoy your trip!
PMUL2352.json	0	I'd like to find an attraction to visit. Something in the west.
PMUL2352.json	1	Okay, what type of attraction would you like to see?
PMUL2352.json	2	I would like to see a theater.
PMUL2352.json	3	I don't show any listings for theaters in the west would you like to search for another attraction?
PMUL2352.json	4	am also looking for a restaurant. The restaurant should serve south african food and should be in the moderate price range
PMUL2352.json	5	Unfortunately there are no restaurants that serve South African dishes on the West side, would you like me to try a different side of town?
PMUL2352.json	6	How about one that serves South African food?
PMUL2352.json	7	Unfortunately there are no restaurants that serve South African dishes on the West side, would you like me to try a different side of town?
PMUL2352.json	8	no but how about one that serves british food.
PMUL2352.json	9	The Saint Johns Chop House is moderately priced, serves British cuisine, as in the west part of town. Shall I book this for you?
PMUL2352.json	10	Yes, can you please book this for me?
PMUL2352.json	11	How many people and what day?
PMUL2352.json	12	I'm not ready to book yet. Can I get the phone number, postcode, and address, please?
PMUL2352.json	13	The address for Saint Johns Chop House is 21 - 24 Northampton Street, cb30ad. The phone number is 01223353110. Is there anything else that I can assist you with?
PMUL2352.json	14	Yes I need an attraction in the west. Anyone will do. Whatever you recommend.
PMUL2352.json	15	clare hall is a college with free admission. Their number is 01223332360.
PMUL2352.json	16	I also need a south african restaurant.
PMUL2352.json	17	I am sorry none are listed in that area, something else perhaps?
PMUL2352.json	18	Is there a restaurant in the west that serves British food?
PMUL2352.json	19	Yes, Saint Johns Chop House is available. Would you like to book a table?
PMUL2352.json	20	Not at this time. Can you give me the phone number, address and postcode, please?
PMUL2352.json	21	Saint Johns Chop House is located at 21-24 Northampton Street, postcode cb30ad. You can reach them by phone at 01223353110. Can I help you find anything else today?
PMUL2352.json	22	That is all, thanks.
PMUL2352.json	23	I am glad to have helped.
SNG01307.json	0	Hi! I need to find the Parkside Police station please.
SNG01307.json	1	It's address is Parkside, Cambridge with Postcode CB11JG.
SNG01307.json	2	Thank you Goodbye.
SNG01307.json	3	You are very welcome. Have a good day.
PMUL4942.json	0	Hello, I'm looking for an expensive restaurant that serves british food please
PMUL4942.json	1	I have 6 expensive British restaurants. Is there an area of town you'd like to be in?
PMUL4942.json	2	No, there is no particular area I would like to be in.
PMUL4942.json	3	I would recommend the grafton hotel restaurant, located at Grafton Hotel 619 Newmarket Road Fen Ditton on the east side of town. Do you need more information?
PMUL4942.json	4	i would also need the phone number
PMUL4942.json	5	01223241387 is the phone number. Can I help you with anything else today?
PMUL4942.json	6	Yes, I'm looking for a train that's heading to Cambridge by 14:45.
PMUL4942.json	7	OK, what is your departure station and what day are you traveling?
PMUL4942.json	8	I'm departing Leicaster on Wednesday. I need a booking for 1 person with a reference number please.
PMUL4942.json	9	I'm sorry, there are no trains that meet your criteria. Do you have any alternative options?
PMUL4942.json	10	I do not, thank you for the information
PMUL4942.json	11	Okay, may I help you with anything else?
PMUL4942.json	12	Are you sure there are no trains from leicester to cambridge on wednesday before 14:45? That seems odd to me.
PMUL4942.json	13	sorry, there are no trains from leicester to cambridge on wednesday.
PMUL4942.json	14	I really only need a train for that route. Thanks for your help.
PMUL4942.json	15	Okay, sorry about that. I hope we can help you in the future.
WOZ20047.json	0	I need to find a restaurant in the north side of town
WOZ20047.json	1	OK. Did you have a certain price range of cuisine in mind?
WOZ20047.json	2	I don't have a price range. I'm looking for a restaurant that serves catalan food.
WOZ20047.json	3	I'm sorry, there are no restaurants listed serving catalan food in the north part of town. Would you like to try something else?
WOZ20047.json	4	How about French type food?
WOZ20047.json	5	restaurant two two is in the north area and serving french food, can I help you with anything else?
WOZ20047.json	6	Yes. Can I get the name and phone number of one of those restaurants?
WOZ20047.json	7	Yes, Restaurant Two Two can be reached at 01223 351880.
WOZ20047.json	8	What is the area again sorry ?
WOZ20047.json	9	it is located in the north part of town
WOZ20047.json	10	Thank you for your help. Have a great evening.
WOZ20047.json	11	Thank you. Goodbye.
PMUL2963.json	0	Hello, I'm looking for places to go in town when I visit Cambridge. What kind of entertainment attractions are there available in the centre?
PMUL2963.json	1	There aren't any entertainment attractions in the center area.
PMUL2963.json	2	How about a swimming pool in centre?
PMUL2963.json	3	Yes, Parkside Pools is in the centre of town, on Gonville Place.
PMUL2963.json	4	How much is admissoin?
PMUL2963.json	5	Unfortunately my system is not showing an entrance fee but I can give you their phone number so you can call and inquire.
PMUL2963.json	6	Yes, please - the phone number and postcode.
PMUL2963.json	7	Okay. The phone number is 01223446100 and the post code is cb11ly. Is there anything else I can help you with?
PMUL2963.json	8	i also want to book a stay at alpha-milton guest house. i want to book for 3 people and 2 nights starting from wednesday.
PMUL2963.json	9	it has been booked. reference number is OPFPJHUK .
PMUL2963.json	10	Thank you so much you have been a big help.
PMUL2963.json	11	No problem. Enjoy you stay.
PMUL2963.json	12	Thank I will.
PMUL2963.json	13	Great! Bye now!
SSNG0270.json	0	I need to find a moderately priced guesthouse, please.
SSNG0270.json	1	A and b guest house is moderately priced in the east part of town.
SSNG0270.json	2	I need a place in the North, sorry.
SSNG0270.json	3	I have a few in the east part of town,would you need free parking?
SSNG0270.json	4	Not worried about parking. I am looking for a hotel that would be available starting Monday for 4 nights for 6 people.
SSNG0270.json	5	In the North part of Town, I have 9 moderately priced options. I recommend Arbury Lodge which can accommodate your booking and has 4 stars.
SSNG0270.json	6	Sounds great. I want to book the hotel for 6 people. We will be there for 4 nights and arrive on Monday. May I also get the reference number?
SSNG0270.json	7	The booking was successful. Your reference number is SE28HKNK . Is there anything else that I can assist you with?
SSNG0270.json	8	No, thank you, that's all that I need.
SSNG0270.json	9	Thank you for calling. Have a great day!
MUL0140.json	0	I'm looking for a nice guesthouse to stay at during my trip to Cambridge. Anything with a 4 star rating will do.
MUL0140.json	1	The a and b guest house meets your needs. Would you like to book it?
MUL0140.json	2	Possibly, does this guesthouse hotel offer free parking and free wifi?
MUL0140.json	3	How about Allenbell? This meets all your criteria.
MUL0140.json	4	That could work. Where is Allenbell located?
MUL0140.json	5	The Allenbell is located in the East area. Would you like its address?
MUL0140.json	6	I am also looking for a cheap restaurant in the area that serves vegetarian food.
MUL0140.json	7	I'm not finding any cheap vegetarian restaurants. Is there something else you'd like to look for?
MUL0140.json	8	What price range do you have for vegetarian food in the centre area?
MUL0140.json	9	There are no results for a vegetarian restaurant in any price range in the centre area. Would you like to broaden your search to another area?
MUL0140.json	10	Are there any that serve spanish food instead? Preferably in the center area as well.
MUL0140.json	11	Yes. We have two restaurants that meet your criteria. Would you like me to book one for you?
MUL0140.json	12	I just need the address for one of the restaurants.
MUL0140.json	13	The address for La Tasca is 14 -16 Bridge Street.
MUL0140.json	14	Thank you. The last thing I think I need is a taxi. To pick me up at the restaurant by 10.00?
MUL0140.json	15	I'd be happy to help with your request, but first I will need to know what your destination is from the restaurant.
MUL0140.json	16	I need to return back to the hotel from the restaurant.
MUL0140.json	17	All right, I have booked you a taxi from the restaurant back to your lodgings. It will be a white volkswagen, and it will arrive to pick you up at 10:00. Is there anything else you need?
MUL0140.json	18	Yes I will also need the contact number for the taxi. Thanks
MUL0140.json	19	The contact number is 07800878036. Anything else I can do for you?
MUL0140.json	20	What is the car type that will be sent?
MUL0140.json	21	The car is a white volkswagen. May I help you with anything else?
MUL0140.json	22	No, that is all! Thank you very much!
MUL0140.json	23	You are welcome. Have a great day, goodbye.
PMUL1302.json	0	I need help finding a train that will depart on Saturday.
PMUL1302.json	1	Okay we have a lot of trains departing on Saturday. Where are you headed and where are you departing from?
PMUL1302.json	2	I am going to Cambridge and leaving from Stevenage.
PMUL1302.json	3	What time do you need to arrive?
PMUL1302.json	4	by 18:45 please.
PMUL1302.json	5	I have seven trains available. What time do you want to leave?
PMUL1302.json	6	The train should arrive by 18:45 and should leave on saturday.
PMUL1302.json	7	I have train TR9925 leaving at 7:21 ad arriving at 8:10 and the cost is 10:24 pounds. Would you like reservations?
PMUL1302.json	8	Yes please. Also I am looking for a concerthall in the east. If there are none available, how about a boat attraction.
PMUL1302.json	9	I found one boat attraction. Camboats located at the plough, green end, fen ditton.
PMUL1302.json	10	I think that is all I need. Thank you.
PMUL1302.json	11	Have a great time.
SSNG0274.json	0	I need a place to stay that has free wifi please.
SSNG0274.json	1	There are 32 available hotels with free wifi, do you have any other requirements?
SSNG0274.json	2	Do you have a one in the centre that is a 3 star?
SSNG0274.json	3	The Gonville Hotel meets this criteria. Would you like me to make a reservation?
SSNG0274.json	4	Is it a guesthouse?
SSNG0274.json	5	No it is not. There aren't any three star guesthouses in the centre of town. Would you be open to a different star rating?
SSNG0274.json	6	Are there any guesthouses in the west?
SSNG0274.json	7	hobsons house is in the West.Would you like me to book it for you ?
SNG0047.json	0	I need a Taxi, I want it to go to carolina bed and breakfast, arriving for my reservation at 4:00.
SNG0047.json	1	No problem! Where are you departing from?
SNG0047.json	2	from Charlie chan
SNG0047.json	3	ok its a yellow ford and the contact number is 07048042435
SNG0047.json	4	Ok got it, thank you very much
SNG0047.json	5	Is there anything else I can help you with today?
SNG0047.json	6	nope that's everything, thanks.
SNG0047.json	7	awesome, have an awesome day you awesome person
SNG0047.json	8	You have a great day too!
SNG0047.json	9	Thank you for using Cambridge TownInfo centre. Goodbye.
PMUL2732.json	0	There is a place I want to see, can you help me?
PMUL2732.json	1	I certainly hope so! We have a lot of interesting places to see in Cambridge. Is there something specific you're looking for?
PMUL2732.json	2	I am looking for a attraction called cineworld cinema.
PMUL2732.json	3	It's located in southern Cambridge at cambridge leisure park, clifton way. It's phone number is 00872208000. Do you need anything else?
PMUL2732.json	4	Yes, can you help me find a place to eat?
PMUL2732.json	5	What type of food would you like?
PMUL2732.json	6	Actually never mind. I would actually like just find a place to stay in the cheap price range in the west.
PMUL2732.json	7	Sure, I can help you with that. Was there a particular type of cuisine you were interested in?
PMUL2732.json	8	The hotel I'm looking for should have a star of 4, in the cheap range, somewhere in the West. It'll be for 3 people and 4 nights starting Wednesday.
PMUL2732.json	9	Okay. We have you booked at the Cambridge Belfry. The reference number is Y8Y2HVXE .
PMUL2732.json	10	thanks alot and is there parking for two cars?
PMUL2732.json	11	I'm afraid I can only see that they have parking available. If you need to park two cars, I would phone them on 01954714600. Can I help with anything else?
PMUL2732.json	12	Thank you, that is all I need.
PMUL2732.json	13	Fantastic, enjoy your trip!
PMUL3501.json	0	Hi, I could use some help with information on places to stay.
PMUL3501.json	1	Yes, I can help with that. What area would you like to stay in and what is your price range?
PMUL3501.json	2	The price range is on the expensive side and I would like if they provide free wifi and parking. I want the hotel to be located on the north side.
PMUL3501.json	3	We don't have any hotels that fit your criteria. Would you like to search for something a little different instead?
PMUL3501.json	4	Yes, I would like to find a hotel in the south.
PMUL3501.json	5	The Lensfield Hotel at 53-57 lensfield road is a fabulous 3 star hotel that offers internet and parking. Would you like me to book you a room there?
PMUL3501.json	6	That sounds perfect. I need it for 3 nights and 7 people will be staying starting Monday.
PMUL3501.json	7	Okay, the booking was successful. The reference number is FGOM35JV .
PMUL3501.json	8	Thanks. I am also looking for a train to Broxbourne from Cambridge.
PMUL3501.json	9	When will you be traveling?
PMUL3501.json	10	I am leaving on Thursday.
PMUL3501.json	11	Did you have a specific departure or arrival time in mind?
PMUL1561.json	0	I am looking for a hotel with a star of four with free wifi.
PMUL1561.json	1	We have 21 hotels and guesthouses that match those requirements. Do location or price matter?
PMUL1561.json	2	I would like a guesthouse. Location and price aren't important.
PMUL1561.json	3	Okay. I would recommend the A and B Guest House on the east side of town.
PMUL1561.json	4	Ok, please book for 4 nights beginning thursday for 2 people. Thank you.
PMUL1561.json	5	What day will you be checking in?
PMUL1561.json	6	Oh before you book, please advise on whether they have free parking or not.
PMUL1561.json	7	They do not have free parking but they do have free internet.
PMUL1561.json	8	Well that does not work,can I get the phone number anyway?
PMUL1561.json	9	their phone number is 01223315702. is that all?
PMUL1561.json	10	and what area is it in?
PMUL1561.json	11	It is in the east. Is there anything else you need?
PMUL1561.json	12	Yes. I need a train leaving anytime after 17:45 in cambridge and going to stevenage on monday. 2 tickets and the ref would be great
PMUL1561.json	13	Booking was successful, the total fee is 25.6 GBP payable at the station . Reference number is : D4AK1SN3 .
PMUL1561.json	14	Ok, thank you. This is all the information I need right now.
PMUL1561.json	15	I hope we were able to help you today.
PMUL3055.json	0	Would you help me book a train for Thursday, please?
PMUL3055.json	1	Yes, where would you like to go to?
PMUL3055.json	2	I would like to go to Cambridge
PMUL3055.json	3	There are over 200 trains going to Cambridge on Thursday. Where will you be departing from?
PMUL3055.json	4	I will be leaving from Kings Lynn.
PMUL3055.json	5	That narrows us down to about 19 trains. Do you have a time you would like to leave after or arrive by?
PMUL3055.json	6	I would like to leave after 15:45.
PMUL3055.json	7	Then in that case, I recommend the TR0209 which departs from Kings Lynn at 16:11 and gets into Cambridge at 16:58. Would you like me to book it for you?
PMUL3055.json	8	Yes, please. I am also looking for a place to stay, ideally a hotel with a 4 star rating in the moderate price range.
PMUL3055.json	9	There is nothing in the price range you mentioned. Would you be willing to stay at a cheap hotel or an expensive hotel?
PMUL3055.json	10	I would like a cheaper hotel.
PMUL3055.json	11	Ok I Am going to book a cheaper hotel for you ,have a good day,thank you.
PMUL3055.json	12	Can I get the reference number for that booking?
PMUL3055.json	13	Your booking was successful. Your reference number is Z3NAOPSY .
PMUL3055.json	14	Is that for 2 people? And I need it for 5 nights starting thursday.
PMUL3055.json	15	I'm sorry, let's get your hotel choice fixed first. There is one cheap hotel - The Cambridge Belfry. It has free internet and parking. Can I book this one for you?
PMUL3055.json	16	I prefer a moderate price one.
PMUL3055.json	17	Is there an area you'd prefer to stay in?
PMUL3055.json	18	In the east. With free wifi, please.
PMUL3055.json	19	Do you need free parking?
PMUL3055.json	20	No free parking is not necessary.
PMUL3055.json	21	I found 3 guesthouses matching that criteria, I would recommend the Carolina Bed and Breakfast. Located in the east, 4 stars, and has free wifi. Will this one work?
PMUL3055.json	22	Yes, book that one please.
PMUL3055.json	23	Your room is reserved, ref# UCVH6QPU . Is there anything else I can help you with today?
PMUL3055.json	24	Not that's it. Thank you so much!
PMUL3055.json	25	Ok. Thank you for choosing Cambridge Towninfo Centre. We hope you enjoy your stay.
SNG02163.json	0	I need information on Addenbrookes Hospital please.
SNG02163.json	1	Which information were you needing?
SNG02163.json	2	Can you provide the phone number for me?
SNG02163.json	3	The phone number for the hospital is 01223245151.
SNG02163.json	4	Can I also get the address? Thanks!
SNG02163.json	5	The hospital is located at Hills Rd, Cambridge, Postcode: CB20QQ. Do you need further assistance?
SNG02163.json	6	NO, that's all. Thanks, good bye.
SNG02163.json	7	You are quite welcome. Have a nice day.
SNG1229.json	0	I am looking for the price range of the hotel Finches bed and breakfast.
SNG1229.json	1	It is listed in the cheap price range.
SNG1229.json	2	Thank you. That's all I needed.
SNG1229.json	3	Would you like me to book you in?
SNG1229.json	4	No thanks, that'll be it for today.
SNG1229.json	5	Have a wonderful day, goodbye.
WOZ20541.json	0	Can you help me find a Russian restaurant?
WOZ20541.json	1	I'm sorry, there are Russian restaurants. Do you have a secondary choice?
WOZ20541.json	2	Yes, what about European type food?
WOZ20541.json	3	Please wait a moment while I check for European restaurants for you
WOZ20541.json	4	If you find a European restaurant, I would also like the address and phone number.
WOZ20541.json	5	Cambridge lodge restaurant serves european food, their phone number is 01223 355166 and address is Cambridge Lodge Hotel 139 Huntingdon Road City Centre
WOZ20541.json	6	Thank you. Good bye.
WOZ20541.json	7	thank you good bye
SNG0138.json	0	I was in a car accident dispute and need help regarding it
SNG0138.json	1	The Parkside Police Station will be able to assist you with this. Their number is 01223358966. Can I help you with anything else?
SNG0138.json	2	The phone number is what I was looking for. Thanks!
SNG0138.json	3	Sure. You can reach them at 01223358966. Can I be of further assistance?
SNG0138.json	4	That is it. Thank you.
SNG0138.json	5	I'm sorry to hear of your troubles, and I hope your day gets better!
WOZ20471.json	0	What kind of restaurants are on the east side of town?
WOZ20471.json	1	There are British, Indian, Italian, International, and Chinese restaurant. Plus a gastropub.
WOZ20471.json	2	I would like an Indian restaurant.
WOZ20471.json	3	Curry Prince is located in the east area and serves indian food.
WOZ20471.json	4	What is the address and phone number?
WOZ20471.json	5	Their address is 451 Newmarket Road Fen Ditton and phone 01223 566388.
WOZ20471.json	6	Thank you goodbye.
WOZ20471.json	7	Glad to be of service. Goodbye.
PMUL2528.json	0	Can you direct me to hotel in the west end? Ideally one with free parking?
PMUL2528.json	1	We have two guesthouses and two hotels on the west end offering free parking.
PMUL2528.json	2	I need a guesthouse that also has free wifi.
PMUL2528.json	3	I have finches bed and breakfast or hobsons house. Would you like to make a booking?
PMUL2528.json	4	Yes, 5 people 2 nights from Monday.
PMUL2528.json	5	The booking was successful. Your reference number is BUUMAP41 . Can I help you with anything else today?
PMUL2528.json	6	No that's it'. I really appreciate your help!
PMUL2528.json	7	Have an excellent stay!
MUL0585.json	0	I am looking for places to on the south side of town.
MUL0585.json	1	Alright. What type of places? Cambridge has a wide array of things to do and places to go such as, museum's, nightclubs, parks and restaurants.
MUL0585.json	2	I would like to visit a park. Could you find one and give me the address and postcode?
MUL0585.json	3	Sheep's Green and Lammas Land Park Fen Causeway is located at Fen Causeway, Newnham road, postal code cb322ad.
MUL0585.json	4	Thanks! I'm also looking for a train from Cambridge to Kings Lynn.
MUL0585.json	5	Do you have a day you would like to travel?
MUL0585.json	6	I would like to leave on Saturday after 18:45.
MUL0585.json	7	The earliest train is TR7604. It arrives at 19:58. Would you like me to book a ticket?
MUL0585.json	8	Yes, please book 1 ticket. May I have the reference number?
MUL0585.json	9	I have booked your train. The reference number is JI5O0VTT . The fee is 7.84 GBP payable at the station.
MUL0585.json	10	That's all I need. Thank your for your help.
MUL0585.json	11	I'm happy I was able to help you today. Call the Cambridge TownInfo centre whenever you like!
MUL0585.json	12	I'll be sure to so that, bye.
MUL0585.json	13	Thank you for using our system.
SNG01897.json	0	Yes, can I get a taxi? I want to leave Lock Fyne and go to King's College.
SNG01897.json	1	Can you let me know when you want to leave or when you want to arrive?
SNG01897.json	2	I need to arrive by 22:00.
SNG01897.json	3	Booking completed! Booked car type : white ford Contact number : 07570319007
SNG01897.json	4	Thank you. That was easy enough. Goodbye.
SNG01897.json	5	Can I help you with anything else?
WOZ20422.json	0	I'm looking for a steakhouse restaurant in the east part of town.
WOZ20422.json	1	What price range would you like?
WOZ20422.json	2	Any price range will be fine.
WOZ20422.json	3	I have no steakhouse in the east area, but The River Bar Steakhouse and Grill is located in the centre area.
WOZ20422.json	4	I really need something in the east part of town. How about Indian food?
WOZ20422.json	5	Curry Prince is a moderately priced restaurant in the east of town that serves Indian food.
WOZ20422.json	6	Sounds great, what is their address and phone number?
WOZ20422.json	7	Curry Prince is located at 451 Newmarket Road Fen Ditton; their phone number is 01223566388.
WOZ20422.json	8	Thank you, goodbye.
WOZ20422.json	9	Thank you, goodbye.
PMUL4838.json	0	What can you tell me about the bangkok city restaurant?
PMUL4838.json	1	sure, their phone number is 01223354382. anything else today?
PMUL4838.json	2	Can you book a table there for me? There will be 6 of us at 16:45 on Saturday.
PMUL4838.json	3	I sure can! Your booking was successful. The table will be reserved for 15 minutes.Reference number is : QOQA5GZZ . Is their anything else I can help you with?
PMUL4838.json	4	Yes, I'm looking for a hotel in the centre of town.
PMUL4838.json	5	There are five in the centre of town. Do you need parking or wifi?
PMUL4838.json	6	I not need internet. I have no preference on parking.
PMUL4838.json	7	I just need to know what your price range is and how many stars you need?
PMUL4838.json	8	I would like a 0 star hotel.
PMUL4838.json	9	You might want to try CityRoomz.
PMUL4838.json	10	Can you book it for 6 people. We will need it for 4 days starting on Saturday. I also need a reference number. Thanks
PMUL4838.json	11	I have booked a room for Saturday at the cityroomz hotel. Your reference number is 4AXQUT6U . Is there anything else I can help you with?
PMUL4838.json	12	That is all for now. Thank you for the help.
PMUL4838.json	13	You're welcome and enjoy your stay.
SSNG0300.json	0	I dont want wifi, just somewhere with four stars.
SSNG0300.json	1	All of the 4 star hotels I have listed have wifi. Is that okay or would you like me to look for a hotel with a different star rating?
SSNG0300.json	2	I guess it's OK if they have it, as long as they won't charge me for not using it. But 4-star accommodations are a must.
SSNG0300.json	3	I have two 4-star hotels on the west side and one in city centre. Do you have a location preference?
SSNG0300.json	4	Are there any in the South side of the city?
SSNG0300.json	5	I have nothing in the south that matched your criteria, only west and centre.
SSNG0300.json	6	How about a place in any area with free wifi.
SSNG0300.json	7	Okay I have the Cambridge Belfry which is a 4 star cheap hotel in the west part of the city. Would you like for me to book it for you?
SSNG0300.json	8	Yes, please.
SSNG0300.json	9	For how many nights and how many people will be staying?
SSNG0300.json	10	I need it for 7 people for 4 nights staring from Tuesday please.
SSNG0300.json	11	I was unable to book that, would you like me to try something else?
SSNG0300.json	12	Yes please and in the same price range.
SSNG0300.json	13	Okay I was able to book you into the Marriott Hotel and your reference number is CQE0WWXH .
SSNG0300.json	14	Thank you so much for your help.
SSNG0300.json	15	Will you be needing anything else today?
SSNG0300.json	16	Nope. You have been so helpful. Thank you!
SSNG0300.json	17	Thank you for using our system!
PMUL2698.json	0	i am looking for a place to stay. it should be a 4 star and expensive
PMUL2698.json	1	There are 2 4 star hotels in the area. Huntington Marriott Hotel in the west and University Arms Hotel in the centre.
PMUL2698.json	2	I was hoping for something in the east with free wifi.
PMUL2698.json	3	There are no hotels meeting these requirements.
PMUL2698.json	4	Okay, can you check for one that falls in the cheap price range instead?
PMUL2698.json	5	I have 3 guesthouses in the cheap price range, allenbell, autumn house and leverton house. Would you be interested in one of these?
PMUL2698.json	6	Sure, I would like Autumn House and I need to book it for 8 people, 5 nights, and the stay starting on Wednesday please.
PMUL2698.json	7	Okay your booking was successful! Your reference number is KDFTBEWW . Can I help you with anything else?
PMUL2698.json	8	Yes, i am looking for places to visit near my hotel. Any recommendations?
PMUL2698.json	9	If you like museums, then I recommend cambridge artworks. It is free to enter.
PMUL2698.json	10	Great, can you please provide the address.
PMUL2698.json	11	The address is 5 greens road. Is there anything else I can help you with?
PMUL2698.json	12	That is all I need today, thank you.
PMUL2698.json	13	Have a wonderful time.
PMUL2698.json	14	Thank You. Goodbye!
PMUL2698.json	15	Glad we could help, have a great day!
MUL1391.json	0	I'm looking for an expensive British restaurant.
MUL1391.json	1	There are quite a few British restaurants. What area of the city would you like to dine in?
MUL1391.json	2	I would like something in the west, if possible.
MUL1391.json	3	Of course, the Travellers Rest is in the west at Huntingdon Road City Centre. Would you like me to make a reservation?
MUL1391.json	4	Yes, please. I need a table for 3 at 18:30 on Tuesday.
MUL1391.json	5	Your booking was successful. The table will be reserved for 15 minutes and your reference number is S1NJ8GAC .
MUL1391.json	6	I also need a place to stay, the hotel should also be the west area.
MUL1391.json	7	What price range do you prefer?
MUL1391.json	8	Moderately priced if possible.
MUL1391.json	9	The only moderately priced place in the west is Hobsons House guesthouse.
MUL1391.json	10	That sounds good, can you book me for that?
MUL1391.json	11	sure, what day do you want to start your stay, and how many days do you wish to stay?
MUL1391.json	12	For 3 people and for 2 nights, starting on Tuesday.
MUL1391.json	13	I'm sorry, they don't have the availability. Would you like me to try a different day or a shorter stay?
MUL1391.json	14	I could also look up a different part of town if you like?
MUL1391.json	15	I'm sorry, I tried several other moderately priced hotels in other areas and none of them could accommodate you. Would you be able to travel on another day?
MUL1391.json	16	How about an expensive one instead?
MUL1391.json	17	How about the Huntingdon Marriott Hotel?
MUL1391.json	18	That sounds like a nice hotel. Is that located in the west? If it is, I would want to book a room there.
MUL1391.json	19	Yes, it is indeed in the west.
MUL1391.json	20	I need to book it for the same groups, same day as we eat out.
MUL1391.json	21	Okay, great. Your reservation is booked! The reference number is S1NJ8GAC .
MUL1391.json	22	Great. Thank you very much.
MUL1391.json	23	May I help you with anything else for your stay?
MUL1391.json	24	No thank you, you were fantastic! Thank you for all the help.
MUL1391.json	25	You are very welcome! I hope you have a wonderful trip!
SNG1082.json	0	I want to go visit a college in the east part of town please.
SNG1082.json	1	I was unable to find any colleges in the east part of town.
SNG1082.json	2	Okay, what about an attraction that is in the type of entertainment?
SNG1082.json	3	Yes, I recommend the Funky Fun House. With a name like that, how can you go wrong?
SNG1082.json	4	Sounds awesome! Is there an entrance fee?
SNG1082.json	5	Unfortunately I don't have any information about the entrance fee. Is there any other information you need to know?
SNG1082.json	6	Sure, just the address and phone number will be fine.
SNG1082.json	7	Alright, here you are, the address is 8 mercers row, mercers row industrial estate and the phone number is 01223304705. Can I find any other information for you?
SNG1082.json	8	No, that is all I need. Thanks and bye.
SNG1082.json	9	Thank You. Have a nice day, goodbye.
PMUL3307.json	0	Hi, I'm looking for information on a restaurant called efes. What type of food do they serve and will I need reservations?
PMUL3307.json	1	Efes serves turkish food and is located at king street city centre. I can book a reservation for you if you would like.
PMUL3307.json	2	Yes, please. I will need a table for 4 at 18:30 on Saturday. Thank you.
PMUL3307.json	3	Alright, I have made your reservation. The reference number is ID46B4KQ .
PMUL3307.json	4	Can you also help me with places to go in the west of town? I'm looking for entertainment.
PMUL3307.json	5	Whale of a Time is in the west. Does that sound good?
PMUL3307.json	6	That sounds great. Can you tell me their postcode, address, and phone number?
PMUL3307.json	7	Sure, it is located at unit 8, viking way, bar hill. Postcode cb238el, and phone number 01954781018. Is there anything else I can help you with?
PMUL3307.json	8	I want a taxi to take me from the attraction to my restaurant in time for my reservation. Tell me the car type and contact number for the taxi too.
PMUL3307.json	9	A black tesla will arrive. Reach them at 07424011188. Is that everything for today?
PMUL3307.json	10	That is all for today. Thank you for your time.
PMUL3307.json	11	You are very welcome. Have a nice day.
SNG0487.json	0	I am looking for a cheap restaurant in the centre of town.
SNG0487.json	1	There are several options available in the town centre. Is there a particular cuisine that you would prefer? Asian, chinese, indian, italian, mediterranean, modern european, portuguese, or spanish?
SNG0487.json	2	I want a restaurant that serves molecular gastronomy food.
SNG0487.json	3	Unfortunately, I don't happen to have a listing that matches your request. Would you like me to try a different price range or cuisine style?
SNG0487.json	4	Are there any Chinese restaurants?
SNG0487.json	5	Yes, there are 3 Chinese restaurants that are in the cheap price range. I would recommend the Golden House. Would you like for me to book you a table?
SNG0487.json	6	Yes, please book it for around 20:00 for 3 people
SNG0487.json	7	What day would you like to book?
SNG0487.json	8	Actually, scratch that, I don't want to book the restaurant. Could you give me the phone number for the Golden House?
SNG0487.json	9	Their phone number is 01842753771. Is there anything else I can help you with?
SNG0487.json	10	Can you give me the address and postcode as well?
SNG0487.json	11	The Golden House is located at 12 Lensfield Road City Centre. Their postcode is cb21eg. Can I help you with anything else?
SNG0487.json	12	No, that's it. Thanks a bunch.
SNG0487.json	13	You're welcome. Enjoy your meal!
PMUL0011.json	0	I am looking for a place to dine in the Centre. Can you help me?
PMUL0011.json	1	Yes I can. Is there a type of food that you are looking for?
PMUL0011.json	2	Light bites, please.
PMUL0011.json	3	Sorry there are no matches do you want me to look for any other type of cuisine?
PMUL0011.json	4	check for portuguese food.
PMUL0011.json	5	Nandos City Centre is a Portuguese Cuisine in the town Centre. Would you like to make a reservation?
PMUL0011.json	6	No reservation but can I get the price range, the post code and the address?
PMUL0011.json	7	Absolutely! The price range is cheap. It's postcode is cb23ar. And the address is 33-34 Saint Andrews Street. Can I help you with anything else?
PMUL0011.json	8	Yes, I am also looking for a 4 star hotel.
PMUL0011.json	9	What area of the city would you like the hotel to be in?
PMUL0011.json	10	i would like it near the centre.
PMUL0011.json	11	I have one guesthouse and one hotel that would work. What price range did you want?
PMUL0011.json	12	Let's go for the guesthouse please
PMUL0011.json	13	Alexander Bed and Breakfast is the guesthouse. Would you like me to book it for you?
PMUL0011.json	14	Can you tell me if it has free parking?
PMUL0011.json	15	Yes it has free parking and free wifi.
PMUL0011.json	16	Please give me their price range and postcode.
PMUL0011.json	17	Cheap price range and postcode is cb12e
PMUL3670.json	0	I need to find out if there's a train going to stansted airport that leaves after 12:30.
PMUL3670.json	1	We have a train leaving on Friday by 12:40 from Cambridge to Stansted airport but we need to know your departure point and date of departure to serve you better
PMUL3670.json	2	Yes I will be leaving on Tuesday.
PMUL3670.json	3	When would you like to arrive by?
PMUL3670.json	4	Tuesday would be ideal for me.
PMUL3670.json	5	The best fit for you from the search list is the 12:40 train leaving cambridge on Tuesday to arrive stansted airport by 13:03.
PMUL3670.json	6	That works, may I please have the reference number?
PMUL3670.json	7	Actually, it will arrive by 13:08. Does that work for you?
PMUL3670.json	8	Yes. I need it for 8 people.
PMUL3670.json	9	Booking was successful. Your reference number is 2QS7T2UC . Do you need anything else?
PMUL3670.json	10	Great I also need to stay at the University Arms Hotel
PMUL3670.json	11	Okay I can help with that! What day would you like to check in and how long will you be staying?
SNG02190.json	0	Someone just robbed me! I need some help urgently please!
SNG02190.json	1	Cambridge, parkside police telephone number 01223358966.
SNG02190.json	2	What is the address for the parkside police?
SNG02190.json	3	The only address I have for them is Parkside, Cambridge.
SNG02190.json	4	Thank you for your help.
SNG02190.json	5	You are more than welcome!
SNG02113.json	0	Please connect me to the Parkside Police Station.
SNG02113.json	1	The number to the local police station is 01223358966.
SNG02113.json	2	Thank you for the information.
SNG02113.json	3	Happy to be of help.
SNG1117.json	0	I'd like to visit a college in the center of town. Could you help me find something interesting?
SNG1117.json	1	How about Downing College? It has free admission and is located on Regent Street/
SNG1117.json	2	That sounds great! Can I have their phone number and postcode, please?
SNG1117.json	3	Downing College's phone is 01223334860 and their postcode is cb21dq. Can I help you with anything else today?
SNG1117.json	4	No, that was all I needed to know. Thank you, you've been very helpful.
SNG1117.json	5	You're welcome, enjoy your day.
PMUL3045.json	0	I'm looking for information on a hotel called the lensfield hotel.
PMUL3045.json	1	The Lensfield Hotel is a 3 star hotel in the south area. It offers internet and parking. Contact them at 01223355017. Thank you and have a great day!
PMUL3045.json	2	Ummm...can you book that for me? Or do I have to call the hotel myself?
PMUL3045.json	3	I can definitely do that for you - when would you like to arrive?
PMUL3045.json	4	I need to stay for 5 nights. We'll be arriving on Monday.
PMUL3045.json	5	how long is your stay? I am only showing the lensfield hotel, it has 3 stars and free internet and parking
PMUL3045.json	6	Lensfield sounds perfect. I will need 5 nights please.
PMUL3045.json	7	And how many people will be staying?
PMUL3045.json	8	3 for 5 nights starting wednesday, and I need the reference # then too please
PMUL3045.json	9	your all set reference # is N970M2RY. Something else I can help you with?
PMUL3045.json	10	I need a cab by 12:30 too the contact # and car type will be most helpful
PMUL3045.json	11	Is it Monday then? I want to make sure this is correct. (roles are reversed)
PMUL3045.json	12	Yes it is Monday, sorry for any confusion
PMUL3045.json	13	anything else I can assist you with today?
PMUL3045.json	14	still need a cab by my booked time, 12:30 please
PMUL3045.json	15	I need to know where you are traveling to
PMUL3045.json	16	the hotel to the restaurant please
PMUL3045.json	17	I am sorry we didn't reserve a table for you at any restaurant, would you like to do that now?
PMUL3045.json	18	yes, expensive french food for 3 people at 12:30 on monday
PMUL3045.json	19	Sure, just need one more piece of info to complete your taxi booking. Which restaurant will the taxi be taking you to?
PMUL3045.json	20	I need to make a reservation! An expensive french restaurant 3 people on monday at 12:30, I should have just called myself
PMUL3045.json	21	I reserved a table at cote for you, ref # is ZLK6W3CY .
PMUL3045.json	22	The roles are reversed- I need a cab now
PMUL3045.json	23	I STILL NEED THAT CAB!
PMUL3045.json	24	Thank you that is all I need
PMUL3045.json	25	Thank you and enjoy your stay !
SNG0169.json	0	I got injured and need directions for the clinical decisions unit department
SNG0169.json	1	Oh dear, I'm sorry to hear that! The Clinical Decisions Department only lists their phone number with us, it's 01223596203. However, we can book an appointment for you.
SNG0169.json	2	I need the post code.
SNG0169.json	3	The hospital postcode is CB20QQ. Would you like us to go ahead and book an appointment?
SNG0169.json	4	No, that's all I need.
SNG0169.json	5	OK. Hope all goes well for you. Bye.
PMUL2312.json	0	I would like to go to a nightclub in the centre.
PMUL2312.json	1	You have five options for nightclubs in the center. Soul Tree Nightclub has the lowest entry fee, at 4 pounds.
PMUL2312.json	2	What is the postcode for Soul Tree Nightclub?
PMUL2312.json	3	The post code is cb23qf. Is there anything else I can help you with?
PMUL2312.json	4	Yes. Are there any North Indian restaurants close to the nightclub?
PMUL2312.json	5	What's your price range?
PMUL2312.json	6	I would like something cheap.
PMUL2312.json	7	There are no North Indian restaurants but there are some Indian restaurants in the centre of town. Would you like information about one of those?
PMUL2312.json	8	Actually, can you check for a Chinese restaurant in the north then?
PMUL2312.json	9	I'm sorry I may have misunderstood. Were you looking for cheap Indian food on the north side of town?
PMUL2312.json	10	I was, but since there's no cheap Indian food in the north I want to see if there's any cheap Chinese in the north.
PMUL2312.json	11	There's no cheap Chinese food in the north. Would you like me try something else?
PMUL2312.json	12	are there any chinese restaurants that are cheap in the north?
PMUL2312.json	13	Unfortunately, there are none. Could you like to try an alternative type of food?
PMUL2312.json	14	No, i didn't have any other choices.
PMUL2312.json	15	perhaps we try a different location?
PMUL2312.json	16	Do you have any cheap chinese restaurants in the centre?
PMUL2312.json	17	Yes, we have 3. I recommend Golden House.
PMUL2312.json	18	Great, can I just get the postcode?
PMUL2312.json	19	Yes, the postcode is cb21eg. Can i assist you further, today?
PMUL2312.json	20	No, that's all I need today. Thank you.
PMUL2312.json	21	You're welcome. Enjoy your trip! Goodbye
MUL2132.json	0	Hello. I would like some information about the Aylesbray lodge guest house.
MUL2132.json	1	Ok. Aylesbray lodge is in the south part of town, moderately priced, and has a 4 star rating. Are you interested in booking a room?
MUL2132.json	2	Yes I'd like to book it for 4 people for 5 nights starting Monday. Would that be possible?
MUL2132.json	3	Unfortunately the booking was unsuccessful
MUL2132.json	4	Thats awful,is there any other options for the criteria that I need?
MUL2132.json	5	The only criteria you gave me is the name of the hotel. Are you sure you don't want to book a different day or make a shorter stay?
MUL2132.json	6	How about 2 nights?
MUL2132.json	7	Yes, I was able to book you at The Aylesbray Lodge for 2 days. Your Reference number is J9AMLIVL . Is there anything I can assist you with?
MUL2132.json	8	Thanks. I also need a train from Kings Lynn on that day, leaving after 21:45.
MUL2132.json	9	I have a train that leaves monday at 22:11 arriving in cambridge at 22:58. Would you like me to book that for you?
MUL2132.json	10	Great! What is the price and train ID?
MUL2132.json	11	The train ID is TR2215 and the ticket price is 9.80 pounds.
MUL2132.json	12	Thank you so much. That is all the help I need today. I appreciate your time.
MUL2132.json	13	Have a wonderful trip! Goodbye
SNG02042.json	0	I'm looking for a train departing from broxbourne.
SNG02042.json	1	Where are you headed?
SNG02042.json	2	I am heading to Cambridge.
SNG02042.json	3	How about TR5570 that leaves at 05:32?
SNG02042.json	4	I will need to arrive by 17:15.
SNG02042.json	5	What day will you be travelling?
SNG02042.json	6	I will be leaving on Wednesday.
SNG02042.json	7	How about the TR0788 train that leaves at 05:32?
SNG02042.json	8	Does that train arrive in Cambridge before 17:15?
SNG02042.json	9	TR0788 arrives in cambridge by 06:32. Would you like me to find something closer to arriving at 17:15?
SNG02042.json	10	Yes, and I'll just need the train id and departure time.
SNG02042.json	11	TR5972 leaves Broxbourne Wednesday at 15:32 and arrives in Cambridge at 16:32, The fare is 17 pounds 90.
SNG02042.json	12	Okay. Would you please book 2 tickets for that one?
SNG02042.json	13	Booking was successful, the total fee is 35.79 GBP payable at the station . Reference number is : G2JZA2ZE .
SNG02042.json	14	I can't imagine why I asked you to book passage. I always buy my own tickets. In any case, thanks ever so much.
SNG02042.json	15	Is there anything else I can help you with today?
SNG02042.json	16	no thanks for your service i enjoyed
SNG02042.json	17	Have a great day.
SNG1370.json	0	i want to book a taxi. The taxi should leave after 21:15 and should depart from backstreet bistro.
SNG1370.json	1	Where is the destination?
SNG1370.json	2	I want to go to the cambridge punter.
SNG1370.json	3	Your booking is completed. A yellow Toyota will pick you up at 21:15. The contact number is 07441929231. Can I help you with anything else today?
SNG1370.json	4	thats is it for today, thanks
SNG1370.json	5	It was a pleasure to assist, goodbye
SSNG0004.json	0	What's available in the centre, in the way of cheap places to eat?
SSNG0004.json	1	I'm showing 15 cheap restaurants in the area. Do you a preference for a type of food?
SSNG0004.json	2	No preference. Would you recommend a restaurant for me?
SSNG0004.json	3	How about the Dojo Noodle Bar? It serves Asian Oriental food.
SSNG0004.json	4	I think that sounds good. Can you go ahead and book that for me? I need it for 1 person on Wednesday at 14:00. Can I also get that reference number?
SSNG0004.json	5	There is the dojo noodle bar in the centre. Would you like me to book a reservation there.
SSNG0004.json	6	Great yes please do, can I get the reference number for that?
SSNG0004.json	7	I'm sorry, I wasn't able to get a table. Would you like me to try J Restaurant, with similar cuisine? Or maybe somewhere else?
SSNG0004.json	8	Yes try to book it there and give me the reference number also.
SSNG0004.json	9	I was able to book you at J Restaurant. The reference number is 1PWMNUIK . The table will be reserved for 15 minutes.
SSNG0004.json	10	Thank you for your help. That will be all I need for now. Bye.
SSNG0004.json	11	You are very welcome. Enjoy your day and your meal on Wednesday. Bye.
PMUL0560.json	0	I'm planning my trip in Cambridge and I need a train. It should arrive by 20:15 and leave on Sunday.
PMUL0560.json	1	Okay we've got a long list of matches. Where did you want to depart from?
PMUL0560.json	2	I would like to depart from Cambridge, and I'm headed to Birmingham New Street.
PMUL0560.json	3	There is a 16:40 that will arrive at 19:23. There are also plenty of earlier trains if you would like to arrive much earlier.
PMUL0560.json	4	That sounds great, could you make the reservation for me?
PMUL0560.json	5	How many tickets do you need?
PMUL0560.json	6	i need 15 tickets
PMUL0560.json	7	Booking was successful, the total fee is 901.2 GBP. Reference number is : GLBY9VB9 . Do you need anything else?
PMUL0560.json	8	I need to get the train ID.please.
PMUL0560.json	9	Yes the train ID is TR8297.
PMUL0560.json	10	I also need an expensive place to eat in the centre of town.
PMUL0560.json	11	What type of food would you like?
PMUL0560.json	12	I'm not too picky. Can you recommend anything?
PMUL0560.json	13	Loch Fyne has an excellent selection of seafood. They are expensive. Can I make a reservation for you?
PMUL0560.json	14	Can I have the food type, postcode, and address, please?
PMUL0560.json	15	They have seafood. The post code is cb21qy, and the address is The little rose 37 trumpington street. Do you need me to book it for you?
PMUL0560.json	16	No thank you, that will be all for today.
PMUL0560.json	17	Thank you. Please remember us for your future travel needs.
WOZ20614.json	0	I am looking for a restaurant in the north part of town that is in the cheap price range.
WOZ20614.json	1	Royal Spice is in the north part of town and is in the cheap price range.
WOZ20614.json	2	can i have something else?
WOZ20614.json	3	Da vinci pizzeria serves is in the north part of town and in the cheap price range. Would you like their location?
WOZ20614.json	4	What is the address?
WOZ20614.json	5	their address is 20 Milton Road Chesterton
WOZ20614.json	6	Thank you good bye.
WOZ20614.json	7	You're welcome, goodbye
MUL1882.json	0	I'm looking for a train that leaves from London Liverpool Street on Thursday, is there any information you can give me about something like that?
MUL1882.json	1	Yes. Trains leave from London Liverpool Street every two hours, starting at 05:39. Was there a particular time of day you were interested in?
MUL1882.json	2	I would like to arrive by 11:00 in Cambridge.
MUL1882.json	3	There are three choices. The TR3839 departs London at 05:39 and arrives Cambridge at 07:07. That's the earliest departure. Would you like to book a ticket?
MUL1882.json	4	Yes, for 3 people, please.
MUL1882.json	5	Success! Your 3 seats are reserved and the total will be 49.8 GBP, payable at the station. Your reference number is SQ22G015 . Can I do anything further for you?
MUL1882.json	6	Yes, I'd also like to find a place to go. I was thinking a nightclub would be fun.
MUL1882.json	7	Which area would you like for the nightclub? we have 5 in centre and 1 in south.
MUL1882.json	8	It doesn't matter, what would you recommend?
MUL1882.json	9	In my opinion, the nicest one is Kambar nightclub. It's in the centre of town. Would you like more information on it?
MUL1882.json	10	Sure, can I have the phone number and address?
MUL1882.json	11	Their phone number is 01223842725, and they are located at 1 wheeler street.
MUL1882.json	12	Great! Thanks for your help today!
MUL1882.json	13	You're welcome! Is there anything else I can do for you?
MUL1882.json	14	No, you've covered everything. Goodbye.
MUL1882.json	15	Goodbye! Have a great day!
PMUL0317.json	0	I'm looking for a moderately priced place to stay.
PMUL0317.json	1	There are 33 moderately priced accommodations. Do you have a specific area or star rating you're looking for?
PMUL0317.json	2	I would like to stay in the north part of town.
PMUL0317.json	3	You have eleven choices in the north. Most are guesthouses, two are hotels.
PMUL0317.json	4	Let's go with a 4 star hotel, I'll need 5 nights for 2 people, starting on Friday.
PMUL0317.json	5	Okay. I booked you at the 4 star Ashley Hotel for 5 nights and your reference number is 67NA9WLR .
PMUL0317.json	6	Thank you. I am also looking for a Chinese restaurant with the same price range as my hotel. Can you help me with that?
PMUL0317.json	7	There are 4 moderately priced Chinese restaurants to choose from. Would you prefer to dine in the north or centre?
PMUL0317.json	8	I would prefer it to be in the north.
PMUL0317.json	9	I would recommend golden wok. shall i book it ?
PMUL0317.json	10	Yes, please book friday at 16:00 for 2 people. And tell me the reference number
PMUL0317.json	11	Booking was successful. The table will be reserved for 15 minutes. Reference number is : 093R1Y1T . Is there anything else I can help you with?
PMUL0317.json	12	Yes, I am going to need a taxi to go between the two places. I need it to arrive in time for dinner.
PMUL0317.json	13	A grey Skoda has been booked to pick you up. Their contact number is 07015780256. What else can I do for you?
PMUL0317.json	14	You've done it all, thanks so much.
PMUL0317.json	15	Have a wonderful trip.
SSNG0177.json	0	I'm looking for a restaurant my friend recommended, I think she called it the Curry Prince.
SSNG0177.json	1	Yes, I found what you're looking for. Would you like the address?
SSNG0177.json	2	Sure, and can you book it for Friday at 12:00 for 3 people?
SSNG0177.json	3	The address is 451 Newmarket Road Fen Ditton. Unfortunately, the restaurant is fully booked. Do you have another restaurant or type of food in mind?
SSNG0177.json	4	Something in the same area and price range would work.
SSNG0177.json	5	I have rajmahal which is in the same area and price range. Would you like me to book a table there?
SSNG0177.json	6	Sure thing. I'll need a reference number too.
SSNG0177.json	7	Your booking was successful, the reference number is FYFXWH1Z . Is there anything else I can help you with today?
SSNG0177.json	8	Great. Thank you so much.
SSNG0177.json	9	You are very welcome. Is there anything else I can help you with today?
SSNG0177.json	10	No that will be all for today. Thank you so much for your help.
SSNG0177.json	11	You are welcome. Have a lovely day.
SNG1096.json	0	I am trying to find a really neat museum to visit. Would you be able to tell me whats available out there?
SNG1096.json	1	We have many interesting museums, such as the Cambridge Artworks, Cambridge Museum of Technology, and the Whipple Museum of the History of Science. Anything in particular strike your fancy?
SNG1096.json	2	Are any of them in the centre?
SNG1096.json	3	Actually, I have 11 of them in the centre area. Might I suggest the Broughton House Gallery. It has free entrance and is located at 98 King Street.
SNG1096.json	4	That would be perfect. Can I get the phone number, please?
SNG1096.json	5	Yes. Their phone number is 01223314960. Can I help you with anything else?
SNG1096.json	6	No, not today, thanks. Goodbye.
SNG1096.json	7	Enjoy your visit. Thank you for calling Cambridge TownInfo Centre. Goodbye.
WOZ20237.json	0	What is the address and phone number of a cheap restaurant in the north part of town?
WOZ20237.json	1	da vinci pizzeria can be reached at 01223351707 and is located at 20 milton road chesterton
WOZ20237.json	2	Thank you goodbye
WOZ20237.json	3	enjoy your meal!
SNG1259.json	0	I need a taxi from great saint Mary's church to cocum at 04:15
SNG1259.json	1	Your car is a grey ford, contact number is 07864543066.
SNG1259.json	2	Thank you. That is all i needed.
SNG1259.json	3	You're very welcome. Have a safe ride.
SNG02334.json	0	Where is the nearest hospital?
SNG02334.json	1	The nearest hospital is on Hills Rd in Cambridge. The telephone number is 01223245151, is there anything else I can help with?
SNG02334.json	2	Does it list an address for the hospital?
SNG02334.json	3	It is on Hill Rd. Postcode is CB20QQ.
SNG02334.json	4	Great, thank you for your help. That is all I need.
SNG02334.json	5	You're welcome, is there anything else I can help with?
SNG02334.json	6	No that was all. Thanks
SNG02334.json	7	Thank you for allowing me to help you. Have a great day!
SNG01220.json	0	I've been injured and I need a hospital near me, one with a coronary care unit department please!
SNG01220.json	1	The closest hospital is Addenbrookes Hospital. The phone number for the coronary care unit is 01223217297.
SNG01220.json	2	May I have the full hospital address and their main phone number, please.
SNG01220.json	3	The hospital address is Hills Rd, Cambridge. The main telephone for the hospital is 01223245151
SNG01220.json	4	Thank you. Goodbye.
SNG01220.json	5	Thank you for contacting us and have a nice day.
PMUL1177.json	0	I want a train that leaves on Monday.
PMUL1177.json	1	There are several trains leaving on Monday. May I have your destination?
PMUL1177.json	2	I would like to travel from Norwich to Cambridge. Are there any leaving after 21:00?
PMUL1177.json	3	Yes, I could get you tickets on a train leaving at 21:16. TR8920. Would you like to book passage?
PMUL1177.json	4	Can you tell me what the arrival time is?
PMUL1177.json	5	it should arrive by 22:35
PMUL1177.json	6	Would yopu like me to book it for you ?
PMUL1177.json	7	Well, I can book it for YOU if you would like. Would you like me to?
PMUL1177.json	8	No thanks but could you help me find a good college to visit on the south side of town?
PMUL1177.json	9	I am sorry none of them are in the south. Something else perhaps?
PMUL1177.json	10	How about a theater in the south?
PMUL1177.json	11	I have one. What info would you like to know?
PMUL1177.json	12	why don't you suggest a couple for me please then I will decide what info I need.
PMUL1177.json	13	The junction theatre is the only one that meets your specified critera.
PMUL1177.json	14	Okay, thanks! Can you please tell me the entrance fee, address, and phone number?
PMUL1177.json	15	The address is clifton way, the postcode is cb17gx, but I don't know the entrance fee. Is there anything else you need?
PMUL1177.json	16	No, but thank you for everything, have a nice day
PMUL1177.json	17	Have a great day as well. Goodbye.
PMUL3128.json	0	Can you help me find a restaurant in the centre?
PMUL3128.json	1	The Centre has many choices, 69 to be exact. Do you have any food type or price range in mind?
PMUL3128.json	2	I am looking for a restaurant that serves modern European food.
PMUL3128.json	3	What price range would you like?
PMUL3128.json	4	moderate price range please and thank you that will be all
PMUL3128.json	5	I can suggest the riverside brassiere.
PMUL3128.json	6	Ok sure. I need brassiere
PMUL3128.json	7	Can I make the reservation for you?
PMUL3128.json	8	Yes, a table for one on Wednesday at 20:00.
PMUL3128.json	9	Booking was successful. The table will be reserved for 15 minutes. Reference number is : XT4L7KCY .
PMUL3128.json	10	I will also need a taxi.
PMUL3128.json	11	What time will you be leaving and what time you will like to arrive?
PMUL3128.json	12	I want the taxi to arrive to the restaurant in time for my reservation there
PMUL3128.json	13	Where will you be leaving from?
PMUL3128.json	14	Sorry I need to book a hotel first. Do you have a 3 star with free parking in the same area?
PMUL3128.json	15	The Gonville Hotel is available in that area.
PMUL3128.json	16	Do they have wifi?
PMUL3128.json	17	Yes they have wifi
PMUL3128.json	18	Okay can you tell me the address and price range of the Gonville Hotel?
PMUL3128.json	19	It is an expensive hotel and the address is gonville place.
PMUL3128.json	20	Thanks. Now I can book my taxi from the hotel to the restaurant.
PMUL3128.json	21	Would you like me to reserve the hotel?
PMUL3128.json	22	No reservation, just a taxi from the hotel to the restaurant arriving by 20:00
PMUL3128.json	23	all set for your taxi yellow audi Contact number 07456600776. Any thing else i can do ?
PMUL3128.json	24	Thank you that will be all I need
PMUL3128.json	25	You are welcome enjoy
PMUL4536.json	0	Can you find a hotel named Worth House for me? Thanks.
PMUL4536.json	1	Sure, it is a guesthouse in the north. Would you like me to book a room for you?
PMUL4536.json	2	Can you tell me if they have free internet?
PMUL4536.json	3	Yes, they have free wifi. Do you need anything else?
PMUL4536.json	4	I would also like a train that leaves on Tuesday and arrive by 14:30.
PMUL4536.json	5	There are many trains moving on Tuesday, can I get your preferred point of departure and arrival?
PMUL4536.json	6	I will be going from Cambridge to Bishops Stortford.
PMUL4536.json	7	There are multiple trains leaving that match your request. When is the earliest you would want to leave?
PMUL4536.json	8	I need to arrive by 14:30 I don't have a preference on departing time.
PMUL4536.json	9	TR2771 leaves at 13:29 and arrives at 14:07. Would this one work for you?
MUL0984.json	0	Hi! I am looking to find information about the Cambridge University Botanic gardens.
MUL0984.json	1	Yes they are located at Bateman street and their telephone is 01223336265. The entrance fee is 4 pounds. Is there anything else you would like to know?
MUL0984.json	2	Thank you. What area is that in, and what type of attraction is it?
MUL0984.json	3	The gardens are considered a park and located in the centre.
MUL0984.json	4	Thank you. Do you have any good korean restaurants listed?
MUL0984.json	5	There is one Korean restaurant in the city centre and it is expensive. Would you like me to make you a reservation?
MUL0984.json	6	How about Thai food instead?
MUL0984.json	7	I've got Sala Thong in the west and Bangkok City in the centre, both expensive. Would you like more information, or for me to make a booking?
MUL0984.json	8	Sala Thong will do. I would like to book a table for 2 people at 12:30 on Saturday.
MUL0984.json	9	Your reference number is Q2VLO8SN .
MUL0984.json	10	Thank you. That's all I need for today.
MUL0984.json	11	You are welcome, if you need anything else, please contact us.
PMUL0175.json	0	Greetings, got any British food places in town?
PMUL0175.json	1	Yes what price range would you like?
PMUL0175.json	2	Moderate please.
PMUL0175.json	3	What area would you like to dine in?
PMUL0175.json	4	I would like to eat in the Centre.
PMUL0175.json	5	I recommend the the oak bistro. Would you like me to book you a table?
PMUL0175.json	6	Yes, please. Can you make a reservation for Tuesday for 4 at 15:30?
PMUL0175.json	7	I was able to book it, reference number is WA7QCIIZ
PMUL0175.json	8	Thank you! I'm also looking for a place to stay. I'd like it to be in the same price range and area as the restaurant.
PMUL0175.json	9	The only moderately-priced accommodation in the center is the Cityroomz hotel. Would you like to book a room there?
PMUL0175.json	10	Sounds good. I'd like to book for 2 nights starting tuesday
PMUL0175.json	11	How many people should I book the room for?
PMUL0175.json	12	I would like it booked for 4 people, please.
PMUL0175.json	13	Your room has been booked. Your reference number is 2QE9RSSH .
PMUL0175.json	14	That will be all. I appreciate your time. Have a good day!
PMUL0175.json	15	Thank you for contacting us and have a nice day.
PMUL4394.json	0	Hello I am looking for a train leaving from ely and arriving at cambridge.
PMUL4394.json	1	What day would you like to travel on?
PMUL4394.json	2	Monday leaving after 8:00.
PMUL4394.json	3	Train TR2987 leaves ely at 09:35 and arrives in cambridge at 09:52. Would that work?
PMUL4394.json	4	yes it will, please book for three and get the reference number
PMUL4394.json	5	OK, your 3 seats on TR2987 are reserved, reference #D4K46W8T . Can I help you with anything else today?
PMUL4394.json	6	I am also looking to get some Indian food.
PMUL4394.json	7	Curry Prince is an Indian cuisine on the East side of town and in the moderate price range, would you like to try?
PMUL4394.json	8	No I want somewhere cheap in the centre actually
PMUL4394.json	9	There are three options available to you then. I recommend kohinoor. Do you want a table reserved?
PMUL4394.json	10	Yes. please reserve for 3 people on monday at 11:00 and give me the reference number
PMUL4394.json	11	The table is book and the reference number is TZS9RXI3 .
PMUL4394.json	12	That is all I needed, thank you and good day!
PMUL4394.json	13	Okay, have a wonderful time during your visit!
SNG0914.json	0	Good afternoon, can you help me find an expensive place to stay in the town centre?
SNG0914.json	1	I sure can. I found a 3 star hotel and a 4 star hotel. Do you have a preference?
SNG0914.json	2	It should be a hotel type hotel not a guesthouse
SNG0914.json	3	How about the Gonville Hotel located in the centre of town is in the expensive price range?
SNG0914.json	4	Yes, that sounds good. Could you reserve a room for 5 people checking in on Saturday? I think we'll stay for 3 nights.
SNG0914.json	5	Booking was successful. Reference number is : KRJNYV0Q .
SNG0914.json	6	Great, thank you for your help.
SNG0914.json	7	You are very welcome! Is there anything else I can help you with?
SNG0914.json	8	No, that will be all. Thank you.
SNG0914.json	9	Thank you , good day to you.
MUL1384.json	0	Hello, can you recommend an expensive restaurant in Cambridge?
MUL1384.json	1	We have a lot of them. Any specific location?
MUL1384.json	2	I was hoping to find a place that serves Indian food.
MUL1384.json	3	I have 14 restaurants that serve expensive indian food. Is there area of town you would like?
MUL1384.json	4	I'm looking for a restaurant in the center of town.
MUL1384.json	5	I am unable to find any Indian restaraunts in the the center of town. Can you narrow down your preferred area please?
MUL1384.json	6	An expensive Indian restaurant in the centre, I will require the address and phone number please.
MUL1384.json	7	I'm not getting any results for those specific, do you want to try something else?
MUL1384.json	8	I'm really looking for an Indian restaurant in the expensive price range in the town centre. What can you recommend?
MUL1384.json	9	I would recommend The Curry Garden in the city center.
MUL1384.json	10	I need an address and phone number for the restaurant.
MUL1384.json	11	Their address is 106 Regent Street City Centre and phone is 01223302330. Is there anything else you require?
MUL1384.json	12	I am also looking for a place to stay in the same area and same price range.
MUL1384.json	13	I have two hotel in the Centre, shall I book one?
MUL1384.json	14	Does one not have free internet?
MUL1384.json	15	Both Gonville Hotel and University Arms Hotel have free wifi and are expensive options in the centre of town.
MUL1384.json	16	Can you book me at the Gonville Hotel ? I also need a taxi booked.I need the taxi number and car type.
MUL1384.json	17	Can you please give me the day you are starting your stay, number of days, and the number of people staying?
MUL1384.json	18	My apologies, I actually do not need the hotel booked, but I do need a taxi to commute between the hotel and the restaurant, leaving the hotel at 23:45.
MUL1384.json	19	Okay you're all set for a car. There will be a white Volkswagen taking you from the Gonville to Curry Garden, leaving the hotel at 23:45. Their contact number is 07462048280.
MUL1384.json	20	Okay, thank you so much. Goodbye.
MUL1384.json	21	Goodbye! Have a great day!
PMUL4334.json	0	Can you help me find a 4 star hotel to stay at?
PMUL4334.json	1	Sure, do you prefer the west or the centre part of Cambridge?
PMUL4334.json	2	I don't care about the area but I need it to be cheap with free wifi.
PMUL4334.json	3	The cambridge belfry is available. Would you like me to book you a room?
PMUL4334.json	4	Yes, please. I need four nights starting Sunday, for two people.
PMUL4334.json	5	Done! Your reference number is CU4LPL6C . Do you need help with anything else?
PMUL4334.json	6	I'm also looking for a place to eat in the city centre. maybe bistro food?
PMUL4334.json	7	Sorry there are no restaurants in the centre of town serving bistro food.
PMUL4334.json	8	Okay. What about one that serves seafood instead?
PMUL4334.json	9	loch fyne is an expensive place that serves sea food. can we book?
PMUL4334.json	10	Yes. Let's say 15:00 on the same day, with the same group of people.
PMUL4334.json	11	Okay I have done that and their reference number is H2OPFSBQ .
PMUL4334.json	12	Thanks, lastly, I need a taxi to take me to the restaurant from the hotel, I want to get there before the booked time.
PMUL4334.json	13	Your taxi will be a red audi. Should you need to contact them, the number is 07971260313.
PMUL4334.json	14	Thank you, have a nice day.
PMUL4334.json	15	You're welcome. And thank you, you, too!
SNG01895.json	0	I am looking for the Parkside Police Station
SNG01895.json	1	The telephone for the Parkside police station is 01223358966,
SNG01895.json	2	Thank you Goodbye.
SNG01895.json	3	Have a great day! Bye!
PMUL3404.json	0	I am looking for information in Cambridge.
PMUL3404.json	1	Okay! What would you like to know?
PMUL3404.json	2	I need a train to bishops stortford on Tuesday that can get me there by 19:30.
PMUL3404.json	3	TR2153 arrives closest to that, it can get you there by 18:07, shall I book you?
PMUL3404.json	4	Can I get the price for that?
PMUL3404.json	5	yes that will be 55pounds can I get anything else ?
PMUL3404.json	6	When does the train leave Bishops Stortford, please?
PMUL3404.json	7	That train would leave at 17:29.
PMUL3404.json	8	Okay, thanks. Now could you also help me find a cheap persian restaurant in the centre?
PMUL3404.json	9	There are no such options available. Shall we try a different food type perhaps?
PMUL3404.json	10	How about asian oriental?
PMUL3404.json	11	There are two options, I recommend the dojo noodle bar, shall I book you?
PMUL3404.json	12	Yes book a table for 6 at 16:00 on Tuesday please.
PMUL3404.json	13	Booking was successful. The table will be reserved for 15 minutes.
PMUL3404.json	14	Ummm reference number please.
PMUL3404.json	15	The reference number is 9TUP5ZI2 .
PMUL3404.json	16	Thank you so much. You have been a great help.
PMUL3404.json	17	You're welcome. Did you need anything else?
PMUL3404.json	18	I don't need anything else. Have a great day!
PMUL3404.json	19	Okay, you have a great day as well!
PMUL3090.json	0	I'm looking for an expensive restaurant in the centre
PMUL3090.json	1	sure, i have 33 options for you
PMUL3090.json	2	Great. Is there one that serves mediterranean food?
PMUL3090.json	3	I happen to have 2 great ones. La Mimosa is available, as well as the newer one called Shiraz Restaurant. Would you like more info on one of these?
PMUL3090.json	4	Let's go with Shiraz. I need a booking for 5 at 16:30 on saturday.
PMUL3090.json	5	Your table has been booked for 16:30 and will be reserved for 15 minutes. The reference number is VORP2NWK . What else can I do for you today?
PMUL3090.json	6	I am also looking for a four star hotel.
PMUL3090.json	7	There are three options to choose from. The Huntington Marriott Hotel, The Cambridge Belfry, and the University Arms Hotel. Which would you like?
PMUL3090.json	8	I want it to be a 4 star guesthouse with free parking and internet
PMUL3090.json	9	Which part of time would you like to stay in?
PMUL3090.json	10	Starting Saturday for 4 people for 5 nights.
PMUL3090.json	11	There are actually 16 guesthouses to choose from. Is there an area of the city that you prefer?
PMUL3090.json	12	Maybe the centre near my restaurant.
PMUL3090.json	13	How about alexander bed and breakfast?
PMUL3090.json	14	Is it available on Saturday.
PMUL3090.json	15	Yes. Would you like me to book that for you?
PMUL3090.json	16	Yes. Please book it for 4 people and 5 nights beginning saturday
PMUL3090.json	17	You are booked. The reference number is C9LRRET8
PMUL3090.json	18	Thanks for all the help. That's all I needed today.
PMUL3090.json	19	Thanks for contacting Cambridge TownInfo centre have a wonderful trip. Goodbye.
SSNG0301.json	0	I need a guesthouse please.
SSNG0301.json	1	There are 24 different guesthouses available. Is there a particular area of the city you would like to stay in?
SSNG0301.json	2	I would like to stay in the North area.
SSNG0301.json	3	There are 5 option in the north. Do you have any other preferences to help narrow down your choice?
SSNG0301.json	4	I am actually looking for a 4 star rating in an expensive price range.
SSNG0301.json	5	I have several hotels available with a 4 star rating but none in an expensive price range. Would a moderate range work for you?
SSNG0301.json	6	Is sure would. Can you book a room for 2 people for 2 nights on Monday?
SSNG0301.json	7	I booked for you a room at arbury lodge guesthouse. It has parking slots and free wifi. Do you need anything else?
SSNG0301.json	8	I need a reference number for that booking!
SSNG0301.json	9	Sure, your reference number is B1IP09IZ .
SSNG0301.json	10	Wonderful! Good bye!
SSNG0301.json	11	Glad I could help! Goodbye.
SSNG0008.json	0	Can you find me an expensive restaurant in the centre?
SSNG0008.json	1	There are 33 restaurants that meet that criteria. Are you looking for a certain type of food?
SSNG0008.json	2	I want Chinese food and the restaurant needs to be located in the centre area.
SSNG0008.json	3	There are four expensive chinese restaurants located in the centre. I recommend hk fusion. Would you like me to make you a reservation?
SSNG0008.json	4	Excellent, lets try HK Fusion for 5 people at 19:15 on Friday.
SSNG0008.json	5	I am sorry this booking was unsuccessful. Maybe another time perhaps?
SSNG0008.json	6	Please, try booking anytime between 20:15 to 9:15 on Friday.
SSNG0008.json	7	None of the times are available do you have another restaurant preference?
SSNG0008.json	8	Any other place in the centre, same expensive price range.
SSNG0008.json	9	I was able to book bedouin, reference number is 4ATMIYSC
SSNG0008.json	10	Thanks, that's all I need. Have a nice day.
SSNG0008.json	11	Okay great. I am glad I could be of help.
SNG1077.json	0	Are there any theatres in town?
SNG1077.json	1	There are 5 theatres in town. Do you have a preference for a specific area?
SNG1077.json	2	No, which one do you think is the best?
SNG1077.json	3	I'd recommend the Cambridge Arts Theatre, myself.
SNG1077.json	4	That sounds good. Can I get the address and postcode, please?
SNG1077.json	5	The address is 6 Saint Edward's Passage and the post code is cb23pj. Do you need the phone number as well?
SNG1077.json	6	That won't be necessary. Thanks for the help!
SNG1077.json	7	Have a nice stay in the town, and enjoy the play in the theatre.
SNG1077.json	8	Thank you, good bye.
SNG1077.json	9	Thank, you good bye.
SNG0194.json	0	I'm looking for the Addenbrookes Hospital and need to contact the haematology and haematological oncology department.
SNG0194.json	1	The phone number for Addenrookes Hospital, haematology and haematological oncology department is 01223217312.
SNG0194.json	2	Can you also tell me the postcode for the hospital?
SNG0194.json	3	Yes, the postcode is CB20QQ. Can I get you anything else?
SNG0194.json	4	No, that will be all for today. Thanks so much. Have a good day.
SNG0194.json	5	You too, sir.
PMUL2516.json	0	I'd like to attend an architecture related attraction in the centre, do you have anything of that nature?
PMUL2516.json	1	The all saints church is in the centre of town. Would you like the address?
PMUL2516.json	2	Yes that would be great. Can you also give me the phone number and entrance fee? Thanks
PMUL2516.json	3	the phone number is 01223452587 and admission is free!
PMUL2516.json	4	What is the address?
PMUL2516.json	5	The address is jesus lane.
PMUL2516.json	6	Thanks. I am also looking for an expensive place to stay. I'll need free wifi.
PMUL2516.json	7	Okay, what area would you like to stay in?
PMUL2516.json	8	in the north, please.
PMUL2516.json	9	I'm unable to find any places to stay that match those specifications. Is there anything you'd be willing to change about where you want to stay?
PMUL2516.json	10	how about something in the north?
PMUL2516.json	11	I have nothing in the north. Can I try something else?
PMUL2516.json	12	Let's try the centre of town please
PMUL2516.json	13	University Arms Hotel is a great hotel in the centre in the expensive price range. Would you like to make a reservation?
PMUL2516.json	14	Do it also have free parking?
PMUL2516.json	15	Yes it does include free parking.
PMUL2516.json	16	Thank you, I would like to book it for 8 people for 2 nights starting from friday
PMUL2516.json	17	Booking was successful. Reference number is : FN6WAJPB . Is there anything else I can do for you?
PMUL2516.json	18	Great, thank you so much for your help today.
PMUL2516.json	19	You're welcome. Is there anything else that I can do for you today?
PMUL2516.json	20	No that is it. Thank you.
PMUL2516.json	21	Thanks for letting us assist you today! Enjoy your visit! Goodbye.
SNG0145.json	0	Help! I was in a car accident dispute!
SNG0145.json	1	The Parkside Police Station's telephone number is 01223358966. Are you in need of medical assistance? The Addenbrookes Hospital's Telephone number is 01223245151
SNG0145.json	2	I was in a car accident dispute and need some info. I need a phone number, address, and postcode.
SNG0145.json	3	Oh no! The telephone number for the police is 01223358966, their address is Parkside, Cambridge, and their postcode is CB11JG. I hope no one was injured!
SNG0145.json	4	Thanks for the information. I have to be going. Goodbye. And thanks again.
SNG0145.json	5	I hope you get it all settled quickly! Goodbye!
PMUL2302.json	0	Hello, can you help me locate swimming pools on the east side of Cambridge?
PMUL2302.json	1	There is one swimming pool called abbey pool and astroturf pitch, located at pool way, whitehill road, off newmarket road. Do you need anything else?
PMUL2302.json	2	please provide its phone number.
PMUL2302.json	3	They can be reached at 01223902088, can I help with anything else?
PMUL2302.json	4	Yes, please. I would like a restaurant in the same area that serves British food.
PMUL2302.json	5	Grafton hotel restaurant serves British food and is in the east. Would you like a reservation?
PMUL2302.json	6	Yes please make a reservation
PMUL2302.json	7	What day and time would you like the reservation for?
PMUL2302.json	8	I'm not sure quite yet. Can I please have the phone number and address?
PMUL2302.json	9	Yes, the address is Grafton Hotel 619 Newmarket Road Fen Ditton and the phone number is 01223241387. Anything else I can help with?
PMUL2302.json	10	That takes care of what I needed. Thanks. Have a good day. Bye.
PMUL2302.json	11	Thank you.
PMUL2965.json	0	Hello, I am looking for a museum in Cambridge. What museums are there?
PMUL2965.json	1	The broughton house gallery is a museum in Cambridge's centre. Was there a particular side of the city you would like?
PMUL2965.json	2	I didn't have an area preference so that works.
PMUL2965.json	3	Very good. They are at 98 King Street, CB11LN. Their phone number is 01223314960, and admission is free. Can I help you with anything else?
PMUL2965.json	4	I also need to book a room in a 2 star hotel.
PMUL2965.json	5	There are 3 hotels that have 2 stars do you have a price range or an area you want to stay in?
PMUL2965.json	6	A hotel in the moderate price range that includes free parking.
PMUL2965.json	7	I recommend the Ashley Hotel. It's a nice little place on the north side of town. Would you like to book a room?
PMUL2965.json	8	Yes please. I'll need to for 5 nights starting on Saturday for 5 people.
PMUL2965.json	9	Booking was successful. Your reference number is AABMC4EP . Will that be all?
PMUL2965.json	10	I also need to get a taxi to leave the attraction by 21:30. I need a contact number and car type.
PMUL2965.json	11	Where would you like to go from the Broughton House Gallery?
PMUL2965.json	12	yes thats exactly where I want to go
PMUL2965.json	13	a very cool white tesla will be picking you up contact number is 07558242015
PMUL2965.json	14	Thank you. That is all I need.
PMUL2965.json	15	Have a lovely day, goodbye.
PMUL4240.json	0	I am planning a trip in Cambridge
PMUL4240.json	1	Alright, how can I help you today?
PMUL4240.json	2	I am looking for a restaurant that serves Afghan food in the centre.
PMUL4240.json	3	There are no Afghan restaurants in the centre of town.
PMUL4240.json	4	What about an international restaurant?
PMUL4240.json	5	May I recommend the Bloomsbury restaurant in the moderate price range.
PMUL4240.json	6	What's the postcode for that place?
PMUL4240.json	7	cb23dt. What else may I help with?
PMUL4240.json	8	I am looking for a train that will depart from Cambridge and will arrive to London Liverpool Street.
PMUL4240.json	9	sure, what day are you traveling?
PMUL4240.json	10	I will be leaving on Friday after 08:30.
PMUL4240.json	11	train ID TR4187 leaves 13:59 and will cost 16:60 pounds. can i book for you?
PMUL4240.json	12	No, thanks! But how long is the ride?
PMUL4240.json	13	The train ride is 88 minutes long.
PMUL4240.json	14	Thank you, that will be all.
PMUL4240.json	15	You're welcome, have a good day.
SNG1149.json	0	My brother told me about this attraction place called Abbey Pool and Astroturf Pitch. Would you be able to tell me where it is?
SNG1149.json	1	Yes, abbey pool and astroturf pitch is a swimming pool on the east side of town. What other information would you like?
SNG1149.json	2	Could you tell me the entrance fee for that?
SNG1149.json	3	I'm sorry, I don't have that information. You could call them at 01223902088 and ask though. Can I help you with anything else?
SNG1149.json	4	No, thanks. I think that will take care of it. Have a good night!
SNG1149.json	5	You're quite welcome! Thanks for contacting the Cambridge TownInfo Centre and have a great day!
PMUL3185.json	0	I'm looking for some information about places to go in Cambridge.
PMUL3185.json	1	Is there a particular area of town that you would like to visit?
PMUL3185.json	2	in the west. let me know the attraction type and entrance fee
PMUL3185.json	3	Magdalene college is a college with free admission.
PMUL3185.json	4	Sounds good, Can you lookup places to stay that are 4 stars and moderately priced?
PMUL3185.json	5	I havea few. What area are you looking at?
PMUL3185.json	6	The same area as the attraction.
PMUL3185.json	7	I'm sorry, I don't have anything in the West area that matches what you are looking for. Is there anything else that I can do for you?
PMUL3185.json	8	How about in the cheap range?
PMUL3185.json	9	We have finches bed and breakfast guesthouse and the cambridge belfry hotel, any preferences?
PMUL3185.json	10	I'd like the finches bed and breakfast guesthouse
PMUL3185.json	11	Can I book this for you?
PMUL3185.json	12	Yes, please book it and give me the reference number.
PMUL3185.json	13	On what day would you like to arrive?
PMUL3185.json	14	on thursday please
PMUL3185.json	15	I can book that for you now.
PMUL3185.json	16	book it for 8 peple and 4 nights from thursday
PMUL3185.json	17	Booking was successful. Reference number is : PNPGQMFM .
PMUL3185.json	18	I also want to book a taxi to commute between the two places.
PMUL3185.json	19	what time do you want to arrive?
PMUL3185.json	20	I need to leave the hotel by 22:00.
PMUL3185.json	21	Okay, good deal. I've booked the taxi for you. Your car type will be a white bmw, and the contact number is 07786419072.
PMUL3185.json	22	Well thank you that will be all for today
PMUL3185.json	23	Is there anything else I can do for you?
PMUL3185.json	24	That is all I need.
PMUL3185.json	25	Thank you for using Cambridge TownInfo centre and enjoy your visit. Goodbye.
SSNG0146.json	0	Hi! I need a restaurant that serves Chinese food please!
SSNG0146.json	1	There are quite a few Chinese restaurants. Are you looking for one in particular area or price range?
SSNG0146.json	2	Yes. I would like an expensive one please.
SSNG0146.json	3	What about Hakka? It is an expensive Chinese restaurant in the north part of town.
SSNG0146.json	4	I'm looking for a restaurant in the centre of town. Are there any available?
SSNG0146.json	5	I have a listing for ugly duckling,would you like me to make a reservation?
SSNG0146.json	6	Yes please, I would like to book a table for 5 people at 11:30 on Wednesday. I would also like a reference number please.
SSNG0146.json	7	I have Tang Chinese open then, Reference number is : 1AZI69I4 . Need anything else?
SSNG0146.json	8	That is everything. Thanks!
SSNG0146.json	9	You are welcome. Enjoy your meal at Tang Chinese. Good Bye.
PMUL1443.json	0	I am looking for boating places can town, can you tell me if there are any available?
PMUL1443.json	1	There is boating in the east, north, and in the centre. Do you have a preference?
PMUL1443.json	2	No, i just want to know the entrance fee.
PMUL1443.json	3	I'm sorry, I don't have any information on the entrance fees. Would you like the phone numbers?
PMUL1443.json	4	No, but can I get the postcode and address of the one in the East, please?
PMUL1443.json	5	Camboats is found in the east. Their postcode is cb58sx and their number is 01223902112
PMUL1443.json	6	I need the address as well please?
PMUL1443.json	7	Their address is the plough, green end, fen ditton. Is there anything else you need?
PMUL1443.json	8	Yes, I need to catch a train to Cambridge for Sunday. I'll be departing from bishops stortford.
PMUL1443.json	9	What time would you like to arrive?
PMUL1443.json	10	I need to arrive by 21:30 please.
PMUL1443.json	11	Okay! The latest one that you can take leaves at 19:29. Would you like me to book that for you?
PMUL1443.json	12	What is the arrival time?
PMUL1443.json	13	the train will arrive by 14:07 or earlier if you need.
PMUL1443.json	14	I'll take the latest one. Please get me 6 ticketss
PMUL1443.json	15	Your tickets have been booked. Your reference number is MNOJ7KDZ .
PMUL1443.json	16	Thank you so much. I appreciate your help.
PMUL1443.json	17	What else can I look up for you?
PMUL1443.json	18	Nothing, that is all that I need. Thank you.
PMUL1443.json	19	Thank you and have a wonderful day!
SSNG0084.json	0	Can you help me find a restaurant please?
SSNG0084.json	1	Certainly, to narrow it down, do you have a preference for what part of the city it is in or what type of food is served?
SSNG0084.json	2	I want one in the certre area and in the moderate price range.
SSNG0084.json	3	I have found some restaurants. They serve asian oriental, british, chinese, european, gastropub, international, italian, lebanese, modern european, spanish, and turkish.
SSNG0084.json	4	I don't care what type of food they serve. What would you recommend?
SSNG0084.json	5	I've heard good things about Riverside Brasserie, they serve Modern European cuisine. Would you like to see if they have tables available?
SSNG0084.json	6	That sounds good, I have a group of seven and we want to eat at 20:00 on Friday.
SSNG0084.json	7	Unfortunately I wasn't able to get the reservation for you. Would you like me to try somewhere else?
SSNG0084.json	8	Can you recommend another moderately priced restaurant located in the centre?
SSNG0084.json	9	What about the Copper Kettle? They serve British cuisine.
SSNG0084.json	10	That would work, please book that.
SSNG0084.json	11	Good news! Booking was successful. The table will be reserved for 15 minutes. Reference number is : ZXIRY17R .
SSNG0084.json	12	Thanks for all your help. Good bye.
SSNG0084.json	13	Thank you goodbye.
PMUL4257.json	0	Hello, do you know of any boat attractions in the East of town?
PMUL4257.json	1	Camboats is a boat attraction in the east area of town. Would you like more information about them?
PMUL4257.json	2	Yeah, can I get the entrance fee and postcode?
PMUL4257.json	3	I don't have any information on their entrance fee, but their postcode is cb58sx.
PMUL4257.json	4	I can give Camboats a call. Do you have their phone number?
PMUL4257.json	5	Yes, they can be reached at 01223902112. Is there anything else I can help you with?
PMUL4257.json	6	Yes, I'm also looking for a moderately priced italian restaurant preferably in the same area as camboats
PMUL4257.json	7	There is one option here. It is pizza hut fen ditton. Would you like a table reserved?
PMUL4257.json	8	Yes. There will be 6 of us dining.
PMUL4257.json	9	What day and time do you want me to book it for?
PMUL4257.json	10	Monday, 14:15. Please include the reference number.
PMUL4257.json	11	Your booking was successful, here is your reference number JLI059GG .
PMUL4257.json	12	Thanks, that'll be it for me today. Bye!
PMUL4257.json	13	Thanks for contacting us enjoy your stay with us!
WOZ20451.json	0	I am looking for a moderately priced restaurant in the south part of town.
WOZ20451.json	1	There are two moderately priced restaurants in the south. Would you prefer Italian or Modern European?
WOZ20451.json	2	May I have the address and phone number of the Italian restaurant?
WOZ20451.json	3	That would be the Pizza Hut Cherry Hinton at G4 Cambridge Leisure Park Clifton Way Cherry Hinton, and they can be reached at 01223 323737. Can I help you with anything else today?
WOZ20451.json	4	Thank you goodbye.
WOZ20451.json	5	Thank you, goodbye!
MUL0400.json	0	I need a training heading out from Leicester that leaves on Thursday.
MUL0400.json	1	there are multiple trains leaving for Leicester on Thursday. what time would you like to depart?
MUL0400.json	2	I would like to go to cambridge and arrive by 12:30.
MUL0400.json	3	There are 6 trains that leave Leicester and arrive in Cambridge by 12:30, what time would you like to leave by?
MUL0400.json	4	I don't care what time I leave. I do need the price and train ID though.
MUL0400.json	5	There is a train departing at 10:09 and arriving at 11:54 with a ticket cost of 37.80 pounds. TrainID is TR2058. Shall I book that for you?
MUL0400.json	6	Yes please. I am also looking for a place to eat. Are there any restaurants in East Cambridge that serve unusual foods?
MUL0400.json	7	I'm sorry, but there are no restaurants in all of Cambridge that serve unusual food. Would you like to try a different cuisine?
MUL0400.json	8	Oh well, thank you anyway.
MUL0400.json	9	You are welcome!! Goodbye.
MUL0572.json	0	I'd like to book a train ticket, please.
MUL0572.json	1	Where are your departure and destination sites?
MUL0572.json	2	I'm looking for a train that is leaving on Friday after 21:45.
MUL0572.json	3	There are 46 trains operating on Friday at that time. Can I get your destination to narrow down the results?
MUL0572.json	4	Yes. I would like to go to Leicester. What trains are available?
MUL0572.json	5	I have two trains going from cambridge to leicester. One leaving at 22:21 and one leaving at 23:21. Would you like to book one of these?
MUL0572.json	6	I will go with the earlier departure, and I would like 2 seats please. I will also need a reference number.
MUL0572.json	7	You're all set for your 22:21 train reference number 1F6TADIT
MUL0572.json	8	Great, I also need a place to go in the east part of town.
MUL0572.json	9	Are you looking for a particular type of attraction on the east end of town? Perhaps a museum?
MUL0572.json	10	Sure,a museum sounds good, what do you have that's free?
MUL0572.json	11	Cambridge artworks, gallery at twelve a high street, saint barnabas press gallery and cherry hinton water play are all free.
MUL0572.json	12	Hmm, I guess the St Barnabas thing sound interesting. Is it expensive, though?
MUL0572.json	13	It is free
MUL0572.json	14	Great thank you that's all the help I need today.
MUL0572.json	15	Wonderful! I hope you have a wonderful rest of the day.
PMUL1915.json	0	Find me a place to stay. I need a hotel in the moderate price range with a star of 4.
PMUL1915.json	1	What area of town interests you most ?
PMUL1915.json	2	Any area is fine, as long as the place has free wifi.
PMUL1915.json	3	Will you need free parking as well?
PMUL1915.json	4	Yes, I will also need free parking.
PMUL1915.json	5	There are no hotels in the moderate price range with a 4 star rating. Is there another price range or star rating that you would like me to check?
PMUL1915.json	6	Just check moderate price range then please!
PMUL1915.json	7	We have the Ashley Hotel and Lovell Lodge that fit what you want, would you like me to book one for you?
PMUL1915.json	8	Yes just for me. For four nights please
PMUL1915.json	9	What day would you like you stay to start?
PMUL1915.json	10	I would like my reservations to start on sunday.
PMUL1915.json	11	Done! Your reference number is WTJER271 . Can I help you with anything else?
PMUL1915.json	12	i also want a train to take me to ely
PMUL1915.json	13	On what day do you need to go to Ely?
PMUL1915.json	14	Thursday, please. I need to leave from Cambridge.
PMUL1915.json	15	Ok! There are 10 trains; do you have a time preference?
PMUL1915.json	16	Yes, I would like to arrive by 20:15.
PMUL1915.json	17	TR7355 arrives in ely by 18:07, or there is also one that arrives by 20:07. Would you like to book a ticket for one of these?
PMUL1915.json	18	Yes please. I need one ticket.
PMUL1915.json	19	Your ticket has been booked. Your reference number is 561MGK3J. Is there anything else I can do for you?
PMUL1915.json	20	That was all I needed.
PMUL1915.json	21	Thank you for contacting us and have a nice day.
MUL1953.json	0	Hi, could you tell me if Cambridge Book and Print Gallery is still open?
MUL1953.json	1	Yes, but I am unable to make a booking for you. Would you like to do anything else?
MUL1953.json	2	That's fine, could you give me the address for the gallery please?
MUL1953.json	3	The address is 49 newnham road, is there anything else I could do for you?
MUL1953.json	4	Yes, I also need to find a train leaving from cambridge. Can you help me with that?
MUL1953.json	5	Absolutely, where would you like to go?
MUL1953.json	6	I would like to go to london liverpool street on Thursday. I would like to leave after 16:00.
MUL1953.json	7	There are 4 trains that run during that period, do you have a preference for your arrival time?
MUL1953.json	8	Just any time leaving after 16:00, and I need tickets for 5 people.
MUL1953.json	9	Booking was successful, the total fee is 83 GBP payable at the station . Reference number is : IG0M4C9S .
MUL1953.json	10	Great! I think that is all I need. I appreciate your help today.
MUL1953.json	11	Glad I could help you. Have a nice day.
MUL1953.json	12	Thank you! You have a nice day as well.
MUL1953.json	13	Thank you for contacting Cambridge TownInfo Centre, have a great day!
MUL1953.json	14	Thank you, you as well, goodbye.
MUL1953.json	15	Goodbye to you as well. I hope you have a wonderful day.
MUL2158.json	0	Hello, I am looking for a train departing from cambridge on tuesday.
MUL2158.json	1	Where will you be traveling to?
MUL2158.json	2	To Broxbourne.
MUL2158.json	3	I have 19 trains going to your destination. To help narrow down the search, can you tell me what time you want to leave or arrive by?
MUL2158.json	4	I would like to leave after 17:30.
MUL2158.json	5	First train pulls out at 18:01. Can I get you tickets?
MUL2158.json	6	No thank you but can I get the Train ID and travel time for that?
MUL2158.json	7	Sure. It's train TR5484 and it has a duration of 60 minutes. Is there anything else I can help you with today?
MUL2158.json	8	I would like to find a hotel that is in the moderate price range in the centre.
MUL2158.json	9	I have just 1 hotel that fits your criteria. It is CityRoomz located in the centre of town. It has a 0 star rating. They offer free internet.
MUL2158.json	10	Thank you. I'd like to book a room for myself on friday, for four nights.
MUL2158.json	11	The booking was successful. Reference number is : JUIAKE8A .
MUL2158.json	12	Wonderful. Thank you for all of your help!
MUL2158.json	13	Is there anything else I can do for you today?
MUL2158.json	14	No thank you. You've been very helpful.
MUL2158.json	15	Thank you, and please feel free to contact us with any other questions you might have! Have a great day!
PMUL3196.json	0	I would like a restaurant in the south in the expensive range.
PMUL3196.json	1	Okay! What type of cuisine do you want? Chinese, Indian, Italian, and Mexican cuisines are available.
PMUL3196.json	2	I would like a Chinese restaurant.
PMUL3196.json	3	Your options are the Good Luck Chinese Food Takeaway, or Peking Restaurant.
PMUL3196.json	4	Let's try the Peking Restaurant, can you make a reservation for us on Monday? Around 13:45 please.
PMUL3196.json	5	Yes certainly but how many people will be dining please?
PMUL3196.json	6	It will be 6 people dining.
PMUL3196.json	7	Okay, I've got that taken care of. Your reference number is ECBRMJS2 . Can I help you with anything else?
PMUL3196.json	8	Yes. I'm looking for something to do while I'm in town.
PMUL3196.json	9	There are museums, architecture, colleges, theater, cinema, boat tour. Doers anything interest you in particular.
PMUL3196.json	10	in the same area as the restaurant? I am interested in architecture please
PMUL3196.json	11	There is no architecture in the south of town
PMUL3196.json	12	Perhaps you could locate a park in the south?
PMUL3196.json	13	There is the Wandlebury Country park. Phone 01223243830. Would you like anything else?
PMUL3196.json	14	Could you call and find out what hours they open and close? Also, if they have tours?
PMUL3196.json	15	It appears that they do not have tours. It is a free admission, so you can feel free to go when you please. Can I help with anything else?
PMUL3196.json	16	No that is all I need for today.
PMUL3196.json	17	okay sounds good.
SNG01277.json	0	I am looking for a train. The train should leave on tuesday and should depart from peterborough
SNG01277.json	1	There are several trains that meet that criteria. What destination are you looking for?
SNG01277.json	2	I need to leave from Peterborough.
SNG01277.json	3	How about TR5042 that arrives at 05:19?
SNG01277.json	4	I'd like to arrive by 10:45, do you have something close to that time?
SNG01277.json	5	There are several trains that meet that criteria. what time would you like to depart?
SNG01277.json	6	Departure time doesn't matter, just want to arrive by 10:45 so whatever is closest to that arrival time.
SNG01277.json	7	Great, I have a train that meets your criteria. Would you like me to book it for you?
SNG01277.json	8	Wait, does this train go to Cambridge? That's my destination.
SNG01277.json	9	Yes I have a train that arrives at Cambridge on tuesday at 10:38 would you like me to book that for you?
SNG01277.json	10	Yes please book it.
SNG01277.json	11	I'd be happy to help with your request, how many tickets do you need?
SNG01277.json	12	Just one please.
SNG01277.json	13	Booking was successful, the total fee is 16.5 GBP payable at the station. Reference number is : ORMU35RU .
SNG01277.json	14	I didn't actually need to reserve a seat. Could you comfirm the departure time of that train?
SNG01277.json	15	TR9620 leaves at 09:48. Do you need anything else?
SNG01277.json	16	No, that's all I need for now, thanks!
SNG01277.json	17	You're welcome. Have a safe trip!
MUL0645.json	0	I am looking for moderately-priced three-star guesthouse in Cambridge.
MUL0645.json	1	There are four guesthouses that meet your criteria. Do you need internet or parking?
MUL0645.json	2	It doesn't need to have free parking and I don't care about the internet. Which guesthouse can accommodate for 3 people?
MUL0645.json	3	I have located one hotel matching your search criteria, the Alpha-Milton Guest House. The phone number is 01223311625. Would you like to make a reservation?
MUL0645.json	4	I would like to call them myself please. Thank you.
MUL0645.json	5	Sure. Is there anything else I can help you with today?
MUL0645.json	6	Yes please. Can I actually have you book them? I need the reference number as well.
MUL0645.json	7	Sure. I will need to know how many people you would like to book it for, what day you would like and how many days you would like to stay.
MUL0645.json	8	I'll need the reservation for 3 people starting Saturday for 4 nights.
MUL0645.json	9	I have booked your stay at the alpha-milton guest house. The reference number is HS3MWJ10
MUL0645.json	10	Thank you, I will also need a train from Peterborough to Cambridge on Saturday. Is there anything available?
MUL0645.json	11	There are 38 trains from Peterborough to Cambridge on Saturday, all throughout the day. Can narrow down the time of day you wish to travel?
MUL0645.json	12	I wish to arrive before 12:45.
MUL0645.json	13	There are 14 trains arriving by that time. When would you like to leave?
MUL0645.json	14	Saturday from Peterborough to Cambridge for 3 people. I will need the reference number too please.
MUL0645.json	15	Right, Saturday, did you have a time you want to leave by? The trains leave every 30 minutes starting at 5:19
MUL0645.json	16	It doesn't matter when I leave, as long as I arrive by 12:45.
MUL0645.json	17	TR5538 leaves at 11:48 and will arrive by 12:38. Would you like for me to book this train for you?
MUL0645.json	18	Yes, for the same group of 3 people from before.
MUL0645.json	19	Your booking was successful. Reference number is PR8JE3DU and total is 39.59 GBP. Can I help you with anything else today?
MUL0645.json	20	No I think that will be it, thank you for your help!
MUL0645.json	21	You're welcome. Enjoy your time in Cambridge!
PMUL3452.json	0	List all thursday train times heading to cambridge.
PMUL3452.json	1	There are 202 entries, can you please be more specific?
PMUL3452.json	2	Okay, I guess that would be quite a lot of typing. How about this: I need a train leaving from Leicester sometime after 21:45 on Thursday.
PMUL3452.json	3	What time would you like to leave?
PMUL3452.json	4	Anytime after 21:45 is good.
PMUL3452.json	5	I have train TR8149 leaving at 22:09,is that okay?
PMUL3452.json	6	That is fine. Can you give me the price and travel time, please?
PMUL3452.json	7	It is 37.80 pounds and travel time is 105 minutes. Do you need anything else?
SNG1028.json	0	Hi I'd like to find a hotel to stay in. Somewhere with free wi-fi.
SNG1028.json	1	We have 9 hotels that offer free wifi. Do you have a star rating, area of town, or price range in mind?
SNG1028.json	2	I would like to keep it cheap if possible and something 4 star rated please.
SNG1028.json	3	There's the Cambridge Belfry. Shall I make you a reservation, then?
SNG1028.json	4	Yes, please. It is for 2 nights starting on Tuesday for 7 people.
SNG1028.json	5	Perfect, I booked that for you. Reference number is 42JFPPK8 . Is there anything else I can help you with today?
SNG1028.json	6	No, that's all I need. Thank you for your help!
SNG1028.json	7	You're quite welcome. Thanks for contacting the Cambridge TownInfo Centre and have a great day!
PMUL0970.json	0	I'm looking for a cheap place to eat.
PMUL0970.json	1	There a good number of cheap restaurants in town. Are you looking for a particular type of food?
PMUL0970.json	2	No, I just want to try something new. Could you suggest a couple of less common cuisines?
PMUL0970.json	3	I would recommend the gardenia, a mediterranean restaurant located in the centre of town at 2 Rose Crescent City Centre. Would you be interested in reserving a table?
PMUL0970.json	4	yes, reserve a table for two on thursday
PMUL0970.json	5	Sure, I just need to know what time you would like to dine.
PMUL0970.json	6	At 14:00 please
PMUL0970.json	7	I have reserved your table. Your reference # is GDP785RS . Is there anything else I can help you with?
PMUL0970.json	8	Yes, I also need a train departing from bishops stortford going to cambridge.
PMUL0970.json	9	What day would you be traveling on?
PMUL0970.json	10	I will be traveling on Thursday, the same as the restaurant reservation.
PMUL0970.json	11	There's a train leaving every two hours on Thursday, what time would you like to depart?
PMUL0970.json	12	It doesn't really matter, but I need to be there by 9:30. So, the closest I can get to that will be good.
PMUL0970.json	13	Ok great. The TR1242 will fit your needs. How many tickets would you like to book?
PMUL0970.json	14	No thank you, but could you let me know the length of travel and the price of the train tickets?
PMUL0970.json	15	It's a 38 minute ride and it will cost 10.10.
PMUL0970.json	16	that is all i wanted for today. thanks
PMUL0970.json	17	Your welcome. It has been a pleasure assisting you today. Goodbye
WOZ20441.json	0	Hello, I am looking for a moderately priced restaurant on the west side of town.
WOZ20441.json	1	Meghna, is in the west part of town and in the moderate price range.
WOZ20441.json	2	Is there anything else? Can I have the address and phone number please?
WOZ20441.json	3	Okay, Meghna's phone number is 01223 727410 and they are located at 205 Victoria Road Chesterton. Is there anything else I can do for you?
WOZ20441.json	4	Are there any other restaurants in that price range and part of town?
WOZ20441.json	5	Yes, prezzo serving italian food, and saint johns chop house serving british food are also in the west part of town.
WOZ20441.json	6	What is the address and phone number?
WOZ20441.json	7	Thier address is 21 - 24 Northampton Road and phone number is 01799 521260
WOZ20441.json	8	Thank you goodbye.
WOZ20441.json	9	I hope you enjoy Saint Johns Chop House. Goodbye.
MUL2345.json	0	Find me a modern european restaurant in the south.
MUL2345.json	1	I found Restaurant alimentum that fits your needs. Would you like me to book that for you?
MUL2345.json	2	Is it in the moderate price range?
MUL2345.json	3	Yes it is. Would you like me to book it for you?
MUL2345.json	4	Yes, book for 7 people at 15:30 on friday please.
MUL2345.json	5	I'm sorry, that isn't available for that time slot. Can you change it perhaps?
MUL2345.json	6	Well how about 14:30 then?
MUL2345.json	7	Yes, I was able to book your party at 14:30. Your reference number is 7H21OO6L . Please note the table will be held for 15 minutes. You need anything else?
MUL2345.json	8	do you know where castle galleries is
MUL2345.json	9	Yes, the address is unit su43, grande arcade, saint andrews street.
MUL2345.json	10	What is the post code, area of town, and type of attraction?
MUL2345.json	11	The post code is cb23bj, it is in the centre of town, and it is a museum.
MUL2345.json	12	I also need a taxi, to go between the two places.
MUL2345.json	13	Sure! When would you like to leave and arrive by?
MUL2345.json	14	I would like to arrive at the restaurant in time for my booking.
MUL2345.json	15	I have booked a grey Volvo for you. The contact number is 07114144706. Is there anything else I can do for you?
MUL2345.json	16	No thanks. I think that was all. Have a good day. Bye.
MUL2345.json	17	Glad to have been of help. Take care.
PMUL3305.json	0	i'm looking for places to go in town
PMUL3305.json	1	There are many fun attractions to go to around town and most are free. Is there a particular type of attraction you are interested in?
PMUL3305.json	2	What's the best place to go on the east side of town?
PMUL3305.json	3	I'm a big fan of the Funky Fun House, which is an entertainment venue.
PMUL3305.json	4	Okay what is the entrance fee?
PMUL3305.json	5	I don't have that information available. Their phone number is 01223304705 if you'd like to call. Can I help with anything else?
PMUL3305.json	6	I need a really cheap hotel with a 4 star rating
PMUL3305.json	7	The Cambridge Belfry will fit your needs. Would you like for me to book a room for you?
PMUL3305.json	8	yes, please. 5 people for 5 nights starting from friday.
PMUL3305.json	9	Booking was successful. Reference number is I5ZE4AQV .
PMUL3305.json	10	That's great, thanks! That's all I needed!
PMUL3305.json	11	You're welcome. Have a good day.
PMUL3305.json	12	All the help I needed. Bye, thanks.
PMUL3305.json	13	Great. Thanks for letting us assist you today!
SNG01831.json	0	I am looking for the Parkside Police Station
SNG01831.json	1	Parkside Police Station is located in Parkside, Cambridge, within the postcode of CB11JG. May I help with something else?
SNG01831.json	2	Yes, can you please provide their phone number and physical address?
SNG01831.json	3	The phone number is 01223358966. We have already given you the physical address..
SNG01831.json	4	Well, gee, so you have. Thank you so much for your help. Bad attitude or not. Bye now.
SNG01831.json	5	Have a nice day!
SNG1006.json	0	I'm looking for a hotel to stay at in the centre, can you look this up for me?
SNG1006.json	1	There are three hotels in the center of town. Do you prefer something moderate or expensive?
SNG1006.json	2	Not in terms of that, but do they have free parking and have a 3 star rating?
SNG1006.json	3	The Gonville hotel has 3 stars and parking, and the University Arms hotel has 4 stars and parking. They are both expensive. Would you like more details?
SNG1006.json	4	Okay, I'd like to book a room at the Gonville Hotel for 4 nights. There will be 6 people and we will be arriving on Saturday.
SNG1006.json	5	I'm sorry, there are no rooms available for that length of stay. Could you shorten your stay or book a different day possibly?
SNG1006.json	6	Yes, what about 2 nights instead of 4?
SNG1006.json	7	Sure, that worked. You have booked 2 nights and your reference number is RU89U6V8 . Can I be of further help today?
SNG1006.json	8	No, that looks like everything. Thanks. Bye.
SNG1006.json	9	You're welcome. Enjoy your stay!
SNG1123.json	0	I would like to visit some of the architecture here in town. Can you help me with this?
SNG1123.json	1	I can indeed. We have several churches and a school renowned for their architecture. Great Saint Mary's Church charges visitors 2 pounds, but the rest are free.
SNG1123.json	2	Can you give me information on a free one and I'd need to know what area of town it is in please.
SNG1123.json	3	all saints church is free and it's in the centre, located at jesus lane. Their number is 01223452587.
SNG1123.json	4	Thank you very much for your help.
SNG1123.json	5	You are very welcome. Was there anything else I can assist you with?
SNG1123.json	6	No, thank you, that's all I need today. Bye.
SNG1123.json	7	Have fun! Goodbye!
SNG0925.json	0	Hi, can you help me find a moderately priced 3-star accomadation?
SNG0925.json	1	I have 4 guesthouses with 3 stars that are moderately priced. Do you need internet or parking?
SNG0925.json	2	I do not need internet.
SNG0925.json	3	I have 2 in the north and 1 in both the south and west. Do you have a preference for location?
SNG0925.json	4	I don't, which do you recommend?
SNG0925.json	5	The hamilton lodge is in the north area and has parking and internet. Would you like me to book that for you?
SNG0925.json	6	Sure, book it for 1 person and 2 nights, starting from Wednesday.
SNG0925.json	7	Okay. You're booked. Your reference number is 3A23GV4H . Anything else?
SNG0925.json	8	That's all I needed. Thanks!
SNG0925.json	9	Enjoy your stay! Goodbye!
MUL1853.json	0	Hi! I am looking for a train that arrives by 11:30 on Friday.
MUL1853.json	1	I have 122 trains that are arriving by 11:30. Do you know where the train is coming from?
MUL1853.json	2	The train should depart from Bishops Stortford and should go to Cambridge.
MUL1853.json	3	TR2083 leaves Bishops Stortford at 09:29 on Friday and arrives in Cambridge at 10:07. Would you like to purchase tickets?
MUL1853.json	4	Yes please. I will need 5 seats.
MUL1853.json	5	Ok, your booking is complete! The total is 50.5 GBP and is payable at the station. Your confirmation number is RGOWFL51
MUL1853.json	6	Great. I am also looking for suggestions on places to go in the centre of town. Can you help me with that?
MUL1853.json	7	I show 44 attractions in the centre area. Is there a specific type you would prefer?
MUL1853.json	8	Do you have any multiple sports?
MUL1853.json	9	There are no attractions matching that description. Would you like me to search for parks in the area?
MUL1853.json	10	Do you have any architecture attractions
MUL1853.json	11	Yes many. All Saints Church is a famous one with no entrance fee.
MUL1853.json	12	That sounds great, plus it's free. Can I book that for 5 please?
MUL1853.json	13	Attractions are one thing we can't book for you, unfortunately. Is there anything else you need today?
MUL1853.json	14	Can you please give me the phone number and post code for All Saints Church then?
MUL1853.json	15	All Saints Church phone is 01223452587. Their postcode is cb58bs. Is there anything else I can help you with today?
MUL1853.json	16	That should be all I need. Thanks for your help.
MUL1853.json	17	You're welcome. Have a great time!
WOZ20361.json	0	I would like the phone number of an expensive restaurant on the east side of town, please.
WOZ20361.json	1	There are five restaurants in the expensive price range and in the east part of town. What kind of food would you like?
WOZ20361.json	2	I would like Indian food please.
WOZ20361.json	3	Sitar Tandoori is an expensive indian restaurant in the east part of town.
WOZ20361.json	4	Is there anything else?
WOZ20361.json	5	Pipasha Restaurant is in the expensive category and serves Indian food. It is in the east part of town.
WOZ20361.json	6	what is there phone number?
WOZ20361.json	7	Their phone number is 01223 577786. Do you need their address also?
WOZ20361.json	8	no, thank you. Goodbye.
WOZ20361.json	9	Goodbye.
WOZ20469.json	0	Hello, I am looking for a cheap restaurant that serves german food.
WOZ20469.json	1	It looks like there are no German restaurants in the city. Would you like me to check for a different type of restaurant?
WOZ20469.json	2	Yes, how about portuguese food?
WOZ20469.json	3	There are two restaurants in the cheap price range that serve Portuguese food. What area would you like to go to?
WOZ20469.json	4	It doesn't matter.
WOZ20469.json	5	nandos serves portuguese food and in the cheap price range. is there anything else I can help you with?
WOZ20469.json	6	I would like the address of Nandos restaurant, please.
WOZ20469.json	7	Nandos is located in the south part of the city and the address is Cambridge Leisure Park Clifton Way. Anything else you need?
WOZ20469.json	8	Thank you, goodbye.
WOZ20469.json	9	Thank you good bye.
